{"https://doi.org/10.1145/3434282":{"title":"Denis Kuperberg, Laureline Pinault, Damien Pous: Cyclic proofs, system t, and the power of contraction. 1-28","address":"https://doi.org/10.1145/3434282","index":0},"https://doi.org/10.1145/3434283":{"title":"Patrick Bahr, Christian Uldal Graulund, Rasmus Ejlers Møgelberg: Diamonds are not forever: liveness in reactive programming with guarded recursion. 1-28","address":"https://doi.org/10.1145/3434283","index":1},"https://doi.org/10.1145/3434284":{"title":"Benjamin Sherman, Jesse Michel, Michael Carbin: 𝜆ₛ: computable semantics for differentiable programming with higher-order functions and datatypes. 1-31","address":"https://doi.org/10.1145/3434284","index":2},"https://doi.org/10.1145/3434285":{"title":"Roy Margalit, Ori Lahav: Verifying observational robustness against a c11-style memory model. 1-33","address":"https://doi.org/10.1145/3434285","index":3},"https://doi.org/10.1145/3434286":{"title":"Frantisek Farka, Aleksandar Nanevski, Anindya Banerjee, Germán Andrés Delbianco, Ignacio Fábregas: On algebraic abstractions for concurrent separation logics. 1-32","address":"https://doi.org/10.1145/3434286","index":4},"https://doi.org/10.1145/3434287":{"title":"Aïna Linn Georges, Armaël Guéneau, Thomas Van Strydonck, Amin Timany, Alix Trieu, Sander Huyghebaert, Dominique Devriese, Lars Birkedal: Efficient and provable local capability revocation using uninitialized capabilities. 1-30","address":"https://doi.org/10.1145/3434287","index":5},"https://doi.org/10.1145/3434288":{"title":"Koen Jacobs, Amin Timany, Dominique Devriese: Fully abstract from static to gradual. 1-30","address":"https://doi.org/10.1145/3434288","index":6},"https://doi.org/10.1145/3434289":{"title":"Gilles Barthe, Rohit Chadha, Paul Krogmeier, A. Prasad Sistla, Mahesh Viswanathan: Deciding accuracy of differential privacy schemes. 1-30","address":"https://doi.org/10.1145/3434289","index":7},"https://doi.org/10.1145/3434290":{"title":"Chao-Hong Chen, Amr Sabry: A computational interpretation of compact closed categories: reversible programming with negative and fractional types. 1-29","address":"https://doi.org/10.1145/3434290","index":8},"https://doi.org/10.1145/3434291":{"title":"Simon Oddershede Gregersen, Johan Bay, Amin Timany, Lars Birkedal: Mechanized logical relations for termination-insensitive noninterference. 1-29","address":"https://doi.org/10.1145/3434291","index":9},"https://doi.org/10.1145/3434292":{"title":"Marcin Sabok, Sam Staton, Dario Stein, Michael Wolman: Probabilistic programming semantics for name generation. 1-29","address":"https://doi.org/10.1145/3434292","index":10},"https://doi.org/10.1145/3434293":{"title":"Carlo Angiuli, Evan Cavallo, Anders Mörtberg, Max Zeuner: Internalizing representation independence with univalence. 1-30","address":"https://doi.org/10.1145/3434293","index":11},"https://doi.org/10.1145/3434294":{"title":"Simon Spies, Neel Krishnaswami, Derek Dreyer: Transfinite step-indexing for termination. 1-29","address":"https://doi.org/10.1145/3434294","index":12},"https://doi.org/10.1145/3434295":{"title":"Michael Benedikt, Pierre Pradic: Generating collection transformations from proofs. 1-28","address":"https://doi.org/10.1145/3434295","index":13},"https://doi.org/10.1145/3434296":{"title":"Yotam M. Y. Feldman, Mooly Sagiv, Sharon Shoham, James R. Wilcox: Learning the boundary of inductive invariants. 1-30","address":"https://doi.org/10.1145/3434296","index":14},"https://doi.org/10.1145/3434297":{"title":"Silvia Ghilezan, Jovanka Pantovic, Ivan Prokic, Alceste Scalas, Nobuko Yoshida: Precise subtyping for asynchronous multiparty sessions. 1-28","address":"https://doi.org/10.1145/3434297","index":15},"https://doi.org/10.1145/3434298":{"title":"Kostas Ferles, Jon Stephens, Isil Dillig: Verifying correct usage of context-free API protocols. 1-30","address":"https://doi.org/10.1145/3434298","index":16},"https://doi.org/10.1145/3434299":{"title":"Jatin Arora, Sam Westrick, Umut A. Acar: Provably space-efficient parallel functional programming. 1-33","address":"https://doi.org/10.1145/3434299","index":17},"https://doi.org/10.1145/3434300":{"title":"Zvonimir Pavlinovic, Yusen Su, Thomas Wies: Data flow refinement type inference. 1-31","address":"https://doi.org/10.1145/3434300","index":18},"https://doi.org/10.1145/3434301":{"title":"Cambridge Yang, Eric Atkinson, Michael Carbin: Simplifying dependent reductions in the polyhedral model. 1-33","address":"https://doi.org/10.1145/3434301","index":19},"https://doi.org/10.1145/3434302":{"title":"Marco Patrignani, Eric Mark Martin, Dominique Devriese: On the semantic expressiveness of recursive types. 1-29","address":"https://doi.org/10.1145/3434302","index":20},"https://doi.org/10.1145/3434303":{"title":"Arjen Rouvoet, Robbert Krebbers, Eelco Visser: Intrinsically typed compilation with nameless labels. 1-28","address":"https://doi.org/10.1145/3434303","index":21},"https://doi.org/10.1145/3434304":{"title":"Max Willsey, Chandrakana Nandi, Yisu Remy Wang, Oliver Flatt, Zachary Tatlock, Pavel Panchekha: egg: Fast and extensible equality saturation. 1-29","address":"https://doi.org/10.1145/3434304","index":22},"https://doi.org/10.1145/3434305":{"title":"Danel Ahman, Matija Pretnar: Asynchronous effects. 1-28","address":"https://doi.org/10.1145/3434305","index":23},"https://doi.org/10.1145/3434306":{"title":"Stefan K. Muller, Jan Hoffmann: Modeling and analyzing evaluation cost of CUDA kernels. 1-31","address":"https://doi.org/10.1145/3434306","index":24},"https://doi.org/10.1145/3434307":{"title":"Lucas Silver, Steve Zdancewic: Dijkstra monads forever: termination-sensitive specifications for interaction trees. 1-28","address":"https://doi.org/10.1145/3434307","index":25},"https://doi.org/10.1145/3434308":{"title":"Vineet Rajani, Marco Gaboardi, Deepak Garg, Jan Hoffmann: A unifying type-theory for higher-order (amortized) cost analysis. 1-28","address":"https://doi.org/10.1145/3434308","index":26},"https://doi.org/10.1145/3434309":{"title":"Damiano Mazza, Michele Pagani: Automatic differentiation in PCF. 1-27","address":"https://doi.org/10.1145/3434309","index":27},"https://doi.org/10.1145/3434310":{"title":"Jay P. Lim, Mridul Aanjaneya, John Gustafson, Santosh Nagarakatte: An approach to generate correctly rounded math libraries for new floating point variants. 1-30","address":"https://doi.org/10.1145/3434310","index":28},"https://doi.org/10.1145/3434311":{"title":"Jinwoo Kim, Qinheping Hu, Loris D'Antoni, Thomas W. Reps: Semantics-guided synthesis. 1-32","address":"https://doi.org/10.1145/3434311","index":29},"https://doi.org/10.1145/3434312":{"title":"Julian Rosemann, Simon Moll, Sebastian Hack: An abstract interpretation for SPMD divergence on reducible control flow graphs. 1-31","address":"https://doi.org/10.1145/3434312","index":30},"https://doi.org/10.1145/3434313":{"title":"Ugo Dal Lago, Claudia Faggian, Simona Ronchi Della Rocca: Intersection types and (positive) almost-sure termination. 1-32","address":"https://doi.org/10.1145/3434313","index":31},"https://doi.org/10.1145/3434314":{"title":"Paulo Emílio de Vilhena, François Pottier: A separation logic for effect handlers. 1-28","address":"https://doi.org/10.1145/3434314","index":32},"https://doi.org/10.1145/3434315":{"title":"Anders Alnor Mathiasen, Andreas Pavlogiannis: The fine-grained and parallel complexity of andersen's pointer analysis. 1-29","address":"https://doi.org/10.1145/3434315","index":33},"https://doi.org/10.1145/3434316":{"title":"Andrew K. Hirsch, Ethan Cecchetti: Giving semantics to program-counter labels via secure effects. 1-29","address":"https://doi.org/10.1145/3434316","index":34},"https://doi.org/10.1145/3434317":{"title":"Umang Mathur, Andreas Pavlogiannis, Mahesh Viswanathan: Optimal prediction of synchronization-preserving races. 1-29","address":"https://doi.org/10.1145/3434317","index":35},"https://doi.org/10.1145/3434318":{"title":"Kesha Hietala, Robert Rand, Shih-Han Hung, Xiaodi Wu, Michael Hicks: A verified optimizer for Quantum circuits. 1-29","address":"https://doi.org/10.1145/3434318","index":36},"https://doi.org/10.1145/3434319":{"title":"Jens Oliver Gutsfeld, Markus Müller-Olm, Christoph Ohrem: Automata and fixpoints for asynchronous hyperproperties. 1-29","address":"https://doi.org/10.1145/3434319","index":37},"https://doi.org/10.1145/3434320":{"title":"Kevin Batz, Benjamin Lucien Kaminski, Joost-Pieter Katoen, Christoph Matheja: Relatively complete verification of probabilistic programs: an expressive language for expectation-based reasoning. 1-30","address":"https://doi.org/10.1145/3434320","index":38},"https://doi.org/10.1145/3434321":{"title":"Nathanaël Courant, Xavier Leroy: Verified code generation for the polyhedral model. 1-24","address":"https://doi.org/10.1145/3434321","index":39},"https://doi.org/10.1145/3434322":{"title":"Ryan Doenges, Mina Tahmasbi Arashloo, Santiago Bautista, Alexander Chang, Newton Ni, Samwise Parkinson, Rudy Peterson, Alaia Solko-Breslin, Amanda Xu, Nate Foster: Petr4: formal foundations for p4 data planes. 1-32","address":"https://doi.org/10.1145/3434322","index":40},"https://doi.org/10.1145/3434323":{"title":"Léon Gondelman, Simon Oddershede Gregersen, Abel Nieto, Amin Timany, Lars Birkedal: Distributed causal memory: modular specification and verification in higher-order distributed separation logic. 1-29","address":"https://doi.org/10.1145/3434323","index":41},"https://doi.org/10.1145/3434324":{"title":"Michalis Kokologiannakis, Ilya Kaysin, Azalea Raad, Viktor Vafeiadis: PerSeVerE: persistency semantics for verification under ext4. 1-29","address":"https://doi.org/10.1145/3434324","index":42},"https://doi.org/10.1145/3434325":{"title":"Pascal Baumann, Rupak Majumdar, Ramanathan S. Thinniyam, Georg Zetzsche: Context-bounded verification of liveness properties for multithreaded shared-memory programs. 1-31","address":"https://doi.org/10.1145/3434325","index":43},"https://doi.org/10.1145/3434326":{"title":"Alban Reynaud, Gabriel Scherer, Jeremy Yallop: A practical mode system for recursive definitions. 1-29","address":"https://doi.org/10.1145/3434326","index":44},"https://doi.org/10.1145/3434327":{"title":"Aurèle Barrière, Sandrine Blazy, Olivier Flückiger, David Pichardie, Jan Vitek: Formally verified speculation and deoptimization in a JIT compiler. 1-26","address":"https://doi.org/10.1145/3434327","index":45},"https://doi.org/10.1145/3434328":{"title":"Artem Khyzha, Ori Lahav: Taming x86-TSO persistency. 1-29","address":"https://doi.org/10.1145/3434328","index":46},"https://doi.org/10.1145/3434329":{"title":"Shaull Almagor, Toghrul Karimov, Edon Kelmendi, Joël Ouaknine, James Worrell: Deciding ω-regular properties on linear recurrence sequences. 1-24","address":"https://doi.org/10.1145/3434329","index":47},"https://doi.org/10.1145/3434330":{"title":"Marco Vassena, Craig Disselkoen, Klaus von Gleissenthall, Sunjay Cauligi, Rami Gökhan Kici, Ranjit Jhala, Dean M. Tullsen, Deian Stefan: Automatically eliminating speculative leaks from cryptographic code with blade. 1-30","address":"https://doi.org/10.1145/3434330","index":48},"https://doi.org/10.1145/3434331":{"title":"Pritam Choudhury, Harley Eades III, Richard A. Eisenberg, Stephanie Weirich: A graded dependent type system with a usage-aware semantics. 1-32","address":"https://doi.org/10.1145/3434331","index":49},"https://doi.org/10.1145/3434332":{"title":"Beniamino Accattoli, Ugo Dal Lago, Gabriele Vanoni: The (In)Efficiency of interaction. 1-33","address":"https://doi.org/10.1145/3434332","index":50},"https://doi.org/10.1145/3434333":{"title":"Alejandro Aguirre, Gilles Barthe, Justin Hsu, Benjamin Lucien Kaminski, Joost-Pieter Katoen, Christoph Matheja: A pre-expectation calculus for probabilistic sensitivity. 1-28","address":"https://doi.org/10.1145/3434333","index":51},"https://doi.org/10.1145/3434334":{"title":"Cameron Moy, Phuc C. Nguyen, Sam Tobin-Hochstadt, David Van Horn: Corpse reviver: sound and efficient gradual typing via contract verification. 1-28","address":"https://doi.org/10.1145/3434334","index":52},"https://doi.org/10.1145/3434335":{"title":"Woosuk Lee: Combining the top-down propagation and bottom-up enumeration for inductive program synthesis. 1-28","address":"https://doi.org/10.1145/3434335","index":53},"https://doi.org/10.1145/3434336":{"title":"Eddie Jones, Steven J. Ramsay: Intensional datatype refinement: with application to scalable verification of pattern-match safety. 1-29","address":"https://doi.org/10.1145/3434336","index":54},"https://doi.org/10.1145/3434337":{"title":"Parosh Aziz Abdulla, Mohamed Faouzi Atig, Ahmed Bouajjani, K. Narayan Kumar, Prakash Saivasan: Deciding reachability under persistent x86-TSO. 1-32","address":"https://doi.org/10.1145/3434337","index":55},"https://doi.org/10.1145/3434338":{"title":"Ivan Di Liberti, Fosco Loregiàn, Chad Nester, Pawel Sobocinski: Functorial semantics for partial theories. 1-28","address":"https://doi.org/10.1145/3434338","index":56},"https://doi.org/10.1145/3434339":{"title":"Jules Jacobs: Paradoxes of probabilistic programming: and how to condition on events of measure zero with infinitesimal probabilities. 1-26","address":"https://doi.org/10.1145/3434339","index":57},"https://doi.org/10.1145/3434340":{"title":"Yuanbo Li, Qirun Zhang, Thomas W. Reps: On the complexity of bidirected interleaved Dyck-reachability. 1-28","address":"https://doi.org/10.1145/3434340","index":58},"https://doi.org/10.1145/3434341":{"title":"Jesper Cockx, Nicolas Tabareau, Théo Winterhalter: The taming of the rew: a type theory with computational assumptions. 1-29","address":"https://doi.org/10.1145/3434341","index":59},"https://doi.org/10.1145/3434342":{"title":"Felipe Bañados Schwerter, Alison M. Clark, Khurram A. Jafery, Ronald Garcia: Abstracting gradual typing moving forward: precise and space-efficient. 1-28","address":"https://doi.org/10.1145/3434342","index":60},"https://doi.org/10.1145/3473570":{"title":"Shivam Handa, Konstantinos Kallas, Nikos Vasilakis, Martin C. Rinard: An order-aware dataflow model for parallel Unix pipelines. 1-28","address":"https://doi.org/10.1145/3473570","index":61},"https://doi.org/10.1145/3473593":{"title":"Adam Paszke, Daniel D. Johnson, David Duvenaud, Dimitrios Vytiniotis, Alexey Radul, Matthew J. Johnson, Jonathan Ragan-Kelley, Dougal Maclaurin: Getting to the point: index sets and parallelism-preserving autodiff for pointful array programming. 1-29","address":"https://doi.org/10.1145/3473593","index":62},"https://doi.org/10.1145/3473575":{"title":"Manuel Serrano: Of JavaScript AOT compilation performance. 1-30","address":"https://doi.org/10.1145/3473575","index":63},"https://doi.org/10.1145/3473576":{"title":"Ningning Xie, Daan Leijen: Generalized evidence passing for effect handlers: efficient compilation of effect handlers to C. 1-30","address":"https://doi.org/10.1145/3473576","index":64},"https://doi.org/10.1145/3473583":{"title":"Conal Elliott: Symbolic and automatic differentiation of languages. 1-18","address":"https://doi.org/10.1145/3473583","index":65},"https://doi.org/10.1145/3473577":{"title":"Donnacha Oisín Kidney, Nicolas Wu: Algebras for weighted search. 1-30","address":"https://doi.org/10.1145/3473577","index":66},"https://doi.org/10.1145/3473578":{"title":"Zhixuan Yang, Nicolas Wu: Reasoning about effect interaction by fusion. 1-29","address":"https://doi.org/10.1145/3473578","index":67},"https://doi.org/10.1145/3473591":{"title":"Zoe Paraskevopoulou, John M. Li, Andrew W. Appel: Compositional optimizations for CertiCoq. 1-30","address":"https://doi.org/10.1145/3473591","index":68},"https://doi.org/10.1145/3473580":{"title":"Nikita Zyuzin, Aleksandar Nanevski: Contextual modal types for algebraic effects and handlers. 1-29","address":"https://doi.org/10.1145/3473580","index":69},"https://doi.org/10.1145/3473598":{"title":"Alejandro Aguirre, Gilles Barthe, Marco Gaboardi, Deepak Garg, Shin-ya Katsumata, Tetsuya Sato: Higher-order probabilistic adversarial computations: categorical semantics and program logics. 1-30","address":"https://doi.org/10.1145/3473598","index":70},"https://doi.org/10.1145/3473601":{"title":"Kimball Germane, Jay McCarthy: Newly-single and loving it: improving higher-order must-alias analysis with heap fragments. 1-28","address":"https://doi.org/10.1145/3473601","index":71},"https://doi.org/10.1145/3473596":{"title":"Chaitanya Koparkar, Mike Rainey, Michael Vollmer, Milind Kulkarni, Ryan R. Newton: Efficient tree-traversals: reconciling parallelism and dense data representations. 1-29","address":"https://doi.org/10.1145/3473596","index":72},"https://doi.org/10.1145/3473571":{"title":"Glen Mével, Jacques-Henri Jourdan: Formal verification of a concurrent bounded queue in a weak memory model. 1-29","address":"https://doi.org/10.1145/3473571","index":73},"https://doi.org/10.1145/3473590":{"title":"Aymeric Fromherz, Aseem Rastogi, Nikhil Swamy, Sydney Gibson, Guido Martínez, Denis Merigoux, Tahina Ramananandro: Steel: proof-oriented programming in a dependently typed concurrent separation logic. 1-30","address":"https://doi.org/10.1145/3473590","index":74},"https://doi.org/10.1145/3473574":{"title":"Sandro Stucki, Paolo G. Giarrusso: A theory of higher-order subtyping with type intervals. 1-30","address":"https://doi.org/10.1145/3473574","index":75},"https://doi.org/10.1145/3473584":{"title":"Pedro Rocha, Luís Caires: Propositions-as-types and shared state. 1-30","address":"https://doi.org/10.1145/3473584","index":76},"https://doi.org/10.1145/3473586":{"title":"Lars Birkedal, Thomas Dinsdale-Young, Armaël Guéneau, Guilhem Jaber, Kasper Svendsen, Nikos Tzevelekos: Theorems for free from separation logic specifications. 1-29","address":"https://doi.org/10.1145/3473586","index":77},"https://doi.org/10.1145/3473572":{"title":"Yannick Zakowski, Calvin Beck, Irene Yoon, Ilia Zaichuk, Vadim Zaliva, Steve Zdancewic: Modular, compositional, and executable formal semantics for LLVM IR. 1-30","address":"https://doi.org/10.1145/3473572","index":78},"https://doi.org/10.1145/3473582":{"title":"Denis Merigoux, Nicolas Chataing, Jonathan Protzenko: Catala: a programming language for the law. 1-29","address":"https://doi.org/10.1145/3473582","index":79},"https://doi.org/10.1145/3473568":{"title":"Nicolas Krauter, Patrick Raaf, Peter Braam, Reza Salkhordeh, Sebastian Erdweg, André Brinkmann: Persistent software transactional memory in Haskell. 1-29","address":"https://doi.org/10.1145/3473568","index":80},"https://doi.org/10.1145/3473600":{"title":"Taro Sekiyama, Takeshi Tsukada: CPS transformation with affine types for call-by-value implicit polymorphism. 1-30","address":"https://doi.org/10.1145/3473600","index":81},"https://doi.org/10.1145/3473595":{"title":"Nick Giannarakis, Alexandra Silva, David Walker: ProbNV: probabilistic verification of network control planes. 1-30","address":"https://doi.org/10.1145/3473595","index":82},"https://doi.org/10.1145/3473573":{"title":"Lukas Lazarek, Ben Greenman, Matthias Felleisen, Christos Dimoulas: How to evaluate blame for gradual types. 1-29","address":"https://doi.org/10.1145/3473573","index":83},"https://doi.org/10.1145/3473597":{"title":"Joshua Yanovski, Hoang-Hai Dang, Ralf Jung, Derek Dreyer: GhostCell: separating permissions from data in Rust. 1-30","address":"https://doi.org/10.1145/3473597","index":84},"https://doi.org/10.1145/3473594":{"title":"Xuejing Huang, Bruno C. d. S. Oliveira: Distributing intersection and union types with splits and duality (functional pearl). 1-24","address":"https://doi.org/10.1145/3473594","index":85},"https://doi.org/10.1145/3473581":{"title":"David M. Kahn, Jan Hoffmann: Automatic amortized resource analysis with the Quantum physicist's method. 1-29","address":"https://doi.org/10.1145/3473581","index":86},"https://doi.org/10.1145/3473592":{"title":"Martin Avanzini, Gilles Barthe, Ugo Dal Lago: On continuation-passing transformations and expected cost analysis. 1-30","address":"https://doi.org/10.1145/3473592","index":87},"https://doi.org/10.1145/3473599":{"title":"Adam Chlipala: Skipping the binder bureaucracy with mixed embeddings in a semantics course (functional pearl). 1-28","address":"https://doi.org/10.1145/3473599","index":88},"https://doi.org/10.1145/3473587":{"title":"Mitchell Pickard, Graham Hutton: Calculating dependently-typed compilers (functional pearl). 1-27","address":"https://doi.org/10.1145/3473587","index":89},"https://doi.org/10.1145/3473588":{"title":"Farzin Houshmand, Mohsen Lesani, Keval Vora: Grafs: declarative graph analytics. 1-32","address":"https://doi.org/10.1145/3473588","index":90},"https://doi.org/10.1145/3473569":{"title":"Richard A. Eisenberg, Guillaume Duboc, Stephanie Weirich, Daniel Lee: An existential crisis resolved: type inference for first-class existential types. 1-29","address":"https://doi.org/10.1145/3473569","index":91},"https://doi.org/10.1145/3473567":{"title":"Zesen Qian, G. A. Kavvos, Lars Birkedal: Client-server sessions in linear logic. 1-31","address":"https://doi.org/10.1145/3473567","index":92},"https://doi.org/10.1145/3473589":{"title":"Yasunari Watanabe, Kiran Gopinathan, George Pîrlea, Nadia Polikarpova, Ilya Sergey: Certifying the synthesis of heap-manipulating programs. 1-29","address":"https://doi.org/10.1145/3473589","index":93},"https://doi.org/10.1145/3473579":{"title":"John M. Li, Andrew W. Appel: Deriving efficient program transformations from rewrite rules. 1-29","address":"https://doi.org/10.1145/3473579","index":94},"https://doi.org/10.1145/3473585":{"title":"Yao Li, Li-yao Xia, Stephanie Weirich: Reasoning about the garden of forking paths. 1-28","address":"https://doi.org/10.1145/3473585","index":95},"https://doi.org/10.1145/3371069":{"title":"Davide Barbarossa, Giulio Manzonetto: Taylor subsumes Scott, Berry, Kahn and Plotkin. 1:1-1:23","address":"https://doi.org/10.1145/3371069","index":96},"https://doi.org/10.1145/3371070":{"title":"Martin Clochard, Claude Marché, Andrei Paskevich: Deductive verification with ghost monitors. 2:1-2:26","address":"https://doi.org/10.1145/3371070","index":97},"https://doi.org/10.1145/3371071":{"title":"Stephen Chang, Michael Ballantyne, Milo Turner, William J. Bowman: Dependent type systems as macros. 3:1-3:29","address":"https://doi.org/10.1145/3371071","index":98},"https://doi.org/10.1145/3371072":{"title":"Kenji Maillard, Catalin Hritcu, Exequiel Rivas, Antoine Van Muylder: The next 700 relational program logics. 4:1-4:33","address":"https://doi.org/10.1145/3371072","index":99},"https://doi.org/10.1145/3371073":{"title":"Yotam M. Y. Feldman, Neil Immerman, Mooly Sagiv, Sharon Shoham: Complexity and information in invariant inference. 5:1-5:29","address":"https://doi.org/10.1145/3371073","index":100},"https://doi.org/10.1145/3371074":{"title":"Jonas Kastberg Hinrichsen, Jesper Bengtson, Robbert Krebbers: Actris: session-type based reasoning in separation logic. 6:1-6:30","address":"https://doi.org/10.1145/3371074","index":101},"https://doi.org/10.1145/3371075":{"title":"Gilles Barthe, Sandrine Blazy, Benjamin Grégoire, Rémi Hutin, Vincent Laporte, David Pichardie, Alix Trieu: Formal verification of a constant-time preserving C compiler. 7:1-7:30","address":"https://doi.org/10.1145/3371075","index":102},"https://doi.org/10.1145/3371076":{"title":"Matthieu Sozeau, Simon Boulier, Yannick Forster, Nicolas Tabareau, Théo Winterhalter: Coq Coq correct! verification of type checking and erasure for Coq, in Coq. 8:1-8:28","address":"https://doi.org/10.1145/3371076","index":103},"https://doi.org/10.1145/3371077":{"title":"Jason Z. S. Hu, Ondrej Lhoták: Undecidability of d<: and its decidable fragments. 9:1-9:30","address":"https://doi.org/10.1145/3371077","index":104},"https://doi.org/10.1145/3371078":{"title":"Peter W. O'Hearn: Incorrectness logic. 10:1-10:32","address":"https://doi.org/10.1145/3371078","index":105},"https://doi.org/10.1145/3371079":{"title":"Azalea Raad, John Wickerson, Gil Neiger, Viktor Vafeiadis: Persistency semantics of the Intel-x86 architecture. 11:1-11:31","address":"https://doi.org/10.1145/3371079","index":106},"https://doi.org/10.1145/3371080":{"title":"Zheng Guo, Michael James, David Justo, Jiaxiao Zhou, Ziteng Wang, Ranjit Jhala, Nadia Polikarpova: Program synthesis by type-guided abstraction refinement. 12:1-12:28","address":"https://doi.org/10.1145/3371080","index":107},"https://doi.org/10.1145/3371081":{"title":"Azadeh Farzan, Anthony Vandikas: Reductions for safety proofs. 13:1-13:28","address":"https://doi.org/10.1145/3371081","index":108},"https://doi.org/10.1145/3371082":{"title":"Sung Kook Kim, Arnaud J. Venet, Aditya V. Thakur: Deterministic parallel fixpoint computation. 14:1-14:33","address":"https://doi.org/10.1145/3371082","index":109},"https://doi.org/10.1145/3371083":{"title":"G. A. Kavvos, Edward Morehouse, Daniel R. Licata, Norman Danner: Recurrence extraction for functional programs through call-by-push-value. 15:1-15:31","address":"https://doi.org/10.1145/3371083","index":110},"https://doi.org/10.1145/3371084":{"title":"Wonyeol Lee, Hangyeol Yu, Xavier Rival, Hongseok Yang: Towards verified stochastic variational inference for probabilistic programs. 16:1-16:33","address":"https://doi.org/10.1145/3371084","index":111},"https://doi.org/10.1145/3371085":{"title":"Andreas Pavlogiannis: Fast, sound, and effectively complete dynamic race prediction. 17:1-17:29","address":"https://doi.org/10.1145/3371085","index":112},"https://doi.org/10.1145/3371086":{"title":"Federico Aschieri, Francesco A. Genco: Par means parallel: multiplicative linear logic proofs as concurrent functional programs. 18:1-18:28","address":"https://doi.org/10.1145/3371086","index":113},"https://doi.org/10.1145/3371087":{"title":"Alexander K. Lew, Marco F. Cusumano-Towner, Benjamin Sherman, Michael Carbin, Vikash K. Mansinghka: Trace types and denotational semantics for sound programmable inference in probabilistic languages. 19:1-19:32","address":"https://doi.org/10.1145/3371087","index":114},"https://doi.org/10.1145/3371088":{"title":"Mengqi Liu, Lionel Rieg, Zhong Shao, Ronghui Gu, David Costanzo, Jung-Eun Kim, Man-Ki Yoon: Virtual timeline: a formal abstraction for verifying preemptive schedulers with temporal isolation. 20:1-20:31","address":"https://doi.org/10.1145/3371088","index":115},"https://doi.org/10.1145/3371089":{"title":"Gilles Barthe, Justin Hsu, Mingsheng Ying, Nengkun Yu, Li Zhou: Relational proofs for quantum programs. 21:1-21:29","address":"https://doi.org/10.1145/3371089","index":116},"https://doi.org/10.1145/3371090":{"title":"Michael Arntzenius, Neel Krishnaswami: Seminaïve evaluation for a higher-order functional language. 22:1-22:28","address":"https://doi.org/10.1145/3371090","index":117},"https://doi.org/10.1145/3371091":{"title":"Youngju Song, Minki Cho, Dongjoo Kim, Yonghyun Kim, Jeehoon Kang, Chung-Kil Hur: CompCertM: CompCert with C-assembly linking and lightweight modular verification. 23:1-23:31","address":"https://doi.org/10.1145/3371091","index":118},"https://doi.org/10.1145/3371092":{"title":"Martin A. T. Handley, Niki Vazou, Graham Hutton: Liquidate your assets: reasoning about resource usage in liquid Haskell. 24:1-24:27","address":"https://doi.org/10.1145/3371092","index":119},"https://doi.org/10.1145/3371093":{"title":"Peixin Wang, Hongfei Fu, Krishnendu Chatterjee, Yuxin Deng, Ming Xu: Proving expected sensitivity of probabilistic programs with randomized variable-dependent termination time. 25:1-25:30","address":"https://doi.org/10.1145/3371093","index":120},"https://doi.org/10.1145/3371094":{"title":"Parosh Aziz Abdulla, Mohamed Faouzi Atig, Rojin Rezvan: Parameterized verification under TSO is PSPACE-complete. 26:1-26:29","address":"https://doi.org/10.1145/3371094","index":121},"https://doi.org/10.1145/3371095":{"title":"Yannick Forster, Fabian Kunze, Marc Roth: The weak call-by-value λ-calculus is reasonable for both time and space. 27:1-27:23","address":"https://doi.org/10.1145/3371095","index":122},"https://doi.org/10.1145/3371096":{"title":"Roberto Bruni, Roberto Giacobazzi, Roberta Gori, Isabel Garcia-Contreras, Dusko Pavlovic: Abstract extensionality: on the properties of incomplete abstract interpretations. 28:1-28:28","address":"https://doi.org/10.1145/3371096","index":123},"https://doi.org/10.1145/3371097":{"title":"Zeina Migeed, Jens Palsberg: What is decidable about gradual types? 29:1-29:29","address":"https://doi.org/10.1145/3371097","index":124},"https://doi.org/10.1145/3371098":{"title":"David Binder, Julian Jabs, Ingo Skupin, Klaus Ostermann: Decomposition diversity with symmetric data and codata. 30:1-30:28","address":"https://doi.org/10.1145/3371098","index":125},"https://doi.org/10.1145/3371099":{"title":"Benedikt Ahrens, André Hirschowitz, Ambroise Lafont, Marco Maggesi: Reduction monads and their signatures. 31:1-31:29","address":"https://doi.org/10.1145/3371099","index":126},"https://doi.org/10.1145/3371100":{"title":"Michael Sammler, Deepak Garg, Derek Dreyer, Tadeusz Litak: The high-level benefits of low-level sandboxing. 32:1-32:32","address":"https://doi.org/10.1145/3371100","index":127},"https://doi.org/10.1145/3371101":{"title":"Paulo Emílio de Vilhena, François Pottier, Jacques-Henri Jourdan: Spy game: verifying a local generic solver in Iris. 33:1-33:28","address":"https://doi.org/10.1145/3371101","index":128},"https://doi.org/10.1145/3371102":{"title":"Hoang-Hai Dang, Jacques-Henri Jourdan, Jan-Oliver Kaiser, Derek Dreyer: RustBelt meets relaxed memory. 34:1-34:29","address":"https://doi.org/10.1145/3371102","index":129},"https://doi.org/10.1145/3371103":{"title":"Umang Mathur, Adithya Murali, Paul Krogmeier, P. Madhusudan, Mahesh Viswanathan: Deciding memory safety for single-pass heap-manipulating programs. 35:1-35:29","address":"https://doi.org/10.1145/3371103","index":130},"https://doi.org/10.1145/3371104":{"title":"Feras A. Saad, Cameron E. Freer, Martin C. Rinard, Vikash K. Mansinghka: Optimal approximate sampling from discrete probability distributions. 36:1-36:31","address":"https://doi.org/10.1145/3371104","index":131},"https://doi.org/10.1145/3371105":{"title":"Marcel Hark, Benjamin Lucien Kaminski, Jürgen Giesl, Joost-Pieter Katoen: Aiming low is harder: induction for lower bounds in probabilistic program verification. 37:1-37:28","address":"https://doi.org/10.1145/3371105","index":132},"https://doi.org/10.1145/3371106":{"title":"Martín Abadi, Gordon D. Plotkin: A simple differentiable programming language. 38:1-38:28","address":"https://doi.org/10.1145/3371106","index":133},"https://doi.org/10.1145/3371107":{"title":"Alexander Vandenbroucke, Tom Schrijvers: PλωNK: functional probabilistic NetKAT. 39:1-39:27","address":"https://doi.org/10.1145/3371107","index":134},"https://doi.org/10.1145/3371108":{"title":"Mark P. Jones, J. Garrett Morris, Richard A. Eisenberg: Partial type constructors: or, making ad hoc datatypes less ad hoc. 40:1-40:28","address":"https://doi.org/10.1145/3371108","index":135},"https://doi.org/10.1145/3371109":{"title":"Ralf Jung, Hoang-Hai Dang, Jeehoon Kang, Derek Dreyer: Stacked borrows: an aliasing model for Rust. 41:1-41:32","address":"https://doi.org/10.1145/3371109","index":136},"https://doi.org/10.1145/3371110":{"title":"Ryan Beckett, Aarti Gupta, Ratul Mahajan, David Walker: Abstract interpretation of distributed network control planes. 42:1-42:27","address":"https://doi.org/10.1145/3371110","index":137},"https://doi.org/10.1145/3371111":{"title":"Michael Greenberg, Austin J. Blatt: Executable formal semantics for the POSIX shell. 43:1-43:30","address":"https://doi.org/10.1145/3371111","index":138},"https://doi.org/10.1145/3371112":{"title":"Timothy Bourke, Lélio Brun, Marc Pouzet: Mechanized semantics and verified compilation for a dataflow synchronous language with reset. 44:1-44:29","address":"https://doi.org/10.1145/3371112","index":139},"https://doi.org/10.1145/3371113":{"title":"Ralf Jung, Rodolphe Lepigre, Gaurav Parthasarathy, Marianna Rapoport, Amin Timany, Derek Dreyer, Bart Jacobs: The future is ours: prophecy variables in separation logic. 45:1-45:32","address":"https://doi.org/10.1145/3371113","index":140},"https://doi.org/10.1145/3371114":{"title":"Max S. New, Dustin Jamner, Amal Ahmed: Graduality and parametricity: together again for the first time. 46:1-46:32","address":"https://doi.org/10.1145/3371114","index":141},"https://doi.org/10.1145/3371115":{"title":"Sam Westrick, Rohan Yadav, Matthew Fluet, Umut A. Acar: Disentanglement in nested-parallel programs. 47:1-47:32","address":"https://doi.org/10.1145/3371115","index":142},"https://doi.org/10.1145/3371116":{"title":"Dariusz Biernacki, Maciej Piróg, Piotr Polesiuk, Filip Sieczkowski: Binders by day, labels by night: effect instances via lexically scoped handlers. 48:1-48:29","address":"https://doi.org/10.1145/3371116","index":143},"https://doi.org/10.1145/3371117":{"title":"Chenglong Wang, Yu Feng, Rastislav Bodík, Alvin Cheung, Isil Dillig: Visualization by example. 49:1-49:28","address":"https://doi.org/10.1145/3371117","index":144},"https://doi.org/10.1145/3371118":{"title":"David Darais, Ian Sweet, Chang Liu, Michael Hicks: A language for probabilistically oblivious computation. 50:1-50:31","address":"https://doi.org/10.1145/3371118","index":145},"https://doi.org/10.1145/3371119":{"title":"Li-yao Xia, Yannick Zakowski, Paul He, Chung-Kil Hur, Gregory Malecha, Benjamin C. Pierce, Steve Zdancewic: Interaction trees: representing recursive and impure programs in Coq. 51:1-51:32","address":"https://doi.org/10.1145/3371119","index":146},"https://doi.org/10.1145/3371120":{"title":"Malavika Samak, Deokhwan Kim, Martin C. Rinard: Synthesizing replacement classes. 52:1-52:33","address":"https://doi.org/10.1145/3371120","index":147},"https://doi.org/10.1145/3371121":{"title":"Ningning Xie, Richard A. Eisenberg, Bruno C. d. S. Oliveira: Kind inference for datatypes. 53:1-53:28","address":"https://doi.org/10.1145/3371121","index":148},"https://doi.org/10.1145/3371122":{"title":"Suguman Bansal, Kedar S. Namjoshi, Yaniv Sa'ar: Synthesis of coordination programs from linear temporal specifications. 54:1-54:27","address":"https://doi.org/10.1145/3371122","index":149},"https://doi.org/10.1145/3371123":{"title":"Gilles Barthe, Justin Hsu, Kevin Liao: A probabilistic separation logic. 55:1-55:30","address":"https://doi.org/10.1145/3371123","index":150},"https://doi.org/10.1145/3371124":{"title":"Shengwei An, Rishabh Singh, Sasa Misailovic, Roopsha Samanta: Augmented example-based synthesis using relational perturbation properties. 56:1-56:24","address":"https://doi.org/10.1145/3371124","index":151},"https://doi.org/10.1145/3371125":{"title":"Fredrik Dahlqvist, Dexter Kozen: Semantics of higher-order probabilistic programs with conditioning. 57:1-57:29","address":"https://doi.org/10.1145/3371125","index":152},"https://doi.org/10.1145/3371126":{"title":"Pierre-Marie Pédrot, Nicolas Tabareau: The fire triangle: how to mix substitution, dependent elimination, and effects. 58:1-58:28","address":"https://doi.org/10.1145/3371126","index":153},"https://doi.org/10.1145/3371127":{"title":"Guilhem Jaber: SyTeCi: automating contextual equivalence for higher-order programs with references. 59:1-59:28","address":"https://doi.org/10.1145/3371127","index":154},"https://doi.org/10.1145/3371128":{"title":"Daming Zou, Muhan Zeng, Yingfei Xiong, Zhoulai Fu, Lu Zhang, Zhendong Su: Detecting floating-point errors via atomic conditions. 60:1-60:27","address":"https://doi.org/10.1145/3371128","index":155},"https://doi.org/10.1145/3371129":{"title":"Steffen Smolka, Nate Foster, Justin Hsu, Tobias Kappé, Dexter Kozen, Alexandra Silva: Guarded Kleene algebra with tests: verification of uninterpreted programs in nearly linear time. 61:1-61:28","address":"https://doi.org/10.1145/3371129","index":156},"https://doi.org/10.1145/3371130":{"title":"Mukund Raghothaman, Jonathan Mendelson, David Zhao, Mayur Naik, Bernhard Scholz: Provenance-guided synthesis of Datalog programs. 62:1-62:27","address":"https://doi.org/10.1145/3371130","index":157},"https://doi.org/10.1145/3371131":{"title":"Pierre Clairambault, Marc de Visme: Full abstraction for the quantum lambda-calculus. 63:1-63:28","address":"https://doi.org/10.1145/3371131","index":158},"https://doi.org/10.1145/3371132":{"title":"Aloïs Brunel, Damiano Mazza, Michele Pagani: Backpropagation in the simply typed lambda-calculus with linear negation. 64:1-64:27","address":"https://doi.org/10.1145/3371132","index":159},"https://doi.org/10.1145/3371133":{"title":"Lukas Lazarek, Alexis King, Samanvitha Sundar, Robert Bruce Findler, Christos Dimoulas: Does blame shifting work? 65:1-65:29","address":"https://doi.org/10.1145/3371133","index":160},"https://doi.org/10.1145/3371134":{"title":"Julian Mackay, Alex Potanin, Jonathan Aldrich, Lindsay Groves: Decidable subtyping for path dependent types. 66:1-66:27","address":"https://doi.org/10.1145/3371134","index":161},"https://doi.org/10.1145/3371135":{"title":"Peter Thiemann, Vasco T. Vasconcelos: Label-dependent session types. 67:1-67:29","address":"https://doi.org/10.1145/3371135","index":162},"https://doi.org/10.1145/3371136":{"title":"Roland Meyer, Sebastian Wolff: Pointer life cycle types for lock-free data structures with memory reclamation. 68:1-68:36","address":"https://doi.org/10.1145/3371136","index":163},"https://doi.org/10.1145/3386319":{"title":"Roger K. W. Hui, Morten Kromberg: APL since 1978. 69:1-69:108","address":"https://doi.org/10.1145/3386319","index":164},"https://doi.org/10.1145/3386320":{"title":"Bjarne Stroustrup: Thriving in a crowded and changing world: C++ 2006-2020. 70:1-70:168","address":"https://doi.org/10.1145/3386320","index":165},"https://doi.org/10.1145/3386321":{"title":"Rich Hickey: A history of Clojure. 71:1-71:46","address":"https://doi.org/10.1145/3386321","index":166},"https://doi.org/10.1145/3386322":{"title":"John Reid, Bill Long, Jon Steidel: History of coarrays and SPMD parallelism in Fortran. 72:1-72:30","address":"https://doi.org/10.1145/3386322","index":167},"https://doi.org/10.1145/3386323":{"title":"Walter Bright, Andrei Alexandrescu, Michael Parker: Origins of the D programming language. 73:1-73:38","address":"https://doi.org/10.1145/3386323","index":168},"https://doi.org/10.1145/3386324":{"title":"Stefan Monnier, Michael Sperber: Evolution of Emacs Lisp. 74:1-74:55","address":"https://doi.org/10.1145/3386324","index":169},"https://doi.org/10.1145/3386325":{"title":"Don Syme: The early history of F#. 75:1-75:58","address":"https://doi.org/10.1145/3386325","index":170},"https://doi.org/10.1145/3386326":{"title":"Paul King: A history of the Groovy programming language. 76:1-76:53","address":"https://doi.org/10.1145/3386326","index":171},"https://doi.org/10.1145/3386327":{"title":"Allen Wirfs-Brock, Brendan Eich: JavaScript: the first 20 years. 77:1-77:189","address":"https://doi.org/10.1145/3386327","index":172},"https://doi.org/10.1145/3386328":{"title":"Jeffrey Kodosky: LabVIEW. 78:1-78:54","address":"https://doi.org/10.1145/3386328","index":173},"https://doi.org/10.1145/3386329":{"title":"Cynthia Solomon, Brian Harvey, Ken Kahn, Henry Lieberman, Mark L. Miller, Margaret Minsky, Artemis Papert, Brian Silverman: History of Logo. 79:1-79:66","address":"https://doi.org/10.1145/3386329","index":174},"https://doi.org/10.1145/3386330":{"title":"William D. Clinger, Mitchell Wand: Hygienic macro technology. 80:1-80:110","address":"https://doi.org/10.1145/3386330","index":175},"https://doi.org/10.1145/3386331":{"title":"Cleve Moler, Jack Little: A history of MATLAB. 81:1-81:67","address":"https://doi.org/10.1145/3386331","index":176},"https://doi.org/10.1145/3386332":{"title":"Brad J. Cox, Steve Naroff, Hansen Hsu: The origins of Objective-C at PPI/Stepstone and its evolution at NeXT. 82:1-82:74","address":"https://doi.org/10.1145/3386332","index":177},"https://doi.org/10.1145/3386333":{"title":"Peter Van Roy, Seif Haridi, Christian Schulte, Gert Smolka: A history of the Oz multiparadigm language. 83:1-83:56","address":"https://doi.org/10.1145/3386333","index":178},"https://doi.org/10.1145/3386334":{"title":"John M. Chambers: S, R, and data science. 84:1-84:17","address":"https://doi.org/10.1145/3386334","index":179},"https://doi.org/10.1145/3386335":{"title":"Daniel Ingalls: The evolution of Smalltalk: from Smalltalk-72 through Squeak. 85:1-85:101","address":"https://doi.org/10.1145/3386335","index":180},"https://doi.org/10.1145/3386336":{"title":"David MacQueen, Robert Harper, John H. Reppy: The history of Standard ML. 86:1-86:100","address":"https://doi.org/10.1145/3386336","index":181},"https://doi.org/10.1145/3386337":{"title":"Peter Flake, Phil Moorby, Steve Golson, Arturo Salz, Simon J. Davidmann: Verilog HDL and its ancestors and descendants. 87:1-87:90","address":"https://doi.org/10.1145/3386337","index":182},"https://doi.org/10.1145/3408970":{"title":"Xiaohong Chen, Grigore Rosu: A general approach to define binders using matching logic. 88:1-88:32","address":"https://doi.org/10.1145/3408970","index":183},"https://doi.org/10.1145/3408971":{"title":"Alejandro Serrano, Jurriaan Hage, Simon Peyton Jones, Dimitrios Vytiniotis: A quick look at impredicativity. 89:1-89:29","address":"https://doi.org/10.1145/3408971","index":184},"https://doi.org/10.1145/3408972":{"title":"Andreas Abel, Jean-Philippe Bernardy: A unified view of modalities in type systems. 90:1-90:28","address":"https://doi.org/10.1145/3408972","index":185},"https://doi.org/10.1145/3408973":{"title":"Matus Tejiscak: A dependently typed calculus with pattern matching and erasure inference. 91:1-91:29","address":"https://doi.org/10.1145/3408973","index":186},"https://doi.org/10.1145/3408974":{"title":"Bastian Hagedorn, Johannes Lenfers, Thomas Koehler, Xueying Qin, Sergei Gorlatch, Michel Steuwer: Achieving high-performance the functional way: a functional pearl on expressing high-performance optimizations as rewrite strategies. 92:1-92:29","address":"https://doi.org/10.1145/3408974","index":187},"https://doi.org/10.1145/3408975":{"title":"Philipp Schuster, Jonathan Immanuel Brachthäuser, Klaus Ostermann: Compiling effect handlers in capability-passing style. 93:1-93:28","address":"https://doi.org/10.1145/3408975","index":188},"https://doi.org/10.1145/3408976":{"title":"Matthew Weidner, Heather Miller, Christopher Meiklejohn: Composing and decomposing op-based CRDTs with semidirect products. 94:1-94:27","address":"https://doi.org/10.1145/3408976","index":189},"https://doi.org/10.1145/3408977":{"title":"Nick Rioux, Steve Zdancewic: Computation focusing. 95:1-95:27","address":"https://doi.org/10.1145/3408977","index":190},"https://doi.org/10.1145/3408978":{"title":"Glen Mével, Jacques-Henri Jourdan, François Pottier: Cosmo: a concurrent separation logic for multicore OCaml. 96:1-96:29","address":"https://doi.org/10.1145/3408978","index":191},"https://doi.org/10.1145/3408979":{"title":"Joseph W. Cutler, Daniel R. Licata, Norman Danner: Denotational recurrence extraction for amortized analysis. 97:1-97:29","address":"https://doi.org/10.1145/3408979","index":192},"https://doi.org/10.1145/3408980":{"title":"Nándor Licker, Timothy M. Jones: Duplo: a framework for OCaml post-link optimisation. 98:1-98:29","address":"https://doi.org/10.1145/3408980","index":193},"https://doi.org/10.1145/3408981":{"title":"Ningning Xie, Jonathan Immanuel Brachthäuser, Daniel Hillerström, Philipp Schuster, Daan Leijen: Effect handlers, evidently. 99:1-99:29","address":"https://doi.org/10.1145/3408981","index":194},"https://doi.org/10.1145/3408982":{"title":"Daniel Hillerström, Sam Lindley, John Longley: Effects for efficiency: asymptotic speedup with first-class control. 100:1-100:29","address":"https://doi.org/10.1145/3408982","index":195},"https://doi.org/10.1145/3408983":{"title":"András Kovács: Elaboration with first-class implicit function types. 101:1-101:29","address":"https://doi.org/10.1145/3408983","index":196},"https://doi.org/10.1145/3408984":{"title":"Zachary Palmer, Theodore Park, Scott F. Smith, Shiwei Weng: Higher-order demand-driven symbolic evaluation. 102:1-102:28","address":"https://doi.org/10.1145/3408984","index":197},"https://doi.org/10.1145/3408985":{"title":"Gabriel Radanne, Hannes Saffrich, Peter Thiemann: Kindly bent to free us. 103:1-103:29","address":"https://doi.org/10.1145/3408985","index":198},"https://doi.org/10.1145/3408986":{"title":"Paul Downen, Zena M. Ariola, Simon Peyton Jones, Richard A. Eisenberg: Kinds are calling conventions. 104:1-104:29","address":"https://doi.org/10.1145/3408986","index":199},"https://doi.org/10.1145/3408987":{"title":"Nadia Polikarpova, Deian Stefan, Jean Yang, Shachar Itzhaky, Travis Hance, Armando Solar-Lezama: Liquid information flow control. 105:1-105:30","address":"https://doi.org/10.1145/3408987","index":200},"https://doi.org/10.1145/3408988":{"title":"Tristan Knoth, Di Wang, Adam Reynolds, Jan Hoffmann, Nadia Polikarpova: Liquid resource types. 106:1-106:29","address":"https://doi.org/10.1145/3408988","index":201},"https://doi.org/10.1145/3408989":{"title":"Sebastian Graf, Simon Peyton Jones, Ryan G. Scott: Lower your guards: a compositional pattern-match coverage checker. 107:1-107:30","address":"https://doi.org/10.1145/3408989","index":202},"https://doi.org/10.1145/3408990":{"title":"Pierce Darragh, Michael D. Adams: Parsing with zippers (functional pearl). 108:1-108:28","address":"https://doi.org/10.1145/3408990","index":203},"https://doi.org/10.1145/3408991":{"title":"Justin Lubin, Nick Collins, Cyrus Omar, Ravi Chugh: Program sketching with live bidirectional evaluation. 109:1-109:29","address":"https://doi.org/10.1145/3408991","index":204},"https://doi.org/10.1145/3408992":{"title":"Di Wang, David M. Kahn, Jan Hoffmann: Raising expectations: automating expected cost analysis with types. 110:1-110:31","address":"https://doi.org/10.1145/3408992","index":205},"https://doi.org/10.1145/3408993":{"title":"Vikraman Choudhury, Neel Krishnaswami: Recovering purity with comonads and capabilities. 111:1-111:28","address":"https://doi.org/10.1145/3408993","index":206},"https://doi.org/10.1145/3408994":{"title":"Timothée Haudebourg, Thomas Genet, Thomas P. Jensen: Regular language type inference with term rewriting. 112:1-112:29","address":"https://doi.org/10.1145/3408994","index":207},"https://doi.org/10.1145/3408995":{"title":"K. C. Sivaramakrishnan, Stephen Dolan, Leo White, Sadiq Jaffer, Tom Kelly, Anmol Sahoo, Sudha Parimala, Atul Dhiman, Anil Madhavapeddy: Retrofitting parallelism onto OCaml. 113:1-113:30","address":"https://doi.org/10.1145/3408995","index":208},"https://doi.org/10.1145/3408996":{"title":"Paolo G. Giarrusso, Léo Stefanesco, Amin Timany, Lars Birkedal, Robbert Krebbers: Scala step-by-step: soundness for DOT with step-indexed logical relations in Iris. 114:1-114:29","address":"https://doi.org/10.1145/3408996","index":209},"https://doi.org/10.1145/3408997":{"title":"Daniel Selsam, Simon Hudon, Leonardo de Moura: Sealing pointer-based optimizations behind pure functions. 115:1-115:20","address":"https://doi.org/10.1145/3408997","index":210},"https://doi.org/10.1145/3408998":{"title":"Arthur Charguéraud: Separation logic for sequential programs (functional pearl). 116:1-116:34","address":"https://doi.org/10.1145/3408998","index":211},"https://doi.org/10.1145/3408999":{"title":"Taro Sekiyama, Takeshi Tsukada, Atsushi Igarashi: Signature restriction for polymorphic algebraic effects. 117:1-117:30","address":"https://doi.org/10.1145/3408999","index":212},"https://doi.org/10.1145/3409000":{"title":"Kazutaka Matsuda, Meng Wang: Sparcl: a language for partially-invertible computation. 118:1-118:31","address":"https://doi.org/10.1145/3409000","index":213},"https://doi.org/10.1145/3409001":{"title":"Benoît Montagu, Thomas P. Jensen: Stable relations and abstract interpretation of higher-order programs. 119:1-119:30","address":"https://doi.org/10.1145/3409001","index":214},"https://doi.org/10.1145/3409002":{"title":"Jamie Willis, Nicolas Wu, Matthew Pickering: Staged selective parser combinators. 120:1-120:30","address":"https://doi.org/10.1145/3409002","index":215},"https://doi.org/10.1145/3409003":{"title":"Nikhil Swamy, Aseem Rastogi, Aymeric Fromherz, Denis Merigoux, Danel Ahman, Guido Martínez: SteelCore: an extensible concurrent separation logic for effectful dependently typed programs. 121:1-121:30","address":"https://doi.org/10.1145/3409003","index":216},"https://doi.org/10.1145/3409004":{"title":"Aaron Stump, Christopher Jenkins, Stephan Spahn, Colin McDonald: Strong functional pearl: Harper's regular-expression matcher in Cedille. 122:1-122:25","address":"https://doi.org/10.1145/3409004","index":217},"https://doi.org/10.1145/3409005":{"title":"Jeremiah Griffin, Mohsen Lesani, Narges Shadab, Xizhe Yin: TLC: temporal logic of distributed components. 123:1-123:30","address":"https://doi.org/10.1145/3409005","index":218},"https://doi.org/10.1145/3409006":{"title":"Lionel Parreaux: The simple essence of algebraic subtyping: principal type inference with subtyping made easy (functional pearl). 124:1-124:28","address":"https://doi.org/10.1145/3409006","index":219},"https://doi.org/10.1145/3428193":{"title":"Magnus Madsen, Ondrej Lhoták: Fixpoints for the masses: programming with first-class Datalog constraints. 125:1-125:28","address":"https://doi.org/10.1145/3428193","index":220},"https://doi.org/10.1145/3428194":{"title":"Jonathan Immanuel Brachthäuser, Philipp Schuster, Klaus Ostermann: Effects as capabilities: effect handlers and lightweight effect polymorphism. 126:1-126:30","address":"https://doi.org/10.1145/3428194","index":221},"https://doi.org/10.1145/3428195":{"title":"André Pacak, Sebastian Erdweg, Tamás Szabó: A systematic approach to deriving incremental type checkers. 127:1-127:28","address":"https://doi.org/10.1145/3428195","index":222},"https://doi.org/10.1145/3428196":{"title":"Yotam M. Y. Feldman, Artem Khyzha, Constantin Enea, Adam Morrison, Aleksandar Nanevski, Noam Rinetzky, Sharon Shoham: Proving highly-concurrent traversals correct. 128:1-128:29","address":"https://doi.org/10.1145/3428196","index":223},"https://doi.org/10.1145/3428197":{"title":"Cyril Six, Sylvain Boulmé, David Monniaux: Certified and efficient instruction scheduling: application to interlocked VLIW processors. 129:1-129:29","address":"https://doi.org/10.1145/3428197","index":224},"https://doi.org/10.1145/3428198":{"title":"Giulia Meuli, Mathias Soeken, Martin Roetteler, Thomas Häner: Enabling accuracy-aware Quantum compilers using symbolic resource estimation. 130:1-130:26","address":"https://doi.org/10.1145/3428198","index":225},"https://doi.org/10.1145/3428199":{"title":"Guilherme V. Leobas, Fernando Magno Quintão Pereira: Semiring optimizations: dynamic elision of expressions with identity and absorbing elements. 131:1-131:28","address":"https://doi.org/10.1145/3428199","index":226},"https://doi.org/10.1145/3428200":{"title":"Michael J. Coblenz, Jonathan Aldrich, Brad A. Myers, Joshua Sunshine: Can advanced type systems be usable? An empirical study of ownership, assets, and typestate in Obsidian. 132:1-132:28","address":"https://doi.org/10.1145/3428200","index":227},"https://doi.org/10.1145/3428201":{"title":"Thomas Häner, Torsten Hoefler, Matthias Troyer: Assertion-based optimization of Quantum programs. 133:1-133:20","address":"https://doi.org/10.1145/3428201","index":228},"https://doi.org/10.1145/3428202":{"title":"Rupak Majumdar, Nobuko Yoshida, Damien Zufferey: Multiparty motion coordination: from choreographies to robotics programs. 134:1-134:30","address":"https://doi.org/10.1145/3428202","index":229},"https://doi.org/10.1145/3428203":{"title":"Shankara Pailoor, Xinyu Wang, Hovav Shacham, Isil Dillig: Automated policy synthesis for system call sandboxing. 135:1-135:26","address":"https://doi.org/10.1145/3428203","index":230},"https://doi.org/10.1145/3428204":{"title":"Vytautas Astrauskas, Christoph Matheja, Federico Poli, Peter Müller, Alexander J. Summers: How do programmers use unsafe rust? 136:1-136:27","address":"https://doi.org/10.1145/3428204","index":231},"https://doi.org/10.1145/3428205":{"title":"Yu Wang, Ke Wang, Fengjuan Gao, Linzhang Wang: Learning semantic program embeddings with graph interval neural network. 137:1-137:27","address":"https://doi.org/10.1145/3428205","index":232},"https://doi.org/10.1145/3428206":{"title":"Breanna Devore-McDonald, Emery D. Berger: Mossad: defeating software plagiarism detection. 138:1-138:28","address":"https://doi.org/10.1145/3428206","index":233},"https://doi.org/10.1145/3428207":{"title":"Yizhou Zhang, Guido Salvaneschi, Andrew C. Myers: Handling bidirectional control flow. 139:1-139:30","address":"https://doi.org/10.1145/3428207","index":234},"https://doi.org/10.1145/3428208":{"title":"Steven Holtzen, Guy Van den Broeck, Todd D. Millstein: Scaling exact inference for discrete probabilistic programs. 140:1-140:31","address":"https://doi.org/10.1145/3428208","index":235},"https://doi.org/10.1145/3428209":{"title":"Aaron Bembenek, Michael Greenberg, Stephen Chong: Formulog: Datalog for SMT-based static analysis. 141:1-141:31","address":"https://doi.org/10.1145/3428209","index":236},"https://doi.org/10.1145/3428210":{"title":"Tongtong Xiang, Jeff Y. Luo, Werner Dietl: Precise inference of expressive units of measurement types. 142:1-142:28","address":"https://doi.org/10.1145/3428210","index":237},"https://doi.org/10.1145/3428211":{"title":"Hongyu Liu, Sam Silvestro, Xiangyu Zhang, Jian Huang, Tongping Liu: WATCHER: in-situ failure diagnosis. 143:1-143:27","address":"https://doi.org/10.1145/3428211","index":238},"https://doi.org/10.1145/3428212":{"title":"Thodoris Sotiropoulos, Stefanos Chaliasos, Dimitris Mitropoulos, Diomidis Spinellis: A model for detecting faults in build specifications. 144:1-144:30","address":"https://doi.org/10.1145/3428212","index":239},"https://doi.org/10.1145/3428213":{"title":"Sean Bartell, Will Dietz, Vikram S. Adve: Guided linking: dynamic linking without the costs. 145:1-145:29","address":"https://doi.org/10.1145/3428213","index":240},"https://doi.org/10.1145/3428214":{"title":"Hamed Gorjiara, Guoqing Harry Xu, Brian Demsky: Satune: synthesizing efficient SAT encoders. 146:1-146:32","address":"https://doi.org/10.1145/3428214","index":241},"https://doi.org/10.1145/3428215":{"title":"Shengjian Guo, Yueqi Chen, Jiyong Yu, Meng Wu, Zhiqiang Zuo, Peng Li, Yueqiang Cheng, Huibo Wang: Exposing cache timing side-channel leaks through out-of-order symbolic execution. 147:1-147:32","address":"https://doi.org/10.1145/3428215","index":242},"https://doi.org/10.1145/3428216":{"title":"Fangyi Zhou, Francisco Ferreira, Raymond Hu, Rumyana Neykova, Nobuko Yoshida: Statically verified refinements for multiparty protocols. 148:1-148:30","address":"https://doi.org/10.1145/3428216","index":243},"https://doi.org/10.1145/3428217":{"title":"Robert Griesemer, Raymond Hu, Wen Kokke, Julien Lange, Ian Lance Taylor, Bernardo Toninho, Philip Wadler, Nobuko Yoshida: Featherweight go. 149:1-149:29","address":"https://doi.org/10.1145/3428217","index":244},"https://doi.org/10.1145/3428218":{"title":"Gushu Li, Li Zhou, Nengkun Yu, Yufei Ding, Mingsheng Ying, Yuan Xie: Projection-based runtime assertions for testing and debugging Quantum programs. 150:1-150:29","address":"https://doi.org/10.1145/3428218","index":245},"https://doi.org/10.1145/3428219":{"title":"Azalea Raad, Ori Lahav, Viktor Vafeiadis: Persistent Owicki-Gries reasoning: a program logic for reasoning about persistent programs on Intel-x86. 151:1-151:28","address":"https://doi.org/10.1145/3428219","index":246},"https://doi.org/10.1145/3428220":{"title":"Christoph Sprenger, Tobias Klenze, Marco Eilers, Felix A. Wolf, Peter Müller, Martin Clochard, David A. Basin: Igloo: soundly linking compositional refinement and separation logic for distributed system verification. 152:1-152:31","address":"https://doi.org/10.1145/3428220","index":247},"https://doi.org/10.1145/3428221":{"title":"Konstantinos Kallas, Filip Niksic, Caleb Stanford, Rajeev Alur: DiffStream: differential output testing for stream processing programs. 153:1-153:29","address":"https://doi.org/10.1145/3428221","index":248},"https://doi.org/10.1145/3428222":{"title":"Magnus Madsen, Jaco van de Pol: Polymorphic types and effects with Boolean unification. 154:1-154:29","address":"https://doi.org/10.1145/3428222","index":249},"https://doi.org/10.1145/3428223":{"title":"David Castro-Perez, Nobuko Yoshida: CAMP: cost-aware multiparty session protocols. 155:1-155:30","address":"https://doi.org/10.1145/3428223","index":250},"https://doi.org/10.1145/3428224":{"title":"Cormac Flanagan, Stephen N. Freund: The anchor verifier for blocking and non-blocking concurrent software. 156:1-156:29","address":"https://doi.org/10.1145/3428224","index":251},"https://doi.org/10.1145/3428225":{"title":"Ramy Shahin, Marsha Chechik: Automatic and efficient variability-aware lifting of functional programs. 157:1-157:27","address":"https://doi.org/10.1145/3428225","index":252},"https://doi.org/10.1145/3428226":{"title":"Ryan Senanayake, Changwan Hong, Ziheng Wang, Amalee Wilson, Stephen Chou, Shoaib Kamil, Saman P. Amarasinghe, Fredrik Kjolstad: A sparse iteration space transformation framework for sparse tensor algebra. 158:1-158:30","address":"https://doi.org/10.1145/3428226","index":253},"https://doi.org/10.1145/3428227":{"title":"Hila Peleg, Roi Gabay, Shachar Itzhaky, Eran Yahav: Programming with a read-eval-synth loop. 159:1-159:30","address":"https://doi.org/10.1145/3428227","index":254},"https://doi.org/10.1145/3428228":{"title":"Umar Farooq, Zhijia Zhao, Manu Sridharan, Iulian Neamtiu: LiveDroid: identifying and preserving mobile app state in volatile runtime environments. 160:1-160:30","address":"https://doi.org/10.1145/3428228","index":255},"https://doi.org/10.1145/3428229":{"title":"Xiaohong Chen, Minh-Thai Trinh, Nishant Rodrigues, Lucas Peña, Grigore Rosu: Towards a unified proof framework for automated fixpoint reasoning using matching logic. 161:1-161:29","address":"https://doi.org/10.1145/3428229","index":256},"https://doi.org/10.1145/3428230":{"title":"Noam Yefet, Uri Alon, Eran Yahav: Adversarial examples for models of code. 162:1-162:30","address":"https://doi.org/10.1145/3428230","index":257},"https://doi.org/10.1145/3428231":{"title":"Milijana Surbatovich, Brandon Lucia, Limin Jia: Towards a formal foundation of intermittent computing. 163:1-163:31","address":"https://doi.org/10.1145/3428231","index":258},"https://doi.org/10.1145/3428232":{"title":"Guannan Wei, Oliver Bracevac, Shangyin Tan, Tiark Rompf: Compiling symbolic execution with staging and algebraic effects. 164:1-164:33","address":"https://doi.org/10.1145/3428232","index":259},"https://doi.org/10.1145/3428233":{"title":"Hengchu Zhang, Edo Roth, Andreas Haeberlen, Benjamin C. Pierce, Aaron Roth: Testing differential privacy with dual interpreters. 165:1-165:26","address":"https://doi.org/10.1145/3428233","index":260},"https://doi.org/10.1145/3428234":{"title":"Julie L. Newcomb, Andrew Adams, Steven Johnson, Rastislav Bodík, Shoaib Kamil: Verifying and improving Halide's term rewriting system with program synthesis. 166:1-166:28","address":"https://doi.org/10.1145/3428234","index":261},"https://doi.org/10.1145/3428235":{"title":"Gabriel Poesia, Fernando Magno Quintão Pereira: Dynamic dispatch of context-sensitive optimizations. 167:1-167:28","address":"https://doi.org/10.1145/3428235","index":262},"https://doi.org/10.1145/3428236":{"title":"Anders Møller, Oskar Haarklou Veileborg: Eliminating abstraction overhead of Java stream pipelines using ahead-of-time program optimization. 168:1-168:29","address":"https://doi.org/10.1145/3428236","index":263},"https://doi.org/10.1145/3428237":{"title":"Sarah Spall, Neil Mitchell, Sam Tobin-Hochstadt: Build scripts with perfect dependencies. 169:1-169:28","address":"https://doi.org/10.1145/3428237","index":264},"https://doi.org/10.1145/3428238":{"title":"John K. Feser, Sam Madden, Nan Tang, Armando Solar-Lezama: Deductive optimization of relational data storage. 170:1-170:30","address":"https://doi.org/10.1145/3428238","index":265},"https://doi.org/10.1145/3428239":{"title":"Joshua Clune, Vijay Ramamurthy, Ruben Martins, Umut A. Acar: Program equivalence for assisted grading of functional programs. 171:1-171:29","address":"https://doi.org/10.1145/3428239","index":266},"https://doi.org/10.1145/3428240":{"title":"Martin Avanzini, Georg Moser, Michael Schaper: A modular cost analysis for probabilistic programs. 172:1-172:30","address":"https://doi.org/10.1145/3428240","index":267},"https://doi.org/10.1145/3428241":{"title":"Dietrich Geisler, Irene Yoon, Aditi Kabra, Horace He, Yinnon Sanders, Adrian Sampson: Geometry types for graphics programming. 173:1-173:25","address":"https://doi.org/10.1145/3428241","index":268},"https://doi.org/10.1145/3428242":{"title":"Zhefeng Wu, Zhe Sun, Kai Gong, Lingyun Chen, Bin Liao, Yihua Jin: Hidden inheritance: an inline caching design for TypeScript performance. 174:1-174:29","address":"https://doi.org/10.1145/3428242","index":269},"https://doi.org/10.1145/3428243":{"title":"Fengyun Liu, Ondrej Lhoták, Aggelos Biboudis, Paolo G. Giarrusso, Martin Odersky: A type-and-effect system for object initialization. 175:1-175:28","address":"https://doi.org/10.1145/3428243","index":270},"https://doi.org/10.1145/3428244":{"title":"Subarno Banerjee, David Devecsery, Peter M. Chen, Satish Narayanasamy: Sound garbage collection for C using pointer provenance. 176:1-176:28","address":"https://doi.org/10.1145/3428244","index":271},"https://doi.org/10.1145/3428245":{"title":"Manasij Mukherjee, Pranav Kant, Zhengyang Liu, John Regehr: Dataflow-based pruning for speeding up superoptimization. 177:1-177:24","address":"https://doi.org/10.1145/3428245","index":272},"https://doi.org/10.1145/3428246":{"title":"Ana Milanova: FlowCFL: generalized type-based reachability analysis: graph reduction and equivalence of CFL-based and type-based reachability. 178:1-178:29","address":"https://doi.org/10.1145/3428246","index":273},"https://doi.org/10.1145/3428247":{"title":"Minseok Jeon, Myungho Lee, Hakjoo Oh: Learning graph-based heuristics for pointer analysis without handcrafting application-specific features. 179:1-179:30","address":"https://doi.org/10.1145/3428247","index":274},"https://doi.org/10.1145/3428248":{"title":"Arjen Rouvoet, Hendrik van Antwerpen, Casper Bach Poulsen, Robbert Krebbers, Eelco Visser: Knowing when to ask: sound scheduling of name resolution in type checkers derived from declarative specifications. 180:1-180:28","address":"https://doi.org/10.1145/3428248","index":275},"https://doi.org/10.1145/3428249":{"title":"Alexi Turcotte, Aviral Goel, Filip Krikava, Jan Vitek: Designing types for R, empirically. 181:1-181:25","address":"https://doi.org/10.1145/3428249","index":276},"https://doi.org/10.1145/3428250":{"title":"Aayan Kumar, Vivek Seshadri, Rahul Sharma: Shiftry: RNN inference in 2KB of RAM. 182:1-182:30","address":"https://doi.org/10.1145/3428250","index":277},"https://doi.org/10.1145/3428251":{"title":"Lingkun Kong, Konstantinos Mamouras: StreamQL: a query language for processing streaming time series. 183:1-183:32","address":"https://doi.org/10.1145/3428251","index":278},"https://doi.org/10.1145/3428252":{"title":"Qianshan Yu, Fei He, Bow-Yaw Wang: Incremental predicate analysis for regression verification. 184:1-184:25","address":"https://doi.org/10.1145/3428252","index":279},"https://doi.org/10.1145/3428253":{"title":"Caterina Urban, Maria Christakis, Valentin Wüstholz, Fuyuan Zhang: Perfectly parallel fairness certification of neural networks. 185:1-185:30","address":"https://doi.org/10.1145/3428253","index":280},"https://doi.org/10.1145/3428254":{"title":"Quentin Stiévenart, Magnus Madsen: Fuzzing channel-based concurrency runtimes using types and effects. 186:1-186:27","address":"https://doi.org/10.1145/3428254","index":281},"https://doi.org/10.1145/3428255":{"title":"Anders Møller, Benjamin Barslev Nielsen, Martin Toldam Torp: Detecting locations in JavaScript programs affected by breaking library changes. 187:1-187:25","address":"https://doi.org/10.1145/3428255","index":282},"https://doi.org/10.1145/3428256":{"title":"Mirko Köhler, Nafise Eskandani, Pascal Weisenburger, Alessandro Margara, Guido Salvaneschi: Rethinking safe consistency in distributed object-oriented programming. 188:1-188:30","address":"https://doi.org/10.1145/3428256","index":283},"https://doi.org/10.1145/3428257":{"title":"Ton Chanh Le, Timos Antonopoulos, Parisa Fathololumi, Eric Koskinen, ThanhVu Nguyen: DynamiTe: dynamic termination and non-termination proofs. 189:1-189:30","address":"https://doi.org/10.1145/3428257","index":284},"https://doi.org/10.1145/3428258":{"title":"Sifis Lagouvardos, Neville Grech, Ilias Tsatiris, Yannis Smaragdakis: Precise static modeling of Ethereum \"memory\". 190:1-190:26","address":"https://doi.org/10.1145/3428258","index":285},"https://doi.org/10.1145/3428259":{"title":"John Peter Campora III, Sheng Chen: Taming type annotations in gradual typing. 191:1-191:30","address":"https://doi.org/10.1145/3428259","index":286},"https://doi.org/10.1145/3428260":{"title":"Minh-Thai Trinh, Duc-Hiep Chu, Joxan Jaffar: Inter-theory dependency analysis for SMT string solvers. 192:1-192:27","address":"https://doi.org/10.1145/3428260","index":287},"https://doi.org/10.1145/3428261":{"title":"Dominik Winterer, Chengyu Zhang, Zhendong Su: On the unusual effectiveness of type-aware operator mutations for testing SMT solvers. 193:1-193:25","address":"https://doi.org/10.1145/3428261","index":288},"https://doi.org/10.1145/3428262":{"title":"Radha Jagadeesan, Alan Jeffrey, James Riely: Pomsets with preconditions: a simple model of relaxed memory. 194:1-194:30","address":"https://doi.org/10.1145/3428262","index":289},"https://doi.org/10.1145/3428263":{"title":"Tobias Grosser, Theodoros Theodoridis, Maximilian Falkenstein, Arjun Pitchanathan, Michael Kruse, Manuel Rigger, Zhendong Su, Torsten Hoefler: Fast linear programming through transprecision computing on small and sparse data. 195:1-195:28","address":"https://doi.org/10.1145/3428263","index":290},"https://doi.org/10.1145/3428264":{"title":"Vsevolod Livinskii, Dmitry Babokin, John Regehr: Random testing for C and C++ compilers with YARPGen. 196:1-196:25","address":"https://doi.org/10.1145/3428264","index":291},"https://doi.org/10.1145/3428265":{"title":"Yuting Wang, Xiangzhe Xu, Pierre Wilke, Zhong Shao: CompCertELF: verified separate compilation of C programs into ELF object files. 197:1-197:28","address":"https://doi.org/10.1145/3428265","index":292},"https://doi.org/10.1145/3428266":{"title":"Bo Sang, Patrick Eugster, Gustavo Petri, Srivatsan Ravi, Pierre-Louis Roman: Scalable and serializable networked multi-actor programming. 198:1-198:30","address":"https://doi.org/10.1145/3428266","index":293},"https://doi.org/10.1145/3428267":{"title":"Fei He, Jitao Han: Termination analysis for evolving programs: an incremental approach by reusing certified modules. 199:1-199:27","address":"https://doi.org/10.1145/3428267","index":294},"https://doi.org/10.1145/3428268":{"title":"Eric Atkinson, Michael Carbin: Programming and reasoning with partial observability. 200:1-200:28","address":"https://doi.org/10.1145/3428268","index":295},"https://doi.org/10.1145/3428269":{"title":"Ivan Gavran, Eva Darulova, Rupak Majumdar: Interactive synthesis of temporal specifications from examples and natural language. 201:1-201:26","address":"https://doi.org/10.1145/3428269","index":296},"https://doi.org/10.1145/3428270":{"title":"Wing Lam, Stefan Winter, Anjiang Wei, Tao Xie, Darko Marinov, Jonathan Bell: A large-scale longitudinal study of flaky tests. 202:1-202:29","address":"https://doi.org/10.1145/3428270","index":297},"https://doi.org/10.1145/3428271":{"title":"Hailong Zhang, Yu Hao, Sufian Latif, Raef Bassily, Atanas Rountev: Differentially-private software frequency profiling under linear constraints. 203:1-203:24","address":"https://doi.org/10.1145/3428271","index":298},"https://doi.org/10.1145/3428272":{"title":"Alejandro Gómez-Londoño, Johannes Åman Pohjola, Hira Taqdees Syeda, Magnus O. Myreen, Yong Kiam Tan: Do you have space for dessert? a verified space cost semantics for CakeML programs. 204:1-204:29","address":"https://doi.org/10.1145/3428272","index":299},"https://doi.org/10.1145/3428273":{"title":"Michael B. James, Zheng Guo, Ziteng Wang, Shivani Doshi, Hila Peleg, Ranjit Jhala, Nadia Polikarpova: Digging for fold: synthesis-aided API discovery for Haskell. 205:1-205:27","address":"https://doi.org/10.1145/3428273","index":300},"https://doi.org/10.1145/3428274":{"title":"Koar Marntirosian, Tom Schrijvers, Bruno C. d. S. Oliveira, Georgios Karachalias: Resolution as intersection subtyping via Modus Ponens. 206:1-206:30","address":"https://doi.org/10.1145/3428274","index":301},"https://doi.org/10.1145/3428275":{"title":"Julia Belyakova, Benjamin Chung, Jack Gelinas, Jameson Nash, Ross Tate, Jan Vitek: World age in Julia: optimizing method dispatch in the presence of eval. 207:1-207:26","address":"https://doi.org/10.1145/3428275","index":302},"https://doi.org/10.1145/3428276":{"title":"Ifaz Kabir, Yufeng Li, Ondrej Lhoták: ιDOT: a DOT calculus with object initialization. 208:1-208:28","address":"https://doi.org/10.1145/3428276","index":303},"https://doi.org/10.1145/3428277":{"title":"Elvira Albert, Shelly Grossman, Noam Rinetzky, Clara Rodríguez-Núñez, Albert Rubio, Mooly Sagiv: Taming callbacks for smart contract modularity. 209:1-209:30","address":"https://doi.org/10.1145/3428277","index":304},"https://doi.org/10.1145/3428278":{"title":"Cezara Dragoi, Constantin Enea, Burcu Kulahcioglu Ozkan, Rupak Majumdar, Filip Niksic: Testing consensus implementations using communication closure. 210:1-210:29","address":"https://doi.org/10.1145/3428278","index":305},"https://doi.org/10.1145/3428279":{"title":"Manuel Rigger, Zhendong Su: Finding bugs in database systems via query partitioning. 211:1-211:30","address":"https://doi.org/10.1145/3428279","index":306},"https://doi.org/10.1145/3428280":{"title":"Sumit Gulwani, Vu Le, Arjun Radhakrishna, Ivan Radicek, Mohammad Raza: Structure interpretation of text formats. 212:1-212:29","address":"https://doi.org/10.1145/3428280","index":307},"https://doi.org/10.1145/3428281":{"title":"Cezara Dragoi, Josef Widder, Damien Zufferey: Programming at the edge of synchrony. 213:1-213:30","address":"https://doi.org/10.1145/3428281","index":308},"https://doi.org/10.1145/3428282":{"title":"Mehdi Bagherzadeh, Nicholas Fireman, Anas Shawesh, Raffi Khatchadourian: Actor concurrency bugs: a comprehensive study on symptoms, root causes, API usages, and differences. 214:1-214:32","address":"https://doi.org/10.1145/3428282","index":309},"https://doi.org/10.1145/3428283":{"title":"Shaked Brody, Uri Alon, Eran Yahav: A structural model for contextual code changes. 215:1-215:28","address":"https://doi.org/10.1145/3428283","index":310},"https://doi.org/10.1145/3428284":{"title":"Yiyun Liu, James Parker, Patrick Redmond, Lindsey Kuper, Michael Hicks, Niki Vazou: Verifying replicated data types with typeclass refinements in Liquid Haskell. 216:1-216:30","address":"https://doi.org/10.1145/3428284","index":311},"https://doi.org/10.1145/3428285":{"title":"Pengyu Nie, Marinela Parovic, Zhiqiang Zang, Sarfraz Khurshid, Aleksandar Milicevic, Milos Gligoric: Unifying execution of imperative generators and declarative specifications. 217:1-217:26","address":"https://doi.org/10.1145/3428285","index":312},"https://doi.org/10.1145/3428286":{"title":"Lenka Turonová, Lukás Holík, Ondrej Lengál, Olli Saarikivi, Margus Veanes, Tomás Vojnar: Regex matching with counting-set automata. 218:1-218:30","address":"https://doi.org/10.1145/3428286","index":313},"https://doi.org/10.1145/3428287":{"title":"Xiang Gao, Shraddha Barke, Arjun Radhakrishna, Gustavo Soares, Sumit Gulwani, Alan Leung, Nachiappan Nagappan, Ashish Tiwari: Feedback-driven semi-supervised synthesis of program transformations. 219:1-219:30","address":"https://doi.org/10.1145/3428287","index":314},"https://doi.org/10.1145/3428288":{"title":"Olivier Flückiger, Guido Chari, Ming-Ho Yee, Jan Jecmen, Jakob Hain, Jan Vitek: Contextual dispatch for function specialization. 220:1-220:24","address":"https://doi.org/10.1145/3428288","index":315},"https://doi.org/10.1145/3428289":{"title":"Shubhani Gupta, Abhishek Rose, Sorav Bansal: Counterexample-guided correlation algorithm for translation validation. 221:1-221:29","address":"https://doi.org/10.1145/3428289","index":316},"https://doi.org/10.1145/3428290":{"title":"Leif Andersen, Michael Ballantyne, Matthias Felleisen: Adding interactive visual syntax to textual code. 222:1-222:28","address":"https://doi.org/10.1145/3428290","index":317},"https://doi.org/10.1145/3428291":{"title":"Yaoda Zhou, Bruno C. d. S. Oliveira, Jinxu Zhao: Revisiting iso-recursive subtyping. 223:1-223:28","address":"https://doi.org/10.1145/3428291","index":318},"https://doi.org/10.1145/3428292":{"title":"Ruyi Ji, Yican Sun, Yingfei Xiong, Zhenjiang Hu: Guiding dynamic programing via structural probability for accelerating programming by example. 224:1-224:29","address":"https://doi.org/10.1145/3428292","index":319},"https://doi.org/10.1145/3428293":{"title":"Yaniv David, Uri Alon, Eran Yahav: Neural reverse engineering of stripped binaries using augmented control flow graphs. 225:1-225:28","address":"https://doi.org/10.1145/3428293","index":320},"https://doi.org/10.1145/3428294":{"title":"Jake Kirkham, Tyler Sorensen, Esin Tureci, Margaret Martonosi: Foundations of empirical memory consistency testing. 226:1-226:29","address":"https://doi.org/10.1145/3428294","index":321},"https://doi.org/10.1145/3428295":{"title":"Shraddha Barke, Hila Peleg, Nadia Polikarpova: Just-in-time learning for bottom-up enumerative synthesis. 227:1-227:29","address":"https://doi.org/10.1145/3428295","index":322},"https://doi.org/10.1145/3428296":{"title":"Jenna Wise, Johannes Bader, Cameron Wong, Jonathan Aldrich, Éric Tanter, Joshua Sunshine: Gradual verification of recursive heap data structures. 228:1-228:28","address":"https://doi.org/10.1145/3428296","index":323},"https://doi.org/10.1145/3428297":{"title":"Michael Ballantyne, Alexis King, Matthias Felleisen: Macros for domain-specific languages. 229:1-229:29","address":"https://doi.org/10.1145/3428297","index":324},"https://doi.org/10.1145/3428298":{"title":"Suvam Mukherjee, Pantazis Deligiannis, Arpita Biswas, Akash Lal: Learning-based controlled concurrency testing. 230:1-230:31","address":"https://doi.org/10.1145/3428298","index":325},"https://doi.org/10.1145/3428299":{"title":"Emily First, Yuriy Brun, Arjun Guha: TacTok: semantics-aware proof synthesis. 231:1-231:31","address":"https://doi.org/10.1145/3428299","index":326},"https://doi.org/10.1145/3428300":{"title":"Ritwika Ghosh, Chiao Hsieh, Sasa Misailovic, Sayan Mitra: Koord: a language for programming and verifying distributed robotics application. 232:1-232:30","address":"https://doi.org/10.1145/3428300","index":327},"https://doi.org/10.1145/3428301":{"title":"Yulei Sui, Xiao Cheng, Guanqin Zhang, Haoyu Wang: Flow2Vec: value-flow-based precise code embedding. 233:1-233:27","address":"https://doi.org/10.1145/3428301","index":328},"https://doi.org/10.1145/3290314":{"title":"Evan Cavallo, Robert Harper: Higher inductive types in cubical computational type theory. 1:1-1:27","address":"https://doi.org/10.1145/3290314","index":329},"https://doi.org/10.1145/3290315":{"title":"Ambrus Kaposi, András Kovács, Thorsten Altenkirch: Constructing quotient inductive-inductive types. 2:1-2:24","address":"https://doi.org/10.1145/3290315","index":330},"https://doi.org/10.1145/3290316":{"title":"Gaëtan Gilbert, Jesper Cockx, Matthieu Sozeau, Nicolas Tabareau: Definitional proof-irrelevance without K. 3:1-3:28","address":"https://doi.org/10.1145/3290316","index":331},"https://doi.org/10.1145/3290317":{"title":"Rasmus Ejlers Møgelberg, Niccolò Veltri: Bisimulation as path type for guarded recursive types. 4:1-4:29","address":"https://doi.org/10.1145/3290317","index":332},"https://doi.org/10.1145/3290318":{"title":"Yizhou Zhang, Andrew C. Myers: Abstraction-safe effect handlers via tunneling. 5:1-5:29","address":"https://doi.org/10.1145/3290318","index":333},"https://doi.org/10.1145/3290319":{"title":"Dariusz Biernacki, Maciej Piróg, Piotr Polesiuk, Filip Sieczkowski: Abstracting algebraic effects. 6:1-6:28","address":"https://doi.org/10.1145/3290319","index":334},"https://doi.org/10.1145/3290320":{"title":"Ugo Dal Lago, Marc de Visme, Damiano Mazza, Akira Yoshimizu: Intersection types and runtime errors in the pi-calculus. 7:1-7:29","address":"https://doi.org/10.1145/3290320","index":335},"https://doi.org/10.1145/3290321":{"title":"Andrej Dudenhefner, Jakob Rehof: Principality and approximation under dimensional bound. 8:1-8:29","address":"https://doi.org/10.1145/3290321","index":336},"https://doi.org/10.1145/3290322":{"title":"Jana Dunfield, Neelakantan R. Krishnaswami: Sound and complete bidirectional typechecking for higher-rank polymorphism with existentials and indexed types. 9:1-9:28","address":"https://doi.org/10.1145/3290322","index":337},"https://doi.org/10.1145/3290323":{"title":"Karl Crary: Fully abstract module compilation. 10:1-10:29","address":"https://doi.org/10.1145/3290323","index":338},"https://doi.org/10.1145/3290324":{"title":"Gyunghee Park, Jaemin Hong, Guy L. Steele Jr., Sukyoung Ryu: Polymorphic symmetric multiple dispatch with variance. 11:1-11:28","address":"https://doi.org/10.1145/3290324","index":339},"https://doi.org/10.1145/3290325":{"title":"J. Garrett Morris, James McKinna: Abstracting extensible data types: or, rows by any other name. 12:1-12:28","address":"https://doi.org/10.1145/3290325","index":340},"https://doi.org/10.1145/3290326":{"title":"Di Wang, Jan Hoffmann: Type-guided worst-case input generation. 13:1-13:30","address":"https://doi.org/10.1145/3290326","index":341},"https://doi.org/10.1145/3290327":{"title":"Cyrus Omar, Ian Voysey, Ravi Chugh, Matthew A. Hammer: Live functional programming with typed holes. 14:1-14:32","address":"https://doi.org/10.1145/3290327","index":342},"https://doi.org/10.1145/3290328":{"title":"Max S. New, Daniel R. Licata, Amal Ahmed: Gradual type theory. 15:1-15:31","address":"https://doi.org/10.1145/3290328","index":343},"https://doi.org/10.1145/3290329":{"title":"Giuseppe Castagna, Victor Lanvin, Tommaso Petrucciani, Jeremy G. Siek: Gradual typing: a new perspective. 16:1-16:32","address":"https://doi.org/10.1145/3290329","index":344},"https://doi.org/10.1145/3290330":{"title":"Matías Toro, Elizabeth Labrada, Éric Tanter: Gradual parametricity, revisited. 17:1-17:30","address":"https://doi.org/10.1145/3290330","index":345},"https://doi.org/10.1145/3290331":{"title":"Yusuke Miyazaki, Taro Sekiyama, Atsushi Igarashi: Dynamic type inference for gradual Hindley-Milner typing. 18:1-18:29","address":"https://doi.org/10.1145/3290331","index":346},"https://doi.org/10.1145/3290332":{"title":"Lau Skorstengaard, Dominique Devriese, Lars Birkedal: StkTokens: enforcing well-bracketed control flow and stack encapsulation using linear capabilities. 19:1-19:28","address":"https://doi.org/10.1145/3290332","index":347},"https://doi.org/10.1145/3290333":{"title":"G. A. Kavvos: Modalities, cohesion, and information flow. 20:1-20:29","address":"https://doi.org/10.1145/3290333","index":348},"https://doi.org/10.1145/3290334":{"title":"Tom Hirschowitz: Familial monads and structural operational semantics. 21:1-21:28","address":"https://doi.org/10.1145/3290334","index":349},"https://doi.org/10.1145/3290335":{"title":"Jasmin Christian Blanchette, Lorenzo Gheri, Andrei Popescu, Dmitriy Traytel: Bindings as bounded natural functors. 22:1-22:34","address":"https://doi.org/10.1145/3290335","index":350},"https://doi.org/10.1145/3290336":{"title":"Paul-André Melliès: Categorical combinatorics of scheduling and synchronization in game semantics. 23:1-23:30","address":"https://doi.org/10.1145/3290336","index":351},"https://doi.org/10.1145/3290337":{"title":"Wen Kokke, Fabrizio Montesi, Marco Peressotti: Better late than never: a fully-abstract semantics for classical processes. 24:1-24:29","address":"https://doi.org/10.1145/3290337","index":352},"https://doi.org/10.1145/3290338":{"title":"Filippo Bonchi, Joshua Holland, Robin Piedeleu, Pawel Sobocinski, Fabio Zanasi: Diagrammatic algebra: from linear to concurrent systems. 25:1-25:28","address":"https://doi.org/10.1145/3290338","index":353},"https://doi.org/10.1145/3290339":{"title":"Paolo Baldan, Barbara König, Christina Mika-Michalski, Tommaso Padoan: Fixpoint games on continuous lattices. 26:1-26:29","address":"https://doi.org/10.1145/3290339","index":354},"https://doi.org/10.1145/3290340":{"title":"Simon Castellan, Nobuko Yoshida: Two sides of the same coin: session types and game semantics: a synchronous side and an asynchronous side. 27:1-27:29","address":"https://doi.org/10.1145/3290340","index":355},"https://doi.org/10.1145/3290341":{"title":"Simon Fowler, Sam Lindley, J. Garrett Morris, Sára Decova: Exceptional asynchronous session types: session types without tiers. 28:1-28:29","address":"https://doi.org/10.1145/3290341","index":356},"https://doi.org/10.1145/3290342":{"title":"David Castro-Perez, Raymond Hu, Sung-Shik Jongmans, Nicholas Ng, Nobuko Yoshida: Distributed programming using role-parametric session types in go: statically-typed endpoint APIs for dynamically-instantiated communication structures. 29:1-29:30","address":"https://doi.org/10.1145/3290342","index":357},"https://doi.org/10.1145/3290343":{"title":"Alceste Scalas, Nobuko Yoshida: Less is more: multiparty session types revisited. 30:1-30:29","address":"https://doi.org/10.1145/3290343","index":358},"https://doi.org/10.1145/3290344":{"title":"Shih-Han Hung, Kesha Hietala, Shaopeng Zhu, Mingsheng Ying, Michael Hicks, Xiaodi Wu: Quantitative robustness analysis of quantum programs. 31:1-31:29","address":"https://doi.org/10.1145/3290344","index":359},"https://doi.org/10.1145/3290345":{"title":"Pierre Clairambault, Marc de Visme, Glynn Winskel: Game semantics for quantum programming. 32:1-32:29","address":"https://doi.org/10.1145/3290345","index":360},"https://doi.org/10.1145/3290346":{"title":"Dominique Unruh: Quantum relational Hoare logic. 33:1-33:31","address":"https://doi.org/10.1145/3290346","index":361},"https://doi.org/10.1145/3290347":{"title":"Kevin Batz, Benjamin Lucien Kaminski, Joost-Pieter Katoen, Christoph Matheja, Thomas Noll: Quantitative separation logic: a logic for reasoning about probabilistic pointer programs. 34:1-34:29","address":"https://doi.org/10.1145/3290347","index":362},"https://doi.org/10.1145/3290348":{"title":"Maria I. Gorinova, Andrew D. Gordon, Charles Sutton: Probabilistic programming with densities in SlicStan: efficient, flexible, and deterministic. 35:1-35:30","address":"https://doi.org/10.1145/3290348","index":363},"https://doi.org/10.1145/3290349":{"title":"Matthijs Vákár, Ohad Kammar, Sam Staton: A domain theory for statistical probabilistic programming. 36:1-36:29","address":"https://doi.org/10.1145/3290349","index":364},"https://doi.org/10.1145/3290350":{"title":"Feras A. Saad, Marco F. Cusumano-Towner, Ulrich Schaechtle, Martin C. Rinard, Vikash K. Mansinghka: Bayesian synthesis of probabilistic programs for automatic data modeling. 37:1-37:32","address":"https://doi.org/10.1145/3290350","index":365},"https://doi.org/10.1145/3290351":{"title":"Tetsuya Sato, Alejandro Aguirre, Gilles Barthe, Marco Gaboardi, Deepak Garg, Justin Hsu: Formal verification of higher-order probabilistic programs: reasoning about approximation, convergence, Bayesian inference, and optimization. 38:1-38:30","address":"https://doi.org/10.1145/3290351","index":366},"https://doi.org/10.1145/3290352":{"title":"Calvin Smith, Justin Hsu, Aws Albarghouthi: Trace abstraction modulo probability. 39:1-39:31","address":"https://doi.org/10.1145/3290352","index":367},"https://doi.org/10.1145/3290353":{"title":"Uri Alon, Meital Zilberstein, Omer Levy, Eran Yahav: code2vec: learning distributed representations of code. 40:1-40:29","address":"https://doi.org/10.1145/3290353","index":368},"https://doi.org/10.1145/3290354":{"title":"Gagandeep Singh, Timon Gehr, Markus Püschel, Martin T. Vechev: An abstract domain for certifying neural networks. 41:1-41:30","address":"https://doi.org/10.1145/3290354","index":369},"https://doi.org/10.1145/3290355":{"title":"Patrick Cousot, Roberto Giacobazzi, Francesco Ranzato: A²I: abstract² interpretation. 42:1-42:31","address":"https://doi.org/10.1145/3290355","index":370},"https://doi.org/10.1145/3290356":{"title":"John Toman, Dan Grossman: Concerto: a framework for combined concrete and abstract interpretation. 43:1-43:29","address":"https://doi.org/10.1145/3290356","index":371},"https://doi.org/10.1145/3290357":{"title":"Martin Bodin, Philippa Gardner, Thomas P. Jensen, Alan Schmitt: Skeletal semantics and their interpretations. 44:1-44:31","address":"https://doi.org/10.1145/3290357","index":372},"https://doi.org/10.1145/3290358":{"title":"John Cyphert, Jason Breck, Zachary Kincaid, Thomas W. Reps: Refinement of path expressions for static analysis. 45:1-45:29","address":"https://doi.org/10.1145/3290358","index":373},"https://doi.org/10.1145/3290359":{"title":"Umang Mathur, P. Madhusudan, Mahesh Viswanathan: Decidable verification of uninterpreted programs. 46:1-46:29","address":"https://doi.org/10.1145/3290359","index":374},"https://doi.org/10.1145/3290360":{"title":"Oana Fabiana Andreescu, Thomas P. Jensen, Stéphane Lescuyer, Benoît Montagu: Inferring frame conditions with static correlation analysis. 47:1-47:29","address":"https://doi.org/10.1145/3290360","index":375},"https://doi.org/10.1145/3290361":{"title":"Johannes Späth, Karim Ali, Eric Bodden: Context-, flow-, and field-sensitive data-flow analysis using synchronized Pushdown systems. 48:1-48:29","address":"https://doi.org/10.1145/3290361","index":376},"https://doi.org/10.1145/3290362":{"title":"Taolue Chen, Matthew Hague, Anthony W. Lin, Philipp Rümmer, Zhilin Wu: Decision procedures for path feasibility of string-manipulating programs with complex operations. 49:1-49:30","address":"https://doi.org/10.1145/3290362","index":377},"https://doi.org/10.1145/3290363":{"title":"Rajeev Alur, Konstantinos Mamouras, Caleb Stanford: Modular quantitative monitoring. 50:1-50:31","address":"https://doi.org/10.1145/3290363","index":378},"https://doi.org/10.1145/3290364":{"title":"Kyungmin Bae, Jia Lee: Bounded model checking of signal temporal logic properties using syntactic separation. 51:1-51:30","address":"https://doi.org/10.1145/3290364","index":379},"https://doi.org/10.1145/3290365":{"title":"Luca Aceto, Antonis Achilleos, Adrian Francalanza, Anna Ingólfsdóttir, Karoliina Lehtinen: Adventures in monitorability: from branching to linear time and back again. 52:1-52:29","address":"https://doi.org/10.1145/3290365","index":380},"https://doi.org/10.1145/3290366":{"title":"Krishnendu Chatterjee, Amir Kafshdar Goharshady, Nastaran Okati, Andreas Pavlogiannis: Efficient parameterized algorithms for data packing. 53:1-53:28","address":"https://doi.org/10.1145/3290366","index":381},"https://doi.org/10.1145/3290367":{"title":"Valentin Touzeau, Claire Maïza, David Monniaux, Jan Reineke: Fast and exact analysis for LRU caches. 54:1-54:29","address":"https://doi.org/10.1145/3290367","index":382},"https://doi.org/10.1145/3290368":{"title":"Zachary Kincaid, Jason Breck, John Cyphert, Thomas W. Reps: Closed forms for numerical loops. 55:1-55:29","address":"https://doi.org/10.1145/3290368","index":383},"https://doi.org/10.1145/3290369":{"title":"Xin Yi, Liqian Chen, Xiaoguang Mao, Tao Ji: Efficient automated repair of high floating-point errors in numerical libraries. 56:1-56:29","address":"https://doi.org/10.1145/3290369","index":384},"https://doi.org/10.1145/3290370":{"title":"Nikos Gorogiannis, Peter W. O'Hearn, Ilya Sergey: A true positives theorem for a static race detector. 57:1-57:29","address":"https://doi.org/10.1145/3290370","index":385},"https://doi.org/10.1145/3290371":{"title":"Roland Meyer, Sebastian Wolff: Decoupling lock-free data structures from memory reclamation for static analysis. 58:1-58:31","address":"https://doi.org/10.1145/3290371","index":386},"https://doi.org/10.1145/3290372":{"title":"Klaus von Gleissenthall, Rami Gökhan Kici, Alexander Bakst, Deian Stefan, Ranjit Jhala: Pretend synchrony: synchronous verification of asynchronous distributed programs. 59:1-59:30","address":"https://doi.org/10.1145/3290372","index":387},"https://doi.org/10.1145/3290373":{"title":"Michael Emmi, Constantin Enea: Weak-consistency specification via visibility relaxation. 60:1-60:28","address":"https://doi.org/10.1145/3290373","index":388},"https://doi.org/10.1145/3290374":{"title":"Spencer P. Florence, Shu-Hung You, Jesse A. Tov, Robert Bruce Findler: A calculus for Esterel: if can, can. if no can, no can. 61:1-61:29","address":"https://doi.org/10.1145/3290374","index":389},"https://doi.org/10.1145/3290375":{"title":"Yuting Wang, Pierre Wilke, Zhong Shao: An abstract stack based approach to verified compositional compilation to machine code. 62:1-62:30","address":"https://doi.org/10.1145/3290375","index":390},"https://doi.org/10.1145/3290376":{"title":"Aymeric Fromherz, Nick Giannarakis, Chris Hawblitzel, Bryan Parno, Aseem Rastogi, Nikhil Swamy: A verified, efficient embedding of a verifiable assembly language. 63:1-63:30","address":"https://doi.org/10.1145/3290376","index":391},"https://doi.org/10.1145/3290377":{"title":"Joseph Tassarotti, Robert Harper: A separation logic for concurrent randomized programs. 64:1-64:30","address":"https://doi.org/10.1145/3290377","index":392},"https://doi.org/10.1145/3290378":{"title":"Ales Bizjak, Daniel Gratzer, Robbert Krebbers, Lars Birkedal: Iron: managing obligations in higher-order concurrent separation logic. 65:1-65:30","address":"https://doi.org/10.1145/3290378","index":393},"https://doi.org/10.1145/3290379":{"title":"José Fragoso Santos, Petar Maksimovic, Gabriela Sampaio, Philippa Gardner: JaVerT 2.0: compositional symbolic execution for JavaScript. 66:1-66:31","address":"https://doi.org/10.1145/3290379","index":394},"https://doi.org/10.1145/3290380":{"title":"Kayvan Memarian, Victor B. F. Gomes, Brooks Davis, Stephen Kell, Alexander Richardson, Robert N. M. Watson, Peter Sewell: Exploring C semantics and pointer provenance. 67:1-67:32","address":"https://doi.org/10.1145/3290380","index":395},"https://doi.org/10.1145/3290381":{"title":"Azalea Raad, Marko Doko, Lovro Rozic, Ori Lahav, Viktor Vafeiadis: On library correctness under weak memory consistency: specifying and verifying concurrent libraries under declarative consistency models. 68:1-68:31","address":"https://doi.org/10.1145/3290381","index":396},"https://doi.org/10.1145/3290382":{"title":"Anton Podkopaev, Ori Lahav, Viktor Vafeiadis: Bridging the gap between programming languages and hardware weak memory models. 69:1-69:31","address":"https://doi.org/10.1145/3290382","index":397},"https://doi.org/10.1145/3290383":{"title":"Soham Chakraborty, Viktor Vafeiadis: Grounding thin-air reads with event structures. 70:1-70:28","address":"https://doi.org/10.1145/3290383","index":398},"https://doi.org/10.1145/3290384":{"title":"Alasdair Armstrong, Thomas Bauereiss, Brian Campbell, Alastair Reid, Kathryn E. Gray, Robert M. Norton, Prashanth Mundkur, Mark Wassell, Jon French, Christopher Pulte, Shaked Flur, Ian Stark, Neel Krishnaswami, Peter Sewell: ISA semantics for ARMv8-a, RISC-v, and CHERI-MIPS. 71:1-71:31","address":"https://doi.org/10.1145/3290384","index":399},"https://doi.org/10.1145/3290385":{"title":"Nadia Polikarpova, Ilya Sergey: Structuring the synthesis of heap-manipulating programs. 72:1-72:30","address":"https://doi.org/10.1145/3290385","index":400},"https://doi.org/10.1145/3290386":{"title":"Kensen Shi, Jacob Steinhardt, Percy Liang: FrAngel: component-based synthesis with control structures. 73:1-73:29","address":"https://doi.org/10.1145/3290386","index":401},"https://doi.org/10.1145/3290387":{"title":"Farzin Houshmand, Mohsen Lesani: Hamsaz: replication coordination analysis and synthesis. 74:1-74:32","address":"https://doi.org/10.1145/3290387","index":402},"https://doi.org/10.1145/3290388":{"title":"James Parker, Niki Vazou, Michael Hicks: LWeb: information flow security for multi-tier web applications. 75:1-75:30","address":"https://doi.org/10.1145/3290388","index":403},"https://doi.org/10.1145/3290389":{"title":"Marco Vassena, Alejandro Russo, Deepak Garg, Vineet Rajani, Deian Stefan: From fine- to coarse-grained dynamic information flow control and back. 76:1-76:31","address":"https://doi.org/10.1145/3290389","index":404},"https://doi.org/10.1145/3290390":{"title":"Conrad Watt, John Renner, Natalie Popescu, Sunjay Cauligi, Deian Stefan: CT-wasm: type-driven secure cryptography for the web ecosystem. 77:1-77:29","address":"https://doi.org/10.1145/3290390","index":405},"https://doi.org/10.1145/3341642":{"title":"Matthew Flatt, Caner Derici, R. Kent Dybvig, Andrew W. Keep, Gustavo E. Massaccesi, Sarah Spall, Sam Tobin-Hochstadt, Jon Zeppieri: Rebuilding racket on chez scheme (experience report). 78:1-78:15","address":"https://doi.org/10.1145/3341642","index":406},"https://doi.org/10.1145/3341643":{"title":"Youyou Cong, Leo Osvald, Grégory M. Essertel, Tiark Rompf: Compiling with continuations, or without? whatever. 79:1-79:28","address":"https://doi.org/10.1145/3341643","index":407},"https://doi.org/10.1145/3341644":{"title":"Akimasa Morihata: Lambda calculus with algebraic simplification for reduction parallelization by equational reasoning. 80:1-80:25","address":"https://doi.org/10.1145/3341644","index":408},"https://doi.org/10.1145/3341685":{"title":"Stefan K. Muller, Sam Westrick, Umut A. Acar: Fairness in responsive parallelism. 81:1-81:30","address":"https://doi.org/10.1145/3341685","index":409},"https://doi.org/10.1145/3341686":{"title":"Benjamin Delaware, Sorawit Suriyakarn, Clément Pit-Claudel, Qianchuan Ye, Adam Chlipala: Narcissus: correct-by-construction derivation of decoders and encoders from binary formats. 82:1-82:29","address":"https://doi.org/10.1145/3341686","index":410},"https://doi.org/10.1145/3341687":{"title":"Zoe Paraskevopoulou, Andrew W. Appel: Closure conversion is safe for space. 83:1-83:29","address":"https://doi.org/10.1145/3341687","index":411},"https://doi.org/10.1145/3341688":{"title":"Thomas Van Strydonck, Frank Piessens, Dominique Devriese: Linear capabilities for fully abstract compilation of separation-logic-verified code. 84:1-84:29","address":"https://doi.org/10.1145/3341688","index":412},"https://doi.org/10.1145/3341689":{"title":"Daniel Patterson, Amal Ahmed: The next 700 compiler correctness theorems (functional pearl). 85:1-85:29","address":"https://doi.org/10.1145/3341689","index":413},"https://doi.org/10.1145/3341690":{"title":"Matthieu Sozeau, Cyprien Mangin: Equations reloaded: high-level dependently-typed functional programming and proving in Coq. 86:1-86:29","address":"https://doi.org/10.1145/3341690","index":414},"https://doi.org/10.1145/3341691":{"title":"Andrea Vezzosi, Anders Mörtberg, Andreas Abel: Cubical agda: a dependently typed programming language with univalence and higher inductive types. 87:1-87:29","address":"https://doi.org/10.1145/3341691","index":415},"https://doi.org/10.1145/3341692":{"title":"Joseph Eremondi, Éric Tanter, Ronald Garcia: Approximate normalization for gradual dependent types. 88:1-88:30","address":"https://doi.org/10.1145/3341692","index":416},"https://doi.org/10.1145/3341693":{"title":"Maximilian Algehed, Jean-Philippe Bernardy: Simple noninterference from parametricity. 89:1-89:22","address":"https://doi.org/10.1145/3341693","index":417},"https://doi.org/10.1145/3341694":{"title":"Andrey Mokhov, Georgy Lukyanov, Simon Marlow, Jerémie Dimino: Selective applicative functors. 90:1-90:29","address":"https://doi.org/10.1145/3341694","index":418},"https://doi.org/10.1145/3341695":{"title":"Gert-Jan Bottu, Ningning Xie, Koar Marntirosian, Tom Schrijvers: Coherence of type class resolution. 91:1-91:28","address":"https://doi.org/10.1145/3341695","index":419},"https://doi.org/10.1145/3341696":{"title":"Weihao Qu, Marco Gaboardi, Deepak Garg: Relational cost analysis for functional-imperative programs. 92:1-92:29","address":"https://doi.org/10.1145/3341696","index":420},"https://doi.org/10.1145/3341697":{"title":"Hengchu Zhang, Edo Roth, Andreas Haeberlen, Benjamin C. Pierce, Aaron Roth: Fuzzi: a three-level logic for differential privacy. 93:1-93:28","address":"https://doi.org/10.1145/3341697","index":421},"https://doi.org/10.1145/3341698":{"title":"Calvin Smith, Aws Albarghouthi: Synthesizing differentially private programs. 94:1-94:29","address":"https://doi.org/10.1145/3341698","index":422},"https://doi.org/10.1145/3341699":{"title":"Anders Miltner, Solomon Maina, Kathleen Fisher, Benjamin C. Pierce, David Walker, Steve Zdancewic: Synthesizing symmetric lenses. 95:1-95:28","address":"https://doi.org/10.1145/3341699","index":423},"https://doi.org/10.1145/3341700":{"title":"Fei Wang, Daniel Zheng, James M. Decker, Xilun Wu, Grégory M. Essertel, Tiark Rompf: Demystifying differentiable programming: shift/reset the penultimate backpropagator. 96:1-96:31","address":"https://doi.org/10.1145/3341700","index":424},"https://doi.org/10.1145/3341701":{"title":"Amir Shaikhha, Andrew W. Fitzgibbon, Dimitrios Vytiniotis, Simon Peyton Jones: Efficient differentiable programming in a functional array-processing language. 97:1-97:30","address":"https://doi.org/10.1145/3341701","index":425},"https://doi.org/10.1145/3341702":{"title":"Rajan Walia, Praveen Narayanan, Jacques Carette, Sam Tobin-Hochstadt, Chung-chieh Shan: From high-level inference algorithms to efficient code. 98:1-98:30","address":"https://doi.org/10.1145/3341702","index":426},"https://doi.org/10.1145/3341703":{"title":"Benjamin Sherman, Jesse Michel, Michael Carbin: Sound and robust solid modeling via exact real arithmetic and continuity. 99:1-99:29","address":"https://doi.org/10.1145/3341703","index":427},"https://doi.org/10.1145/3341704":{"title":"David Thrane Christiansen, Iavor S. Diatchki, Robert Dockins, Joe Hendrix, Tristan Ravitch: Dependently typed Haskell in industry (experience report). 100:1-100:16","address":"https://doi.org/10.1145/3341704","index":428},"https://doi.org/10.1145/3341705":{"title":"Stephanie Weirich, Pritam Choudhury, Antoine Voizard, Richard A. Eisenberg: A role for dependent types in Haskell. 101:1-101:29","address":"https://doi.org/10.1145/3341705","index":429},"https://doi.org/10.1145/3341706":{"title":"Csongor Kiss, Tony Field, Susan Eisenbach, Simon Peyton Jones: Higher-order type-level programming in Haskell. 102:1-102:26","address":"https://doi.org/10.1145/3341706","index":430},"https://doi.org/10.1145/3341707":{"title":"Wouter Swierstra, Tim Baanen: A predicate transformer semantics for effects (functional pearl). 103:1-103:26","address":"https://doi.org/10.1145/3341707","index":431},"https://doi.org/10.1145/3341708":{"title":"Kenji Maillard, Danel Ahman, Robert Atkey, Guido Martínez, Catalin Hritcu, Exequiel Rivas, Éric Tanter: Dijkstra monads for all. 104:1-104:29","address":"https://doi.org/10.1145/3341708","index":432},"https://doi.org/10.1145/3341709":{"title":"Amin Timany, Lars Birkedal: Mechanized relational verification of concurrent programs with continuations. 105:1-105:28","address":"https://doi.org/10.1145/3341709","index":433},"https://doi.org/10.1145/3341710":{"title":"Nicholas V. Lewchenko, Arjun Radhakrishna, Akash Gaonkar, Pavol Cerný: Sequential programming for replicated data stores. 106:1-106:28","address":"https://doi.org/10.1145/3341710","index":434},"https://doi.org/10.1145/3341711":{"title":"Daniel Gratzer, Jonathan Sterling, Lars Birkedal: Implementing a modal dependent type theory. 107:1-107:29","address":"https://doi.org/10.1145/3341711","index":435},"https://doi.org/10.1145/3341712":{"title":"Pierre-Marie Pédrot, Nicolas Tabareau, Hans Jacob Fehrmann, Éric Tanter: A reasonably exceptional type theory. 108:1-108:29","address":"https://doi.org/10.1145/3341712","index":436},"https://doi.org/10.1145/3341713":{"title":"Patrick Bahr, Christian Graulund, Rasmus Ejlers Møgelberg: Simply RaTT: a fitch-style modal calculus for reactive programming without space leaks. 109:1-109:27","address":"https://doi.org/10.1145/3341713","index":437},"https://doi.org/10.1145/3341714":{"title":"Dominic Orchard, Vilem-Benjamin Liepelt, Harley Eades III: Quantitative program reasoning with graded modal types. 110:1-110:30","address":"https://doi.org/10.1145/3341714","index":438},"https://doi.org/10.1145/3341715":{"title":"Bert Lindenhovius, Michael W. Mislove, Vladimir Zamdzhiev: Mixed linear and non-linear recursive types. 111:1-111:29","address":"https://doi.org/10.1145/3341715","index":439},"https://doi.org/10.1145/3341716":{"title":"Jinxu Zhao, Bruno C. d. S. Oliveira, Tom Schrijvers: A mechanical formalization of higher-ranked polymorphic type inference. 112:1-112:29","address":"https://doi.org/10.1145/3341716","index":440},"https://doi.org/10.1145/3341717":{"title":"Victor Cacciari Miraldo, Wouter Swierstra: An efficient algorithm for type-safe structural diffing. 113:1-113:29","address":"https://doi.org/10.1145/3341717","index":441},"https://doi.org/10.1145/3341718":{"title":"Jennifer Hackett, Graham Hutton: Call-by-need is clairvoyant call-by-value. 114:1-114:23","address":"https://doi.org/10.1145/3341718","index":442},"https://doi.org/10.1145/3341719":{"title":"Aliya Hameer, Brigitte Pientka: Teaching the art of functional programming using automated grading (experience report). 115:1-115:15","address":"https://doi.org/10.1145/3341719","index":443},"https://doi.org/10.1145/3342713":{"title":"Jeremy Yallop, Leo White: Lambda: the ultimate sublanguage (experience report). 116:1-116:17","address":"https://doi.org/10.1145/3342713","index":444},"https://doi.org/10.1145/3360543":{"title":"Kia Rahmani, Kartik Nagar, Benjamin Delaware, Suresh Jagannathan: CLOTHO: directed test generation for weakly consistent database systems. 117:1-117:28","address":"https://doi.org/10.1145/3360543","index":445},"https://doi.org/10.1145/3360544":{"title":"Osbert Bastani, Xin Zhang, Armando Solar-Lezama: Probabilistic verification of fairness properties via concentration. 118:1-118:27","address":"https://doi.org/10.1145/3360544","index":446},"https://doi.org/10.1145/3360545":{"title":"Vimuth Fernando, Keyur Joshi, Sasa Misailovic: Verifying safety and accuracy of approximate parallel programs via canonical sequentialization. 119:1-119:29","address":"https://doi.org/10.1145/3360545","index":447},"https://doi.org/10.1145/3360546":{"title":"Marcos Yukio Siraichi, Vinícius Fernandes dos Santos, Caroline Collange, Fernando Magno Quintão Pereira: Qubit allocation as a combination of subgraph isomorphism and token swapping. 120:1-120:29","address":"https://doi.org/10.1145/3360546","index":448},"https://doi.org/10.1145/3360547":{"title":"Arshavir Ter-Gabrielyan, Alexander J. Summers, Peter Müller: Modular verification of heap reachability properties in separation logic. 121:1-121:28","address":"https://doi.org/10.1145/3360547","index":449},"https://doi.org/10.1145/3360548":{"title":"Ben Greenman, Matthias Felleisen, Christos Dimoulas: Complete monitors for gradual types. 122:1-122:29","address":"https://doi.org/10.1145/3360548","index":450},"https://doi.org/10.1145/3360549":{"title":"Igor Konnov, Jure Kukovec, Thanh-Hai Tran: TLA+ model checking made symbolic. 123:1-123:30","address":"https://doi.org/10.1145/3360549","index":451},"https://doi.org/10.1145/3360550":{"title":"Krishnendu Chatterjee, Andreas Pavlogiannis, Viktor Toman: Value-centric dynamic partial order reduction. 124:1-124:29","address":"https://doi.org/10.1145/3360550","index":452},"https://doi.org/10.1145/3360551":{"title":"Ariya Shajii, Ibrahim Numanagic, Riyadh Baghdadi, Bonnie Berger, Saman P. Amarasinghe: Seq: a high-performance language for bioinformatics. 125:1-125:29","address":"https://doi.org/10.1145/3360551","index":453},"https://doi.org/10.1145/3360552":{"title":"Guannan Wei, Yuxuan Chen, Tiark Rompf: Staged abstract interpreters: fast and modular whole-program analysis via meta-programming. 126:1-126:32","address":"https://doi.org/10.1145/3360552","index":454},"https://doi.org/10.1145/3360553":{"title":"Ian Henriksen, Gianfranco Bilardi, Keshav Pingali: Derivative grammars: a symbolic approach to parsing with derivatives. 127:1-127:28","address":"https://doi.org/10.1145/3360553","index":455},"https://doi.org/10.1145/3360554":{"title":"Yoav Zuriel, Michal Friedman, Gali Sheffi, Nachshon Cohen, Erez Petrank: Efficient lock-free durable sets. 128:1-128:26","address":"https://doi.org/10.1145/3360554","index":456},"https://doi.org/10.1145/3360555":{"title":"Mingzhang Huang, Hongfei Fu, Krishnendu Chatterjee, Amir Kafshdar Goharshady: Modular verification for almost-sure termination of probabilistic programs. 129:1-129:29","address":"https://doi.org/10.1145/3360555","index":457},"https://doi.org/10.1145/3360556":{"title":"Yu-Ping Wang, Xu-Qiang Hu, Zi-Xin Zou, Wende Tan, Gang Tan: IVT: an efficient method for sharing subtype polymorphic objects. 130:1-130:22","address":"https://doi.org/10.1145/3360556","index":458},"https://doi.org/10.1145/3360557":{"title":"Luís Caires, Bernardo Toninho: Refinement kinds: type-safe programming with practical type-level computation. 131:1-131:30","address":"https://doi.org/10.1145/3360557","index":459},"https://doi.org/10.1145/3360558":{"title":"Benjamin Mariano, Josh Reese, Siyuan Xu, ThanhVu Nguyen, Xiaokang Qiu, Jeffrey S. Foster, Armando Solar-Lezama: Program synthesis with algebraic library specifications. 132:1-132:25","address":"https://doi.org/10.1145/3360558","index":460},"https://doi.org/10.1145/3360559":{"title":"Conrad Watt, Andreas Rossberg, Jean Pichon-Pharabod: Weakening WebAssembly. 133:1-133:28","address":"https://doi.org/10.1145/3360559","index":461},"https://doi.org/10.1145/3360560":{"title":"Tetsuro Yamazaki, Tomoki Nakamaru, Kazuhiro Ichikawa, Shigeru Chiba: Generating a fluent API with syntax checking from an LR grammar. 134:1-134:24","address":"https://doi.org/10.1145/3360560","index":462},"https://doi.org/10.1145/3360561":{"title":"Azalea Raad, John Wickerson, Viktor Vafeiadis: Weak persistency semantics from the ground up: formalising the persistency semantics of ARMv8 and transactional models. 135:1-135:27","address":"https://doi.org/10.1145/3360561","index":463},"https://doi.org/10.1145/3360562":{"title":"Vilhelm Sjöberg, Yuyang Sang, Shu-Chun Weng, Zhong Shao: DeepSEA: a language for certified system software. 136:1-136:27","address":"https://doi.org/10.1145/3360562","index":464},"https://doi.org/10.1145/3360563":{"title":"Zhuo Zhang, Wei You, Guanhong Tao, Guannan Wei, Yonghwi Kwon, Xiangyu Zhang: BDA: practical dependence analysis for binary executables by unbiased whole-program path sampling and per-path abstract interpretation. 137:1-137:31","address":"https://doi.org/10.1145/3360563","index":465},"https://doi.org/10.1145/3360564":{"title":"Ivana Vukotic, Vincent Rahli, Paulo Jorge Esteves Veríssimo: Asphalion: trustworthy shielding against Byzantine faults. 138:1-138:32","address":"https://doi.org/10.1145/3360564","index":466},"https://doi.org/10.1145/3360565":{"title":"Rong Pan, Qinheping Hu, Gaowei Xu, Loris D'Antoni: Automatic repair of regular expressions. 139:1-139:29","address":"https://doi.org/10.1145/3360565","index":467},"https://doi.org/10.1145/3360566":{"title":"Benno Stein, Benjamin Barslev Nielsen, Bor-Yuh Evan Chang, Anders Møller: Static analysis with demand-driven value refinement. 140:1-140:29","address":"https://doi.org/10.1145/3360566","index":468},"https://doi.org/10.1145/3360567":{"title":"Jia Chen, Jiayi Wei, Yu Feng, Osbert Bastani, Isil Dillig: Relational verification using reinforcement learning. 141:1-141:30","address":"https://doi.org/10.1145/3360567","index":469},"https://doi.org/10.1145/3360568":{"title":"John Bender, Jens Palsberg: A formalization of Java's concurrent access modes. 142:1-142:28","address":"https://doi.org/10.1145/3360568","index":470},"https://doi.org/10.1145/3360569":{"title":"Anders Miltner, Sumit Gulwani, Vu Le, Alan Leung, Arjun Radhakrishna, Gustavo Soares, Ashish Tiwari, Abhishek Udupa: On the fly synthesis of edit suggestions. 143:1-143:29","address":"https://doi.org/10.1145/3360569","index":471},"https://doi.org/10.1145/3360570":{"title":"Ragnar Mogk, Joscha Drechsler, Guido Salvaneschi, Mira Mezini: A fault-tolerant programming model for distributed interactive applications. 144:1-144:29","address":"https://doi.org/10.1145/3360570","index":472},"https://doi.org/10.1145/3360571":{"title":"Marianna Rapoport, Ondrej Lhoták: A path to DOT: formalizing fully path-dependent types. 145:1-145:29","address":"https://doi.org/10.1145/3360571","index":473},"https://doi.org/10.1145/3360572":{"title":"Théophile Bastian, Stephen Kell, Francesco Zappa Nardelli: Reliable and fast DWARF-based stack unwinding. 146:1-146:24","address":"https://doi.org/10.1145/3360572","index":474},"https://doi.org/10.1145/3360573":{"title":"Vytautas Astrauskas, Peter Müller, Federico Poli, Alexander J. Summers: Leveraging rust types for modular specification and verification. 147:1-147:30","address":"https://doi.org/10.1145/3360573","index":475},"https://doi.org/10.1145/3360574":{"title":"Jingbo Lu, Jingling Xue: Precision-preserving yet fast object-sensitive pointer analysis with partial context sensitivity. 148:1-148:29","address":"https://doi.org/10.1145/3360574","index":476},"https://doi.org/10.1145/3360575":{"title":"Abhinav Jangda, Donald Pinckney, Yuriy Brun, Arjun Guha: Formal foundations of serverless computing. 149:1-149:26","address":"https://doi.org/10.1145/3360575","index":477},"https://doi.org/10.1145/3360576":{"title":"Parosh Aziz Abdulla, Mohamed Faouzi Atig, Bengt Jonsson, Magnus Lång, Tuan Phong Ngo, Konstantinos Sagonas: Optimal stateless model checking for reads-from equivalence under sequential consistency. 150:1-150:29","address":"https://doi.org/10.1145/3360576","index":478},"https://doi.org/10.1145/3360577":{"title":"Pavel Panchekha, Michael D. Ernst, Zachary Tatlock, Shoaib Kamil: Modular verification of web page layout. 151:1-151:26","address":"https://doi.org/10.1145/3360577","index":479},"https://doi.org/10.1145/3360578":{"title":"Sifei Luan, Di Yang, Celeste Barnaby, Koushik Sen, Satish Chandra: Aroma: code recommendation via structural code search. 152:1-152:28","address":"https://doi.org/10.1145/3360578","index":480},"https://doi.org/10.1145/3360579":{"title":"Aviral Goel, Jan Vitek: On the design, implementation, and use of laziness in R. 153:1-153:27","address":"https://doi.org/10.1145/3360579","index":481},"https://doi.org/10.1145/3360580":{"title":"Gowtham Kaki, Swarn Priya, K. C. Sivaramakrishnan, Suresh Jagannathan: Mergeable replicated data types. 154:1-154:29","address":"https://doi.org/10.1145/3360580","index":482},"https://doi.org/10.1145/3360581":{"title":"Michaël Marcozzi, Qiyi Tang, Alastair F. Donaldson, Cristian Cadar: Compiler fuzzing: how much does it matter? 155:1-155:29","address":"https://doi.org/10.1145/3360581","index":483},"https://doi.org/10.1145/3360582":{"title":"Zachary Benavides, Keval Vora, Rajiv Gupta: DProf: distributed profiler with strong guarantees. 156:1-156:24","address":"https://doi.org/10.1145/3360582","index":484},"https://doi.org/10.1145/3360583":{"title":"Grégory M. Essertel, Guannan Wei, Tiark Rompf: Precise reasoning with structured time, structured heaps, and collective operations. 157:1-157:30","address":"https://doi.org/10.1145/3360583","index":485},"https://doi.org/10.1145/3360584":{"title":"Luis Mastrangelo, Matthias Hauswirth, Nathaniel Nystrom: Casting about in the dark: an empirical study of cast operations in Java programs. 158:1-158:31","address":"https://doi.org/10.1145/3360584","index":486},"https://doi.org/10.1145/3360585":{"title":"Johannes Bader, Andrew Scott, Michael Pradel, Satish Chandra: Getafix: learning to fix bugs automatically. 159:1-159:27","address":"https://doi.org/10.1145/3360585","index":487},"https://doi.org/10.1145/3360586":{"title":"Baijun Wu, John Peter Campora III, Yi He, Alexander Schlecht, Sheng Chen: Generating precise error specifications for C: a zero shot learning approach. 160:1-160:30","address":"https://doi.org/10.1145/3360586","index":488},"https://doi.org/10.1145/3360587":{"title":"Aleksandar Nanevski, Anindya Banerjee, Germán Andrés Delbianco, Ignacio Fábregas: Specifying concurrent programs in separation logic: morphisms and simulations. 161:1-161:30","address":"https://doi.org/10.1145/3360587","index":489},"https://doi.org/10.1145/3360588":{"title":"Yi Li, Shaohua Wang, Tien N. Nguyen, Son Van Nguyen: Improving bug detection via context-based code representation learning and attention-based neural networks. 162:1-162:30","address":"https://doi.org/10.1145/3360588","index":490},"https://doi.org/10.1145/3360589":{"title":"Filip Krikava, Heather Miller, Jan Vitek: Scala implicits are everywhere: a large-scale study of the use of Scala implicits in the wild. 163:1-163:28","address":"https://doi.org/10.1145/3360589","index":491},"https://doi.org/10.1145/3360590":{"title":"Rajkishore Barik, Manu Sridharan, Murali Krishna Ramanathan, Milind Chabbi: Optimization of swift protocols. 164:1-164:27","address":"https://doi.org/10.1145/3360590","index":492},"https://doi.org/10.1145/3360591":{"title":"Ranadeep Biswas, Constantin Enea: On the complexity of checking transactional consistency. 165:1-165:28","address":"https://doi.org/10.1145/3360591","index":493},"https://doi.org/10.1145/3360592":{"title":"Jad Hamza, Nicolas Voirol, Viktor Kuncak: System FR: formalized foundations for the stainless verifier. 166:1-166:30","address":"https://doi.org/10.1145/3360592","index":494},"https://doi.org/10.1145/3360593":{"title":"Guido Salvaneschi, Mirko Köhler, Daniel Sokolowski, Philipp Haller, Sebastian Erdweg, Mira Mezini: Language-integrated privacy-aware distributed queries. 167:1-167:30","address":"https://doi.org/10.1145/3360593","index":495},"https://doi.org/10.1145/3360594":{"title":"Rohan Bavishi, Caroline Lemieux, Roy Fox, Koushik Sen, Ion Stoica: AutoPandas: neural-backed generators for program synthesis. 168:1-168:27","address":"https://doi.org/10.1145/3360594","index":496},"https://doi.org/10.1145/3360595":{"title":"Ulf Adams: Ryū revisited: printf floating point conversion. 169:1-169:23","address":"https://doi.org/10.1145/3360595","index":497},"https://doi.org/10.1145/3360596":{"title":"Bo Shen, Wei Zhang, Haiyan Zhao, Guangtai Liang, Zhi Jin, Qianxiang Wang: IntelliMerge: a refactoring-aware software merging technique. 170:1-170:28","address":"https://doi.org/10.1145/3360596","index":498},"https://doi.org/10.1145/3360597":{"title":"Shengyi Wang, Qinxiang Cao, Anshuman Mohan, Aquinas Hobor: Certifying graph-manipulating C programs via localizations within data structures. 171:1-171:30","address":"https://doi.org/10.1145/3360597","index":499},"https://doi.org/10.1145/3360598":{"title":"Joseph P. Near, David Darais, Chike Abuah, Tim Stevens, Pranav Gaddamadugu, Lun Wang, Neel Somani, Mu Zhang, Nikhil Sharma, Alex Shan, Dawn Song: Duet: an expressive higher-order language and linear type system for statically enforcing differential privacy. 172:1-172:30","address":"https://doi.org/10.1145/3360598","index":500},"https://doi.org/10.1145/3360599":{"title":"Michalis Kokologiannakis, Azalea Raad, Viktor Vafeiadis: Effective lock handling in stateless model checking. 173:1-173:26","address":"https://doi.org/10.1145/3360599","index":501},"https://doi.org/10.1145/3360600":{"title":"Rohan Padhye, Caroline Lemieux, Koushik Sen, Laurent Simon, Hayawardh Vijayakumar: FuzzFactory: domain-specific fuzzing with waypoints. 174:1-174:29","address":"https://doi.org/10.1145/3360600","index":502},"https://doi.org/10.1145/3360601":{"title":"José Pablo Cambronero, Martin C. Rinard: AL: autogenerating supervised learning programs. 175:1-175:28","address":"https://doi.org/10.1145/3360601","index":503},"https://doi.org/10.1145/3360602":{"title":"Sven Keidel, Sebastian Erdweg: Sound and reusable components for abstract interpretation. 176:1-176:28","address":"https://doi.org/10.1145/3360602","index":504},"https://doi.org/10.1145/3360603":{"title":"Ahmet Çelik, Pengyu Nie, Christopher J. Rossbach, Milos Gligoric: Design, implementation, and application of GPU-based Java bytecode interpreters. 177:1-177:28","address":"https://doi.org/10.1145/3360603","index":505},"https://doi.org/10.1145/3360604":{"title":"Timos Antonopoulos, Eric Koskinen, Ton Chanh Le: Specification and inference of trace refinement relations. 178:1-178:30","address":"https://doi.org/10.1145/3360604","index":506},"https://doi.org/10.1145/3360605":{"title":"Kaan Genç, Jake Roemer, Yufan Xu, Michael D. Bond: Dependence-aware, unbounded sound predictive race detection. 179:1-179:30","address":"https://doi.org/10.1145/3360605","index":507},"https://doi.org/10.1145/3360606":{"title":"Burcu Kulahcioglu Ozkan, Rupak Majumdar, Simin Oraee: Trace aware random testing for distributed systems. 180:1-180:29","address":"https://doi.org/10.1145/3360606","index":508},"https://doi.org/10.1145/3360607":{"title":"Leonidas Lampropoulos, Michael Hicks, Benjamin C. Pierce: Coverage guided, property based testing. 181:1-181:29","address":"https://doi.org/10.1145/3360607","index":509},"https://doi.org/10.1145/3360608":{"title":"Emma Tosch, Eytan Bakshy, Emery D. Berger, David D. Jensen, J. Eliot B. Moss: PlanAlyzer: assessing threats to the validity of online experiments. 182:1-182:30","address":"https://doi.org/10.1145/3360608","index":510},"https://doi.org/10.1145/3360609":{"title":"Milijana Surbatovich, Limin Jia, Brandon Lucia: I/O dependent idempotence bugs in intermittent systems. 183:1-183:31","address":"https://doi.org/10.1145/3360609","index":511},"https://doi.org/10.1145/3360610":{"title":"Christian Wimmer, Codrut Stancu, Peter Hofer, Vojin Jovanovic, Paul Wögerer, Peter B. Kessler, Oleg Pliss, Thomas Würthinger: Initialize once, start fast: application initialization at build time. 184:1-184:29","address":"https://doi.org/10.1145/3360610","index":512},"https://doi.org/10.1145/3360611":{"title":"Ilya Sergey, Vaivaswatha Nagaraj, Jacob Johannsen, Amrit Kumar, Anton Trunov, Ken Chan Guan Hao: Safer smart contract programming with Scilla. 185:1-185:30","address":"https://doi.org/10.1145/3360611","index":513},"https://doi.org/10.1145/3360612":{"title":"Hashim Sharif, Prakalp Srivastava, Muhammad Huzaifa, Maria Kotsifakou, Keyur Joshi, Yasmin Sarita, Nathan Zhao, Vikram S. Adve, Sasa Misailovic, Sarita V. Adve: ApproxHPVM: a portable compiler IR for accuracy-aware optimizations. 186:1-186:30","address":"https://doi.org/10.1145/3360612","index":514},"https://doi.org/10.1145/3360613":{"title":"August Shi, Milica Hadzi-Tanovic, Lingming Zhang, Darko Marinov, Owolabi Legunsen: Reflection-aware static regression test selection. 187:1-187:29","address":"https://doi.org/10.1145/3360613","index":515},"https://doi.org/10.1145/3360614":{"title":"Dowon Song, Myungho Lee, Hakjoo Oh: Automatic and scalable detection of logical errors in functional programming assignments. 188:1-188:30","address":"https://doi.org/10.1145/3360614","index":516},"https://doi.org/10.1145/3360615":{"title":"Shuai Wang, Chengyu Zhang, Zhendong Su: Detecting nondeterministic payment bugs in Ethereum smart contracts. 189:1-189:29","address":"https://doi.org/10.1145/3360615","index":517},"https://doi.org/10.1145/3158089":{"title":"Anders Miltner, Kathleen Fisher, Benjamin C. Pierce, David Walker, Steve Zdancewic: Synthesizing bijective lenses. 1:1-1:30","address":"https://doi.org/10.1145/3158089","index":518},"https://doi.org/10.1145/3158090":{"title":"Jeevana Priya Inala, Rishabh Singh: WebRelate: integrating web data with spreadsheets using examples. 2:1-2:28","address":"https://doi.org/10.1145/3158090","index":519},"https://doi.org/10.1145/3158091":{"title":"Taolue Chen, Yan Chen, Matthew Hague, Anthony W. Lin, Zhilin Wu: What is decidable about string constraints with the ReplaceAll function. 3:1-3:29","address":"https://doi.org/10.1145/3158091","index":520},"https://doi.org/10.1145/3158092":{"title":"Lukás Holík, Petr Janku, Anthony W. Lin, Philipp Rümmer, Tomás Vojnar: String constraints with concatenation and transducers solved efficiently. 4:1-4:32","address":"https://doi.org/10.1145/3158092","index":521},"https://doi.org/10.1145/3158093":{"title":"Jean-Philippe Bernardy, Mathieu Boespflug, Ryan R. Newton, Simon Peyton Jones, Arnaud Spiwack: Linear Haskell: practical linearity in a higher-order polymorphic language. 5:1-5:29","address":"https://doi.org/10.1145/3158093","index":522},"https://doi.org/10.1145/3158094":{"title":"Damiano Mazza, Luc Pellissier, Pierre Vial: Polyadic approximations, fibrations and intersection types. 6:1-6:28","address":"https://doi.org/10.1145/3158094","index":523},"https://doi.org/10.1145/3158095":{"title":"Danel Ahman: Handling fibred algebraic effects. 7:1-7:29","address":"https://doi.org/10.1145/3158095","index":524},"https://doi.org/10.1145/3158096":{"title":"Dariusz Biernacki, Maciej Piróg, Piotr Polesiuk, Filip Sieczkowski: Handle with care: relational interpretation of algebraic effects and handlers. 8:1-8:30","address":"https://doi.org/10.1145/3158096","index":525},"https://doi.org/10.1145/3158097":{"title":"Quang-Trung Ta, Ton Chanh Le, Siau-Cheng Khoo, Wei-Ngan Chin: Automated lemma synthesis in symbolic-heap separation logic. 9:1-9:29","address":"https://doi.org/10.1145/3158097","index":526},"https://doi.org/10.1145/3158098":{"title":"Christof Löding, P. Madhusudan, Lucas Peña: Foundations for natural proofs and quantifier instantiation. 10:1-10:30","address":"https://doi.org/10.1145/3158098","index":527},"https://doi.org/10.1145/3158099":{"title":"Toby Cathcart Burn, C.-H. Luke Ong, Steven J. Ramsay: Higher-order constrained horn clauses for verification. 11:1-11:28","address":"https://doi.org/10.1145/3158099","index":528},"https://doi.org/10.1145/3158100":{"title":"Hiroshi Unno, Yuki Satake, Tachio Terauchi: Relatively complete refinement type system for verification of higher-order non-deterministic programs. 12:1-12:29","address":"https://doi.org/10.1145/3158100","index":529},"https://doi.org/10.1145/3158101":{"title":"Lionel Parreaux, Antoine Voizard, Amir Shaikhha, Christoph E. Koch: Unifying analytic and statically-typed quasiquotes. 13:1-13:33","address":"https://doi.org/10.1145/3158101","index":530},"https://doi.org/10.1145/3158102":{"title":"Matt Brown, Jens Palsberg: Jones-optimal partial evaluation by specialization-safe normalization. 14:1-14:28","address":"https://doi.org/10.1145/3158102","index":531},"https://doi.org/10.1145/3158103":{"title":"John Peter Campora III, Sheng Chen, Martin Erwig, Eric Walkingshaw: Migrating gradual types. 15:1-15:29","address":"https://doi.org/10.1145/3158103","index":532},"https://doi.org/10.1145/3158104":{"title":"Casper Bach Poulsen, Arjen Rouvoet, Andrew Tolmach, Robbert Krebbers, Eelco Visser: Intrinsically-typed definitional interpreters for imperative languages. 16:1-16:34","address":"https://doi.org/10.1145/3158104","index":533},"https://doi.org/10.1145/3158105":{"title":"Michalis Kokologiannakis, Ori Lahav, Konstantinos Sagonas, Viktor Vafeiadis: Effective stateless model checking for C/C++ concurrency. 17:1-17:32","address":"https://doi.org/10.1145/3158105","index":534},"https://doi.org/10.1145/3158106":{"title":"Brijesh Dongol, Radha Jagadeesan, James Riely: Transactions in relaxed memory architectures. 18:1-18:29","address":"https://doi.org/10.1145/3158106","index":535},"https://doi.org/10.1145/3158107":{"title":"Christopher Pulte, Shaked Flur, Will Deacon, Jon French, Susmit Sarkar, Peter Sewell: Simplifying ARM concurrency: multicopy-atomic axiomatic and operational models for ARMv8. 19:1-19:29","address":"https://doi.org/10.1145/3158107","index":536},"https://doi.org/10.1145/3158108":{"title":"Hongjin Liang, Xinyu Feng: Progress of concurrent objects with partial methods. 20:1-20:31","address":"https://doi.org/10.1145/3158108","index":537},"https://doi.org/10.1145/3158109":{"title":"Thomas Williams, Didier Rémy: A principled approach to ornamentation in ML. 21:1-21:30","address":"https://doi.org/10.1145/3158109","index":538},"https://doi.org/10.1145/3158110":{"title":"William J. Bowman, Youyou Cong, Nick Rioux, Amal Ahmed: Type-preserving CPS translation of Σ and Π types is not not possible. 22:1-22:33","address":"https://doi.org/10.1145/3158110","index":539},"https://doi.org/10.1145/3158111":{"title":"Andreas Abel, Joakim Öhman, Andrea Vezzosi: Decidability of conversion for type theory in type theory. 23:1-23:29","address":"https://doi.org/10.1145/3158111","index":540},"https://doi.org/10.1145/3158112":{"title":"Ondrej Kuncar, Andrei Popescu: Safety and conservativity of definitions in HOL and Isabelle/HOL. 24:1-24:26","address":"https://doi.org/10.1145/3158112","index":541},"https://doi.org/10.1145/3158113":{"title":"Michael Emmi, Constantin Enea: Sound, complete, and tractable linearizability monitoring for concurrent collections. 25:1-25:27","address":"https://doi.org/10.1145/3158113","index":542},"https://doi.org/10.1145/3158114":{"title":"Oded Padon, Jochen Hoenicke, Giuliano Losa, Andreas Podelski, Mooly Sagiv, Sharon Shoham: Reducing liveness to safety in first-order logic. 26:1-26:33","address":"https://doi.org/10.1145/3158114","index":543},"https://doi.org/10.1145/3158115":{"title":"Gowtham Kaki, Kartik Nagar, Mahsa Najafzadeh, Suresh Jagannathan: Alone together: compositional reasoning and inference for weak isolation. 27:1-27:34","address":"https://doi.org/10.1145/3158115","index":544},"https://doi.org/10.1145/3158116":{"title":"Ilya Sergey, James R. Wilcox, Zachary Tatlock: Programming and proving with distributed protocols. 28:1-28:30","address":"https://doi.org/10.1145/3158116","index":545},"https://doi.org/10.1145/3158117":{"title":"Leandro T. C. Melo, Rodrigo Geraldo Ribeiro, Marcus R. de Araújo, Fernando Magno Quintão Pereira: Inference of static semantics for incomplete C programs. 29:1-29:28","address":"https://doi.org/10.1145/3158117","index":546},"https://doi.org/10.1145/3158118":{"title":"Krishnendu Chatterjee, Bhavya Choudhary, Andreas Pavlogiannis: Optimal Dyck reachability for data-dependence and alias analysis. 30:1-30:30","address":"https://doi.org/10.1145/3158118","index":547},"https://doi.org/10.1145/3158119":{"title":"Marek Chalupa, Krishnendu Chatterjee, Andreas Pavlogiannis, Nishant Sinha, Kapil Vaidya: Data-centric dynamic partial order reduction. 31:1-31:30","address":"https://doi.org/10.1145/3158119","index":548},"https://doi.org/10.1145/3158120":{"title":"Wenlei Bao, Sriram Krishnamoorthy, Louis-Noël Pouchet, P. Sadayappan: Analytical modeling of cache behavior for affine programs. 32:1-32:26","address":"https://doi.org/10.1145/3158120","index":549},"https://doi.org/10.1145/3158121":{"title":"Annabelle McIver, Carroll Morgan, Benjamin Lucien Kaminski, Joost-Pieter Katoen: A new proof rule for almost-sure termination. 33:1-33:28","address":"https://doi.org/10.1145/3158121","index":550},"https://doi.org/10.1145/3158122":{"title":"Sheshansh Agrawal, Krishnendu Chatterjee, Petr Novotný: Lexicographic ranking supermartingales: an efficient approach to termination of probabilistic programs. 34:1-34:32","address":"https://doi.org/10.1145/3158122","index":551},"https://doi.org/10.1145/3158123":{"title":"Yangjia Li, Mingsheng Ying: Algorithmic analysis of termination problems for quantum programs. 35:1-35:29","address":"https://doi.org/10.1145/3158123","index":552},"https://doi.org/10.1145/3158124":{"title":"Ivan Radicek, Gilles Barthe, Marco Gaboardi, Deepak Garg, Florian Zuleger: Monadic refinements for relational cost analysis. 36:1-36:32","address":"https://doi.org/10.1145/3158124","index":553},"https://doi.org/10.1145/3158125":{"title":"Siddharth Krishna, Dennis E. Shasha, Thomas Wies: Go with the flow: compositional abstractions for concurrent data structures. 37:1-37:31","address":"https://doi.org/10.1145/3158125","index":554},"https://doi.org/10.1145/3158126":{"title":"Dominique Devriese, Marco Patrignani, Frank Piessens: Parametricity versus the universal type. 38:1-38:23","address":"https://doi.org/10.1145/3158126","index":555},"https://doi.org/10.1145/3158127":{"title":"Pierre Clairambault, Charles Grellois, Andrzej S. Murawski: Linearity in higher-order recursion schemes. 39:1-39:29","address":"https://doi.org/10.1145/3158127","index":556},"https://doi.org/10.1145/3158128":{"title":"Stephen Chang, Alex Knauth, Emina Torlak: Symbolic types for lenient symbolic execution. 40:1-40:29","address":"https://doi.org/10.1145/3158128","index":557},"https://doi.org/10.1145/3158129":{"title":"Hsiang-Shang Ko, Zhenjiang Hu: An axiomatic basis for bidirectional programming. 41:1-41:29","address":"https://doi.org/10.1145/3158129","index":558},"https://doi.org/10.1145/3158130":{"title":"Martin Odersky, Olivier Blanvillain, Fengyun Liu, Aggelos Biboudis, Heather Miller, Sandro Stucki: Simplicitly: foundations and applications of implicit function types. 42:1-42:29","address":"https://doi.org/10.1145/3158130","index":559},"https://doi.org/10.1145/3158131":{"title":"Nils Anders Danielsson: Up-to techniques using sized types. 43:1-43:28","address":"https://doi.org/10.1145/3158131","index":560},"https://doi.org/10.1145/3158132":{"title":"Paolo Capriotti, Nicolai Kraus: Univalent higher categories via complete Semi-Segal types. 44:1-44:29","address":"https://doi.org/10.1145/3158132","index":561},"https://doi.org/10.1145/3158133":{"title":"Leonidas Lampropoulos, Zoe Paraskevopoulou, Benjamin C. Pierce: Generating good generators for inductive relations. 45:1-45:30","address":"https://doi.org/10.1145/3158133","index":562},"https://doi.org/10.1145/3158134":{"title":"Rupak Majumdar, Filip Niksic: Why is random testing effective for partition tolerance bugs? 46:1-46:24","address":"https://doi.org/10.1145/3158134","index":563},"https://doi.org/10.1145/3158135":{"title":"Wonyeol Lee, Rahul Sharma, Alex Aiken: On automatically proving the correctness of math.h implementations. 47:1-47:32","address":"https://doi.org/10.1145/3158135","index":564},"https://doi.org/10.1145/3158136":{"title":"Shelly Grossman, Ittai Abraham, Guy Golan-Gueta, Yan Michalevsky, Noam Rinetzky, Mooly Sagiv, Yoni Zohar: Online detection of effectively callback free objects with applications to smart contracts. 48:1-48:28","address":"https://doi.org/10.1145/3158136","index":565},"https://doi.org/10.1145/3158137":{"title":"Olivier Flückiger, Gabriel Scherer, Ming-Ho Yee, Aviral Goel, Amal Ahmed, Jan Vitek: Correctness of speculative optimizations with dynamic deoptimization. 49:1-49:28","address":"https://doi.org/10.1145/3158137","index":566},"https://doi.org/10.1145/3158138":{"title":"José Fragoso Santos, Petar Maksimovic, Daiva Naudziuniene, Thomas Wood, Philippa Gardner: JaVerT: JavaScript verification toolchain. 50:1-50:33","address":"https://doi.org/10.1145/3158138","index":567},"https://doi.org/10.1145/3158139":{"title":"Phuc C. Nguyen, Thomas Gilray, Sam Tobin-Hochstadt, David Van Horn: Soft contract verification for higher-order stateful programs. 51:1-51:30","address":"https://doi.org/10.1145/3158139","index":568},"https://doi.org/10.1145/3158140":{"title":"Nada Amin, Tiark Rompf: Collapsing towers of interpreters. 52:1-52:33","address":"https://doi.org/10.1145/3158140","index":569},"https://doi.org/10.1145/3158141":{"title":"Niki Vazou, Anish Tondwalkar, Vikraman Choudhury, Ryan G. Scott, Ryan R. Newton, Philip Wadler, Ranjit Jhala: Refinement reflection: complete verification with SMT. 53:1-53:31","address":"https://doi.org/10.1145/3158141","index":570},"https://doi.org/10.1145/3158142":{"title":"Zachary Kincaid, John Cyphert, Jason Breck, Thomas W. Reps: Non-linear reasoning for invariant synthesis. 54:1-54:33","address":"https://doi.org/10.1145/3158142","index":571},"https://doi.org/10.1145/3158143":{"title":"Gagandeep Singh, Markus Püschel, Martin T. Vechev: A practical construction for decomposing numerical abstract domains. 55:1-55:28","address":"https://doi.org/10.1145/3158143","index":572},"https://doi.org/10.1145/3158144":{"title":"Yuepeng Wang, Isil Dillig, Shuvendu K. Lahiri, William R. Cook: Verifying equivalence of database-driven applications. 56:1-56:29","address":"https://doi.org/10.1145/3158144","index":573},"https://doi.org/10.1145/3158145":{"title":"Gilles Barthe, Thomas Espitau, Benjamin Grégoire, Justin Hsu, Pierre-Yves Strub: Proving expected sensitivity of probabilistic programs. 57:1-57:29","address":"https://doi.org/10.1145/3158145","index":574},"https://doi.org/10.1145/3158146":{"title":"Aws Albarghouthi, Justin Hsu: Synthesizing coupling proofs of differential privacy. 58:1-58:30","address":"https://doi.org/10.1145/3158146","index":575},"https://doi.org/10.1145/3158147":{"title":"Thomas Ehrhard, Michele Pagani, Christine Tasson: Measurable cones and stable, measurable functions: a model for probabilistic higher-order programming. 59:1-59:28","address":"https://doi.org/10.1145/3158147","index":576},"https://doi.org/10.1145/3158148":{"title":"Adam Scibior, Ohad Kammar, Matthijs Vákár, Sam Staton, Hongseok Yang, Yufei Cai, Klaus Ostermann, Sean K. Moss, Chris Heunen, Zoubin Ghahramani: Denotational validation of higher-order Bayesian inference. 60:1-60:29","address":"https://doi.org/10.1145/3158148","index":577},"https://doi.org/10.1145/3158149":{"title":"Azadeh Farzan, Zachary Kincaid: Strategy synthesis for linear arithmetic games. 61:1-61:30","address":"https://doi.org/10.1145/3158149","index":578},"https://doi.org/10.1145/3158150":{"title":"Kartik Chandra, Rastislav Bodík: Bonsai: synthesis-based reasoning for type systems. 62:1-62:34","address":"https://doi.org/10.1145/3158150","index":579},"https://doi.org/10.1145/3158151":{"title":"Xinyu Wang, Isil Dillig, Rishabh Singh: Program synthesis using abstraction refinement. 63:1-63:30","address":"https://doi.org/10.1145/3158151","index":580},"https://doi.org/10.1145/3158152":{"title":"Amin Timany, Léo Stefanesco, Morten Krogh-Jespersen, Lars Birkedal: A logical relation for monadic encapsulation of state: proving contextual equivalences in the presence of runST. 64:1-64:28","address":"https://doi.org/10.1145/3158152","index":581},"https://doi.org/10.1145/3158153":{"title":"Danel Ahman, Cédric Fournet, Catalin Hritcu, Kenji Maillard, Aseem Rastogi, Nikhil Swamy: Recalling a witness: foundations and applications of monotonic state. 65:1-65:30","address":"https://doi.org/10.1145/3158153","index":582},"https://doi.org/10.1145/3158154":{"title":"Ralf Jung, Jacques-Henri Jourdan, Robbert Krebbers, Derek Dreyer: RustBelt: securing the foundations of the rust programming language. 66:1-66:34","address":"https://doi.org/10.1145/3158154","index":583},"https://doi.org/10.1145/3236762":{"title":"Oliver Bracevac, Nada Amin, Guido Salvaneschi, Sebastian Erdweg, Patrick Eugster, Mira Mezini: Versatile event correlation with algebraic effects. 67:1-67:31","address":"https://doi.org/10.1145/3236762","index":584},"https://doi.org/10.1145/3236763":{"title":"Jennifer Hackett, Graham Hutton: Parametric polymorphism and operational improvement. 68:1-68:24","address":"https://doi.org/10.1145/3236763","index":585},"https://doi.org/10.1145/3236764":{"title":"Youyou Cong, Kenichi Asai: Handling delimited continuations with dependent types. 69:1-69:31","address":"https://doi.org/10.1145/3236764","index":586},"https://doi.org/10.1145/3236765":{"title":"Conal Elliott: The simple essence of automatic differentiation. 70:1-70:29","address":"https://doi.org/10.1145/3236765","index":587},"https://doi.org/10.1145/3236766":{"title":"Ben Greenman, Matthias Felleisen: A spectrum of type soundness and performance. 71:1-71:32","address":"https://doi.org/10.1145/3236766","index":588},"https://doi.org/10.1145/3236767":{"title":"Sven Keidel, Casper Bach Poulsen, Sebastian Erdweg: Compositional soundness proofs of abstract interpreters. 72:1-72:26","address":"https://doi.org/10.1145/3236767","index":589},"https://doi.org/10.1145/3236768":{"title":"Max S. New, Amal Ahmed: Graduality from embedding-projection pairs. 73:1-73:30","address":"https://doi.org/10.1145/3236768","index":590},"https://doi.org/10.1145/3236769":{"title":"Rudi Horn, Roly Perera, James Cheney: Incremental relational lenses. 74:1-74:30","address":"https://doi.org/10.1145/3236769","index":591},"https://doi.org/10.1145/3236770":{"title":"Jesper Cockx, Andreas Abel: Elaborating dependent (co)pattern matching. 75:1-75:30","address":"https://doi.org/10.1145/3236770","index":592},"https://doi.org/10.1145/3236771":{"title":"James Koppel, Gabriel Scherer, Armando Solar-Lezama: Capturing the future by replaying the past (functional pearl). 76:1-76:29","address":"https://doi.org/10.1145/3236771","index":593},"https://doi.org/10.1145/3236772":{"title":"Robbert Krebbers, Jacques-Henri Jourdan, Ralf Jung, Joseph Tassarotti, Jan-Oliver Kaiser, Amin Timany, Arthur Charguéraud, Derek Dreyer: MoSeL: a general, extensible modal framework for interactive proofs in separation logic. 77:1-77:30","address":"https://doi.org/10.1145/3236772","index":594},"https://doi.org/10.1145/3236773":{"title":"Jan-Oliver Kaiser, Beta Ziliani, Robbert Krebbers, Yann Régis-Gianas, Derek Dreyer: Mtac2: typed tactics for backward reasoning in Coq. 78:1-78:31","address":"https://doi.org/10.1145/3236773","index":595},"https://doi.org/10.1145/3236774":{"title":"Andrey Mokhov, Neil Mitchell, Simon Peyton Jones: Build systems à la carte. 79:1-79:29","address":"https://doi.org/10.1145/3236774","index":596},"https://doi.org/10.1145/3236775":{"title":"Solomon Maina, Anders Miltner, Kathleen Fisher, Benjamin C. Pierce, David Walker, Steve Zdancewic: Synthesizing quotient lenses. 80:1-80:29","address":"https://doi.org/10.1145/3236775","index":597},"https://doi.org/10.1145/3236776":{"title":"Atsushi Ohori, Katsuhiro Ueno, Hisayuki Mima: Finitary polymorphism for optimizing type-directed compilation. 81:1-81:29","address":"https://doi.org/10.1145/3236776","index":598},"https://doi.org/10.1145/3236777":{"title":"José Bacelar Almeida, Alcino Cunha, Nuno Macedo, Hugo Pacheco, José Proença: Teaching how to program using automated assessment and functional glossy games (experience report). 82:1-82:17","address":"https://doi.org/10.1145/3236777","index":599},"https://doi.org/10.1145/3236778":{"title":"Adam Scibior, Ohad Kammar, Zoubin Ghahramani: Functional programming for modular Bayesian inference. 83:1-83:29","address":"https://doi.org/10.1145/3236778","index":600},"https://doi.org/10.1145/3236779":{"title":"Guillaume Boisseau, Jeremy Gibbons: What you needa know about Yoneda: profunctor optics and the Yoneda lemma (functional pearl). 84:1-84:27","address":"https://doi.org/10.1145/3236779","index":601},"https://doi.org/10.1145/3236780":{"title":"Csongor Kiss, Matthew Pickering, Nicolas Wu: Generic deriving of generic traversals. 85:1-85:30","address":"https://doi.org/10.1145/3236780","index":602},"https://doi.org/10.1145/3236781":{"title":"Jeremy Gibbons, Fritz Henglein, Ralf Hinze, Nicolas Wu: Relational algebra by way of adjunctions. 86:1-86:28","address":"https://doi.org/10.1145/3236781","index":603},"https://doi.org/10.1145/3236782":{"title":"Mitchell Wand, Ryan Culpepper, Theophilos Giannakopoulos, Andrew Cobb: Contextual equivalence for a probabilistic language with continuous random variables and recursion. 87:1-87:30","address":"https://doi.org/10.1145/3236782","index":604},"https://doi.org/10.1145/3236783":{"title":"Andrew K. Hirsch, Ross Tate: Strict and lazy semantics for effects: layering monads and comonads. 88:1-88:30","address":"https://doi.org/10.1145/3236783","index":605},"https://doi.org/10.1145/3236784":{"title":"Joachim Breitner, Antal Spector-Zabusky, Yao Li, Christine Rizkallah, John Wiegley, Stephanie Weirich: Ready, set, verify! applying hs-to-coq to real-world Haskell code (experience report). 89:1-89:16","address":"https://doi.org/10.1145/3236784","index":606},"https://doi.org/10.1145/3236785":{"title":"Guillaume Allais, Robert Atkey, James Chapman, Conor McBride, James McKinna: A type and scope safe universe of syntaxes with binding: their semantics and proofs. 90:1-90:30","address":"https://doi.org/10.1145/3236785","index":607},"https://doi.org/10.1145/3236786":{"title":"Ankush Das, Jan Hoffmann, Frank Pfenning: Parallel complexity analysis with temporal session types. 91:1-91:30","address":"https://doi.org/10.1145/3236786","index":608},"https://doi.org/10.1145/3236787":{"title":"Nicolas Tabareau, Éric Tanter, Matthieu Sozeau: Equivalences for free: univalent parametricity for effective transport. 92:1-92:29","address":"https://doi.org/10.1145/3236787","index":609},"https://doi.org/10.1145/3236788":{"title":"Antonis Stampoulis, Adam Chlipala: Prototyping a functional language using higher-order logic programming: a functional pearl on learning the ways of λProlog/Makam. 93:1-93:30","address":"https://doi.org/10.1145/3236788","index":610},"https://doi.org/10.1145/3236789":{"title":"Beniamino Accattoli, Stéphane Graham-Lengrand, Delia Kesner: Tight typings and split bounds. 94:1-94:30","address":"https://doi.org/10.1145/3236789","index":611},"https://doi.org/10.1145/3236790":{"title":"Stefan K. Muller, Umut A. Acar, Robert Harper: Competitive parallelism: getting your priorities right. 95:1-95:30","address":"https://doi.org/10.1145/3236790","index":612},"https://doi.org/10.1145/3236791":{"title":"Ivan Perez: Fault tolerant functional reactive programming (functional pearl). 96:1-96:30","address":"https://doi.org/10.1145/3236791","index":613},"https://doi.org/10.1145/3236792":{"title":"Martin Elsman, Troels Henriksen, Danil Annenkov, Cosmin E. Oancea: Static interpretation of higher-order modules in Futhark: functional GPU programming in the large. 97:1-97:30","address":"https://doi.org/10.1145/3236792","index":614},"https://doi.org/10.1145/3236793":{"title":"John Peter Campora III, Sheng Chen, Eric Walkingshaw: Casts and costs: harmonizing safety and performance in gradual typing. 98:1-98:30","address":"https://doi.org/10.1145/3236793","index":615},"https://doi.org/10.1145/3236794":{"title":"Chandrakana Nandi, James R. Wilcox, Pavel Panchekha, Taylor Blau, Dan Grossman, Zachary Tatlock: Functional programming for compiling and decompiling computer-aided design. 99:1-99:31","address":"https://doi.org/10.1145/3236794","index":616},"https://doi.org/10.1145/3236795":{"title":"Jeremy Yallop, Tamara von Glehn, Ohad Kammar: Partially-static data as free extension of algebras. 100:1-100:30","address":"https://doi.org/10.1145/3236795","index":617},"https://doi.org/10.1145/3236796":{"title":"Brent A. Yorgey, Kenneth Foner: What's the difference? a functional pearl on subtracting bijections. 101:1-101:21","address":"https://doi.org/10.1145/3236796","index":618},"https://doi.org/10.1145/3236797":{"title":"Kenneth Foner, Hengchu Zhang, Leonidas Lampropoulos: Keep your laziness in check. 102:1-102:30","address":"https://doi.org/10.1145/3236797","index":619},"https://doi.org/10.1145/3236798":{"title":"Frédéric Bour, Thomas Refis, Gabriel Scherer: Merlin: a language server for OCaml (experience report). 103:1-103:15","address":"https://doi.org/10.1145/3236798","index":620},"https://doi.org/10.1145/3236799":{"title":"Larry Diehl, Denis Firsov, Aaron Stump: Generic zero-cost reuse for dependent types. 104:1-104:30","address":"https://doi.org/10.1145/3236799","index":621},"https://doi.org/10.1145/3236800":{"title":"Guannan Wei, James M. Decker, Tiark Rompf: Refunctionalization of abstract abstract machines: bridging the gap between abstract abstract machines and abstract definitional interpreters (functional pearl). 105:1-105:28","address":"https://doi.org/10.1145/3236800","index":622},"https://doi.org/10.1145/3236801":{"title":"Cyrus Omar, Jonathan Aldrich: Reasonably programmable literal notation. 106:1-106:32","address":"https://doi.org/10.1145/3236801","index":623},"https://doi.org/10.1145/3276477":{"title":"Joscha Drechsler, Ragnar Mogk, Guido Salvaneschi, Mira Mezini: Thread-safe reactive programming. 107:1-107:30","address":"https://doi.org/10.1145/3276477","index":624},"https://doi.org/10.1145/3276478":{"title":"Benoit Daloze, Arie Tal, Stefan Marr, Hanspeter Mössenböck, Erez Petrank: Parallelization of dynamic languages: synchronizing built-in collections. 108:1-108:30","address":"https://doi.org/10.1145/3276478","index":625},"https://doi.org/10.1145/3276479":{"title":"Remigius Meier, Armin Rigo, Thomas R. Gross: Virtual machine design for parallel dynamic programming languages. 109:1-109:25","address":"https://doi.org/10.1145/3276479","index":626},"https://doi.org/10.1145/3276480":{"title":"Charith Mendis, Saman P. Amarasinghe: goSLP: globally optimized superword level parallelism framework. 110:1-110:28","address":"https://doi.org/10.1145/3276480","index":627},"https://doi.org/10.1145/3276481":{"title":"Jonathan Immanuel Brachthäuser, Philipp Schuster, Klaus Ostermann: Effect handlers for the masses. 111:1-111:27","address":"https://doi.org/10.1145/3276481","index":628},"https://doi.org/10.1145/3276482":{"title":"Fabian Muehlboeck, Ross Tate: Empowering union and intersection types with integrated subtyping. 112:1-112:29","address":"https://doi.org/10.1145/3276482","index":629},"https://doi.org/10.1145/3276483":{"title":"Francesco Zappa Nardelli, Julia Belyakova, Artem Pelenitsyn, Benjamin Chung, Jeff Bezanson, Jan Vitek: Julia subtyping: a rational reconstruction. 113:1-113:27","address":"https://doi.org/10.1145/3276483","index":630},"https://doi.org/10.1145/3276484":{"title":"Hendrik van Antwerpen, Casper Bach Poulsen, Arjen Rouvoet, Eelco Visser: Scopes as types. 114:1-114:30","address":"https://doi.org/10.1145/3276484","index":631},"https://doi.org/10.1145/3276485":{"title":"Peixuan Li, Danfeng Zhang: A derivation framework for dependent security label inference. 115:1-115:26","address":"https://doi.org/10.1145/3276485","index":632},"https://doi.org/10.1145/3276486":{"title":"Neville Grech, Michael Kong, Anton Jurisevic, Lexi Brent, Bernhard Scholz, Yannis Smaragdakis: MadMax: surviving out-of-gas conditions in Ethereum smart contracts. 116:1-116:27","address":"https://doi.org/10.1145/3276486","index":633},"https://doi.org/10.1145/3276487":{"title":"Chu-Pan Wong, Jens Meinicke, Lukas Lazarek, Christian Kästner: Faster variational execution with transparent bytecode transformation. 117:1-117:30","address":"https://doi.org/10.1145/3276487","index":634},"https://doi.org/10.1145/3276488":{"title":"Kalev Alpernas, Cormac Flanagan, Sadjad Fouladi, Leonid Ryzhyk, Mooly Sagiv, Thomas Schmitz, Keith Winstein: Secure serverless computing using dynamic information flow control. 118:1-118:26","address":"https://doi.org/10.1145/3276488","index":635},"https://doi.org/10.1145/3276489":{"title":"Roland Leißa, Klaas Boesche, Sebastian Hack, Arsène Pérard-Gayot, Richard Membarth, Philipp Slusallek, André Müller, Bertil Schmidt: AnyDSL: a partial evaluation framework for programming high-performance libraries. 119:1-119:30","address":"https://doi.org/10.1145/3276489","index":636},"https://doi.org/10.1145/3276490":{"title":"Jeff Bezanson, Jiahao Chen, Benjamin Chung, Stefan Karpinski, Viral B. Shah, Jan Vitek, Lionel Zoubritzky: Julia: dynamism and performance reconciled by design. 120:1-120:23","address":"https://doi.org/10.1145/3276490","index":637},"https://doi.org/10.1145/3276491":{"title":"Yunming Zhang, Mengjiao Yang, Riyadh Baghdadi, Shoaib Kamil, Julian Shun, Saman P. Amarasinghe: GraphIt: a high-performance graph DSL. 121:1-121:30","address":"https://doi.org/10.1145/3276491","index":638},"https://doi.org/10.1145/3276492":{"title":"James Koppel, Varot Premtoon, Armando Solar-Lezama: One tool, many languages: language-parametric transformation with incremental parametric syntax. 122:1-122:28","address":"https://doi.org/10.1145/3276492","index":639},"https://doi.org/10.1145/3276493":{"title":"Stephen Chou, Fredrik Kjolstad, Saman P. Amarasinghe: Format abstraction for sparse tensor algebra compilers. 123:1-123:30","address":"https://doi.org/10.1145/3276493","index":640},"https://doi.org/10.1145/3276494":{"title":"Xiaoran Xu, Keith Cooper, Jacob Brock, Yan Zhang, Handong Ye: ShareJIT: JIT code cache sharing across processes and its practical implementation. 124:1-124:23","address":"https://doi.org/10.1145/3276494","index":641},"https://doi.org/10.1145/3276495":{"title":"Juneyoung Lee, Chung-Kil Hur, Ralf Jung, Zhengyang Liu, John Regehr, Nuno P. Lopes: Reconciling high-level optimizations and low-level code in LLVM. 125:1-125:28","address":"https://doi.org/10.1145/3276495","index":642},"https://doi.org/10.1145/3276496":{"title":"Zhangxiaowen Gong, Zhi Chen, Justin Josef Szaday, David C. Wong, Zehra Sura, Neftali Watkinson, Saeed Maleki, David A. Padua, Alexander V. Veidenbaum, Alexandru Nicolau, Josep Torrellas: An empirical study of the effect of source-level loop transformations on compiler stability. 126:1-126:29","address":"https://doi.org/10.1145/3276496","index":643},"https://doi.org/10.1145/3276497":{"title":"Mikaël Mayer, Viktor Kuncak, Ravi Chugh: Bidirectional evaluation with direct manipulation. 127:1-127:28","address":"https://doi.org/10.1145/3276497","index":644},"https://doi.org/10.1145/3276498":{"title":"Jason Ott, Tyson Loveless, Christopher Curtis, Mohsen Lesani, Philip Brisk: BioScript: programming safe chemistry on laboratories-on-a-chip. 128:1-128:31","address":"https://doi.org/10.1145/3276498","index":645},"https://doi.org/10.1145/3276499":{"title":"Pascal Weisenburger, Mirko Köhler, Guido Salvaneschi: Distributed system development with ScalaLoci. 129:1-129:30","address":"https://doi.org/10.1145/3276499","index":646},"https://doi.org/10.1145/3276500":{"title":"Michael Faes, Thomas R. Gross: Concurrency-aware object-oriented programming with roles. 130:1-130:30","address":"https://doi.org/10.1145/3276500","index":647},"https://doi.org/10.1145/3276501":{"title":"P. Ezudheen, Daniel Neider, Deepak D'Souza, Pranav Garg, P. Madhusudan: Horn-ICE learning for synthesizing invariants and contracts. 131:1-131:25","address":"https://doi.org/10.1145/3276501","index":648},"https://doi.org/10.1145/3276502":{"title":"Niki Vazou, Éric Tanter, David Van Horn: Gradual liquid type inference. 132:1-132:25","address":"https://doi.org/10.1145/3276502","index":649},"https://doi.org/10.1145/3276503":{"title":"Daniel Feltey, Ben Greenman, Christophe Scholliers, Robert Bruce Findler, Vincent St-Amour: Collapsible contracts: fixing a pathology of gradual typing. 133:1-133:27","address":"https://doi.org/10.1145/3276503","index":650},"https://doi.org/10.1145/3276504":{"title":"Jack Williams, J. Garrett Morris, Philip Wadler: The root cause of blame: contracts for intersection and union types. 134:1-134:29","address":"https://doi.org/10.1145/3276504","index":651},"https://doi.org/10.1145/3276505":{"title":"Parosh Aziz Abdulla, Mohamed Faouzi Atig, Bengt Jonsson, Tuan Phong Ngo: Optimal stateless model checking under the release-acquire semantics. 135:1-135:29","address":"https://doi.org/10.1145/3276505","index":652},"https://doi.org/10.1145/3276506":{"title":"Peizhao Ou, Brian Demsky: Towards understanding the costs of avoiding out-of-thin-air results. 136:1-136:29","address":"https://doi.org/10.1145/3276506","index":653},"https://doi.org/10.1145/3276507":{"title":"Azalea Raad, Viktor Vafeiadis: Persistence semantics for weak memory: integrating epoch persistency with the TSO memory model. 137:1-137:27","address":"https://doi.org/10.1145/3276507","index":654},"https://doi.org/10.1145/3276508":{"title":"Jyothi Vedurada, V. Krishna Nandivada: Identifying refactoring opportunities for replacing type code with subclass and state. 138:1-138:28","address":"https://doi.org/10.1145/3276508","index":655},"https://doi.org/10.1145/3276509":{"title":"Tamás Szabó, Gábor Bergmann, Sebastian Erdweg, Markus Voelter: Incrementalizing lattice-based program analyses in Datalog. 139:1-139:29","address":"https://doi.org/10.1145/3276509","index":656},"https://doi.org/10.1145/3276510":{"title":"Minseok Jeon, Sehun Jeong, Hakjoo Oh: Precise and scalable points-to analysis via data-driven context tunneling. 140:1-140:29","address":"https://doi.org/10.1145/3276510","index":657},"https://doi.org/10.1145/3276511":{"title":"Yue Li, Tian Tan, Anders Møller, Yannis Smaragdakis: Precision-guided context sensitivity for pointer analysis. 141:1-141:29","address":"https://doi.org/10.1145/3276511","index":658},"https://doi.org/10.1145/3276512":{"title":"Girish Maskeri Rama, Raghavan Komondoor, Himanshu Sharma: Refinement in object-sensitivity points-to analysis via slicing. 142:1-142:27","address":"https://doi.org/10.1145/3276512","index":659},"https://doi.org/10.1145/3276513":{"title":"Nachshon Cohen: Every data structure deserves lock-free memory reclamation. 143:1-143:24","address":"https://doi.org/10.1145/3276513","index":660},"https://doi.org/10.1145/3276514":{"title":"Sam Blackshear, Nikos Gorogiannis, Peter W. O'Hearn, Ilya Sergey: RacerD: compositional static race detection. 144:1-144:28","address":"https://doi.org/10.1145/3276514","index":661},"https://doi.org/10.1145/3276515":{"title":"Umang Mathur, Dileep Kini, Mahesh Viswanathan: What happens-after the first race? enhancing the predictive power of happens-before based dynamic race detection. 145:1-145:29","address":"https://doi.org/10.1145/3276515","index":662},"https://doi.org/10.1145/3276516":{"title":"Christian Gram Kalhauge, Jens Palsberg: Sound deadlock prediction. 146:1-146:29","address":"https://doi.org/10.1145/3276516","index":663},"https://doi.org/10.1145/3276517":{"title":"Michael Pradel, Koushik Sen: DeepBugs: a learning approach to name-based bug detection. 147:1-147:25","address":"https://doi.org/10.1145/3276517","index":664},"https://doi.org/10.1145/3276518":{"title":"Daniel W. Barowy, Emery D. Berger, Benjamin G. Zorn: ExceLint: automatically finding spreadsheet formula errors. 148:1-148:26","address":"https://doi.org/10.1145/3276518","index":665},"https://doi.org/10.1145/3276519":{"title":"James Bornholt, Emina Torlak: Finding code that explodes under symbolic evaluation. 149:1-149:26","address":"https://doi.org/10.1145/3276519","index":666},"https://doi.org/10.1145/3276520":{"title":"Saswat Padhi, Prateek Jain, Daniel Perelman, Oleksandr Polozov, Sumit Gulwani, Todd D. Millstein: FlashProfile: a framework for synthesizing data profiles. 150:1-150:28","address":"https://doi.org/10.1145/3276520","index":667},"https://doi.org/10.1145/3276521":{"title":"Ulan Degenbaev, Jochen Eisinger, Kentaro Hara, Marcel Hlopko, Michael Lippautz, Hannes Payer: Cross-component garbage collection. 151:1-151:24","address":"https://doi.org/10.1145/3276521","index":668},"https://doi.org/10.1145/3276522":{"title":"Sebastian Burckhardt, Tim Coppieters: Reactive caching for composed services: polling at the speed of push. 152:1-152:28","address":"https://doi.org/10.1145/3276522","index":669},"https://doi.org/10.1145/3276523":{"title":"Nachshon Cohen, David T. Aksun, James R. Larus: Object-oriented recovery for non-volatile memory. 153:1-153:22","address":"https://doi.org/10.1145/3276523","index":670},"https://doi.org/10.1145/3276524":{"title":"Will Dietz, Vikram S. Adve: Software multiplexing: share your libraries and statically link them too. 154:1-154:26","address":"https://doi.org/10.1145/3276524","index":671},"https://doi.org/10.1145/3276525":{"title":"Yuepeng Wang, Xinyu Wang, Isil Dillig: Relational program synthesis. 155:1-155:27","address":"https://doi.org/10.1145/3276525","index":672},"https://doi.org/10.1145/3276526":{"title":"Pavol Bielik, Marc Fischer, Martin T. Vechev: Robust relational layout synthesis from examples for Android. 156:1-156:29","address":"https://doi.org/10.1145/3276526","index":673},"https://doi.org/10.1145/3276527":{"title":"Chenglong Wang, Alvin Cheung, Rastislav Bodík: Speeding up symbolic reasoning for relational queries. 157:1-157:25","address":"https://doi.org/10.1145/3276527","index":674},"https://doi.org/10.1145/3276528":{"title":"Junho Lee, Dowon Song, Sunbeom So, Hakjoo Oh: Automatic diagnosis and correction of logical errors for functional programming assignments. 158:1-158:30","address":"https://doi.org/10.1145/3276528","index":675},"https://doi.org/10.1145/3276529":{"title":"Ankush Desai, Amar Phanishayee, Shaz Qadeer, Sanjit A. Seshia: Compositional programming and testing of dynamic distributed systems. 159:1-159:30","address":"https://doi.org/10.1145/3276529","index":676},"https://doi.org/10.1145/3276530":{"title":"Burcu Kulahcioglu Ozkan, Rupak Majumdar, Filip Niksic, Mitra Tabaei Befrouei, Georg Weissenbacher: Randomized testing of distributed systems with probabilistic guarantees. 160:1-160:28","address":"https://doi.org/10.1145/3276530","index":677},"https://doi.org/10.1145/3276531":{"title":"Marija Selakovic, Michael Pradel, Rezwana Karim, Frank Tip: Test generation for higher-order functions in dynamic languages. 161:1-161:27","address":"https://doi.org/10.1145/3276531","index":678},"https://doi.org/10.1145/3276532":{"title":"Saba Alimadadi, Di Zhong, Magnus Madsen, Frank Tip: Finding broken promises in asynchronous JavaScript programs. 162:1-162:26","address":"https://doi.org/10.1145/3276532","index":679},"https://doi.org/10.1145/3276533":{"title":"Brett Boston, Zoe Gong, Michael Carbin: Leto: verifying application-specific hardware fault tolerance with programmable execution models. 163:1-163:30","address":"https://doi.org/10.1145/3276533","index":680},"https://doi.org/10.1145/3276534":{"title":"Gowtham Kaki, Kapil Earanky, K. C. Sivaramakrishnan, Suresh Jagannathan: Safe replication through bounded concurrency verification. 164:1-164:27","address":"https://doi.org/10.1145/3276534","index":681},"https://doi.org/10.1145/3276535":{"title":"Marcelo Sousa, Isil Dillig, Shuvendu K. Lahiri: Verified three-way program merge. 165:1-165:29","address":"https://doi.org/10.1145/3276535","index":682},"https://doi.org/10.1145/3276536":{"title":"Fengmin Zhu, Fei He: Conflict resolution for structured merge via version space algebra. 166:1-166:25","address":"https://doi.org/10.1145/3276536","index":683},"https://doi.org/10.1145/3110245":{"title":"Vincent St-Amour, Daniel Feltey, Spencer P. Florence, Shu-Hung You, Robert Bruce Findler: Herbarium Racketensis: a stroll through the woods (functional pearl). 1:1-1:15","address":"https://doi.org/10.1145/3110245","index":684},"https://doi.org/10.1145/3110246":{"title":"Ivan Perez, Henrik Nilsson: Testing and debugging functional reactive programming. 2:1-2:27","address":"https://doi.org/10.1145/3110246","index":685},"https://doi.org/10.1145/3110247":{"title":"Joachim Breitner, Chris Smith: Lock-step simulation is child's play (experience report). 3:1-3:15","address":"https://doi.org/10.1145/3110247","index":686},"https://doi.org/10.1145/3110248":{"title":"Benjamin Canou, Roberto Di Cosmo, Grégoire Henry: Scaling up functional programming education: under the hood of the OCaml MOOC. 4:1-4:25","address":"https://doi.org/10.1145/3110248","index":687},"https://doi.org/10.1145/3110249":{"title":"J. Michael Spivey: Faster coroutine pipelines. 5:1-5:23","address":"https://doi.org/10.1145/3110249","index":688},"https://doi.org/10.1145/3110250":{"title":"Jean-Philippe Bernardy: A pretty but not greedy printer (functional pearl). 6:1-6:21","address":"https://doi.org/10.1145/3110250","index":689},"https://doi.org/10.1145/3110251":{"title":"Conal Elliott: Generic functional parallel algorithms: scan and FFT. 7:1-7:25","address":"https://doi.org/10.1145/3110251","index":690},"https://doi.org/10.1145/3110252":{"title":"William E. Byrd, A. Ballantyne, Gregory Rosenblatt, Matthew Might: A unified approach to solving seven programming problems (functional pearl). 8:1-8:26","address":"https://doi.org/10.1145/3110252","index":691},"https://doi.org/10.1145/3110253":{"title":"Joshua S. Auerbach, Martin Hirzel, Louis Mandel, Avraham Shinnar, Jérôme Siméon: Prototyping a query compiler using Coq (experience report). 9:1-9:15","address":"https://doi.org/10.1145/3110253","index":692},"https://doi.org/10.1145/3110254":{"title":"Daniel Winograd-Cort, Andreas Haeberlen, Aaron Roth, Benjamin C. Pierce: A framework for adaptive differential privacy. 10:1-10:29","address":"https://doi.org/10.1145/3110254","index":693},"https://doi.org/10.1145/3110255":{"title":"Praveen Narayanan, Chung-chieh Shan: Symbolic conditioning of arrays in probabilistic programs. 11:1-11:25","address":"https://doi.org/10.1145/3110255","index":694},"https://doi.org/10.1145/3110256":{"title":"David Darais, Nicholas Labich, Phuc C. Nguyen, David Van Horn: Abstracting definitional interpreters (functional pearl). 12:1-12:25","address":"https://doi.org/10.1145/3110256","index":695},"https://doi.org/10.1145/3110257":{"title":"Yannick Forster, Ohad Kammar, Sam Lindley, Matija Pretnar: On the expressive power of user-defined effects: effect handlers, monadic reflection, delimited control. 13:1-13:29","address":"https://doi.org/10.1145/3110257","index":696},"https://doi.org/10.1145/3110258":{"title":"Wilmer Ricciotti, Jan Stolarek, Roly Perera, James Cheney: Imperative functional programs that explain their work. 14:1-14:28","address":"https://doi.org/10.1145/3110258","index":697},"https://doi.org/10.1145/3110259":{"title":"Jan Midtgaard, Mathias Nygaard Justesen, Patrick Kasting, Flemming Nielson, Hanne Riis Nielson: Effect-driven QuickChecking of compilers. 15:1-15:23","address":"https://doi.org/10.1145/3110259","index":698},"https://doi.org/10.1145/3110260":{"title":"Juan Pedro Bolívar Puente: Persistence for the masses: RRB-vectors in a systems language. 16:1-16:28","address":"https://doi.org/10.1145/3110260","index":699},"https://doi.org/10.1145/3110261":{"title":"Jonathan Protzenko, Jean Karim Zinzindohoué, Aseem Rastogi, Tahina Ramananandro, Peng Wang, Santiago Zanella Béguelin, Antoine Delignat-Lavaud, Catalin Hritcu, Karthikeyan Bhargavan, Cédric Fournet, Nikhil Swamy: Verified low-level programming embedded in F. 17:1-17:29","address":"https://doi.org/10.1145/3110261","index":700},"https://doi.org/10.1145/3110262":{"title":"Scott Owens, Michael Norrish, Ramana Kumar, Magnus O. Myreen, Yong Kiam Tan: Verifying efficient function calls in CakeML. 18:1-18:27","address":"https://doi.org/10.1145/3110262","index":701},"https://doi.org/10.1145/3110263":{"title":"Geoffrey Mainland: Better living through operational semantics: an optimizing compiler for radio protocols. 19:1-19:26","address":"https://doi.org/10.1145/3110263","index":702},"https://doi.org/10.1145/3110264":{"title":"Thibaut Balabonski, Pablo Barenbaum, Eduardo Bonelli, Delia Kesner: Foundations of strong call by need. 20:1-20:29","address":"https://doi.org/10.1145/3110264","index":703},"https://doi.org/10.1145/3110265":{"title":"Alejandro Aguirre, Gilles Barthe, Marco Gaboardi, Deepak Garg, Pierre-Yves Strub: A relational logic for higher-order programs. 21:1-21:29","address":"https://doi.org/10.1145/3110265","index":704},"https://doi.org/10.1145/3110266":{"title":"Makoto Hamana: How to prove your calculus is decidable: practical applications of second-order algebraic theories and computation. 22:1-22:28","address":"https://doi.org/10.1145/3110266","index":705},"https://doi.org/10.1145/3110267":{"title":"Milo Davis, William Meehan, Olin Shivers: No-brainer CPS conversion (functional pearl). 23:1-23:25","address":"https://doi.org/10.1145/3110267","index":706},"https://doi.org/10.1145/3110268":{"title":"Joonwon Choi, Muralidaran Vijayaraghavan, Benjamin Sherman, Adam Chlipala, Arvind: Kami: a platform for high-level parametric hardware specification and its modular verification. 24:1-24:30","address":"https://doi.org/10.1145/3110268","index":707},"https://doi.org/10.1145/3110269":{"title":"Konstantin Weitz, Steven Lyubomirsky, Stefan Heule, Emina Torlak, Michael D. Ernst, Zachary Tatlock: SpaceSearch: a library for building and verifying solver-aided tools. 25:1-25:28","address":"https://doi.org/10.1145/3110269","index":708},"https://doi.org/10.1145/3110270":{"title":"Benjamin Cosman, Ranjit Jhala: Local refinement typing. 26:1-26:27","address":"https://doi.org/10.1145/3110270","index":709},"https://doi.org/10.1145/3110271":{"title":"Conal Elliott: Compiling to categories. 27:1-27:27","address":"https://doi.org/10.1145/3110271","index":710},"https://doi.org/10.1145/3110272":{"title":"François Pottier: Visitors unchained. 28:1-28:28","address":"https://doi.org/10.1145/3110272","index":711},"https://doi.org/10.1145/3110273":{"title":"Jeremy Yallop: Staged generic programming. 29:1-29:29","address":"https://doi.org/10.1145/3110273","index":712},"https://doi.org/10.1145/3110274":{"title":"Leif Andersen, Stephen Chang, Matthias Felleisen: Super 8 languages for making movies (functional pearl). 30:1-30:29","address":"https://doi.org/10.1145/3110274","index":713},"https://doi.org/10.1145/3110275":{"title":"Stephanie Weirich, Antoine Voizard, Pedro Henrique Avezedo de Amorim, Richard A. Eisenberg: A specification for dependent types in Haskell. 31:1-31:29","address":"https://doi.org/10.1145/3110275","index":714},"https://doi.org/10.1145/3110276":{"title":"Andreas Nuyts, Andrea Vezzosi, Dominique Devriese: Parametric quantifiers for dependent type theory. 32:1-32:29","address":"https://doi.org/10.1145/3110276","index":715},"https://doi.org/10.1145/3110277":{"title":"Andreas Abel, Andrea Vezzosi, Théo Winterhalter: Normalization by evaluation for sized dependent types. 33:1-33:30","address":"https://doi.org/10.1145/3110277","index":716},"https://doi.org/10.1145/3110278":{"title":"Gabriel Ebner, Sebastian Ullrich, Jared Roesch, Jeremy Avigad, Leonardo de Moura: A metaprogramming framework for formal verification. 34:1-34:29","address":"https://doi.org/10.1145/3110278","index":717},"https://doi.org/10.1145/3110279":{"title":"Hernán C. Melgratti, Luca Padovani: Chaperone contracts for higher-order sessions. 35:1-35:29","address":"https://doi.org/10.1145/3110279","index":718},"https://doi.org/10.1145/3110280":{"title":"Lucas Waye, Stephen Chong, Christos Dimoulas: Whip: higher-order contracts for modern services. 36:1-36:28","address":"https://doi.org/10.1145/3110280","index":719},"https://doi.org/10.1145/3110281":{"title":"Stephanie Balzer, Frank Pfenning: Manifest sharing with session types. 37:1-37:29","address":"https://doi.org/10.1145/3110281","index":720},"https://doi.org/10.1145/3110282":{"title":"Atsushi Igarashi, Peter Thiemann, Vasco T. Vasconcelos, Philip Wadler: Gradual session types. 38:1-38:28","address":"https://doi.org/10.1145/3110282","index":721},"https://doi.org/10.1145/3110283":{"title":"Amal Ahmed, Dustin Jamner, Jeremy G. Siek, Philip Wadler: Theorems for free for free: parametricity, with and without types. 39:1-39:28","address":"https://doi.org/10.1145/3110283","index":722},"https://doi.org/10.1145/3110284":{"title":"Yuu Igarashi, Taro Sekiyama, Atsushi Igarashi: On polymorphic gradual typing. 40:1-40:29","address":"https://doi.org/10.1145/3110284","index":723},"https://doi.org/10.1145/3110285":{"title":"Giuseppe Castagna, Victor Lanvin: Gradual typing with union and intersection types. 41:1-41:28","address":"https://doi.org/10.1145/3110285","index":724},"https://doi.org/10.1145/3110286":{"title":"J. Garrett Morris, Richard A. Eisenberg: Constrained type families. 42:1-42:28","address":"https://doi.org/10.1145/3110286","index":725},"https://doi.org/10.1145/3110287":{"title":"Martin Avanzini, Ugo Dal Lago: Automating sized-type inference for complexity analysis. 43:1-43:29","address":"https://doi.org/10.1145/3110287","index":726},"https://doi.org/10.1145/3110288":{"title":"Justin Pombrio, Shriram Krishnamurthi, Mitchell Wand: Inferring scope through syntactic sugar. 44:1-44:28","address":"https://doi.org/10.1145/3110288","index":727},"https://doi.org/10.1145/3133869":{"title":"Izzat El Hajj, Thomas B. Jablin, Dejan S. Milojicic, Wen-Mei W. Hwu: SAVI objects: sharing and virtuality incorporated. 45:1-45:24","address":"https://doi.org/10.1145/3133869","index":728},"https://doi.org/10.1145/3133870":{"title":"Marianna Rapoport, Ifaz Kabir, Paul He, Ondrej Lhoták: A simple soundness proof for dependent object types. 46:1-46:27","address":"https://doi.org/10.1145/3133870","index":729},"https://doi.org/10.1145/3133871":{"title":"Yanpeng Yang, Bruno C. d. S. Oliveira: Unifying typing and subtyping. 47:1-47:26","address":"https://doi.org/10.1145/3133871","index":730},"https://doi.org/10.1145/3133872":{"title":"Avik Chaudhuri, Panagiotis Vekris, Sam Goldman, Marshall Roch, Gabriel Levi: Fast and precise type checking for JavaScript. 48:1-48:30","address":"https://doi.org/10.1145/3133872","index":731},"https://doi.org/10.1145/3133873":{"title":"Lun Liu, Todd D. Millstein, Madanlal Musuvathi: A volatile-by-default JVM for server applications. 49:1-49:25","address":"https://doi.org/10.1145/3133873","index":732},"https://doi.org/10.1145/3133874":{"title":"Gabriel Poesia, Breno Campos Ferreira Guimarães, Fabricio Ferracioli, Fernando Magno Quintão Pereira: Static placement of computation on heterogeneous devices. 50:1-50:28","address":"https://doi.org/10.1145/3133874","index":733},"https://doi.org/10.1145/3133875":{"title":"Sarah E. Chasins, Rastislav Bodík: Skip blocks: reusing execution history to accelerate web scripts. 51:1-51:28","address":"https://doi.org/10.1145/3133875","index":734},"https://doi.org/10.1145/3133876":{"title":"Edd Barrett, Carl Friedrich Bolz-Tereick, Rebecca Killick, Sarah Mount, Laurence Tratt: Virtual machine warmup blows hot and cold. 52:1-52:27","address":"https://doi.org/10.1145/3133876","index":735},"https://doi.org/10.1145/3133877":{"title":"Tomoharu Ugawa, Tatsuya Abe, Toshiyuki Maeda: Model checking copy phases of concurrent copying garbage collection with various memory models. 53:1-53:26","address":"https://doi.org/10.1145/3133877","index":736},"https://doi.org/10.1145/3133878":{"title":"Spenser Bauman, Carl Friedrich Bolz-Tereick, Jeremy G. Siek, Sam Tobin-Hochstadt: Sound gradual typing: only mostly dead. 54:1-54:24","address":"https://doi.org/10.1145/3133878","index":737},"https://doi.org/10.1145/3133879":{"title":"Gregor Richards, Ellen Arteca, Alexi Turcotte: The VM already knew that: leveraging compile-time knowledge to optimize gradual typing. 55:1-55:27","address":"https://doi.org/10.1145/3133879","index":738},"https://doi.org/10.1145/3133880":{"title":"Fabian Muehlboeck, Ross Tate: Sound gradual typing is nominally alive and well. 56:1-56:30","address":"https://doi.org/10.1145/3133880","index":739},"https://doi.org/10.1145/3133881":{"title":"Xin Zhang, Radu Grigore, Xujie Si, Mayur Naik: Effective interactive resolution of static analysis alarms. 57:1-57:30","address":"https://doi.org/10.1145/3133881","index":740},"https://doi.org/10.1145/3133882":{"title":"Binhang Yuan, Vijayaraghavan Murali, Christopher M. Jermaine: Abridging source code. 58:1-58:26","address":"https://doi.org/10.1145/3133882","index":741},"https://doi.org/10.1145/3133883":{"title":"Guilherme Cavalcanti, Paulo Borba, Paola R. G. Accioly: Evaluating and improving semistructured merge. 59:1-59:27","address":"https://doi.org/10.1145/3133883","index":742},"https://doi.org/10.1145/3138818":{"title":"Eric L. Seidel, Huma Sibghat, Kamalika Chaudhuri, Westley Weimer, Ranjit Jhala: Learning to blame: localizing novice type errors with data-driven diagnosis. 60:1-60:27","address":"https://doi.org/10.1145/3138818","index":743},"https://doi.org/10.1145/3133885":{"title":"Venkatesh Srinivasan, Ara Vartanian, Thomas W. Reps: Model-assisted machine-code synthesis. 61:1-61:26","address":"https://doi.org/10.1145/3133885","index":744},"https://doi.org/10.1145/3133886":{"title":"Xinyu Wang, Isil Dillig, Rishabh Singh: Synthesis of data completion scripts using finite tree automata. 62:1-62:26","address":"https://doi.org/10.1145/3133886","index":745},"https://doi.org/10.1145/3133887":{"title":"Navid Yaghmazadeh, Yuepeng Wang, Isil Dillig, Thomas Dillig: SQLizer: query synthesis from natural language. 63:1-63:26","address":"https://doi.org/10.1145/3133887","index":746},"https://doi.org/10.1145/3133888":{"title":"Mark Santolucito, Ennan Zhai, Rahul Dhodapkar, Aaron Shim, Ruzica Piskac: Synthesizing configuration file specifications with association rule learning. 64:1-64:20","address":"https://doi.org/10.1145/3133888","index":747},"https://doi.org/10.1145/3133889":{"title":"Xiaokang Qiu, Armando Solar-Lezama: Natural synthesis of provably-correct data-structure manipulations. 65:1-65:28","address":"https://doi.org/10.1145/3133889","index":748},"https://doi.org/10.1145/3133890":{"title":"Christoffer Quist Adamsen, Anders Møller, Frank Tip: Practical initialization race detection for JavaScript web applications. 66:1-66:22","address":"https://doi.org/10.1145/3133890","index":749},"https://doi.org/10.1145/3133891":{"title":"Nachshon Cohen, Michal Friedman, James R. Larus: Efficient logging in non-volatile memory by exploiting coherency protocols. 67:1-67:24","address":"https://doi.org/10.1145/3133891","index":750},"https://doi.org/10.1145/3133892":{"title":"Neville Grech, George Fourtounis, Adrian Francalanza, Yannis Smaragdakis: Heaps don't lie: countering unsoundness with heap snapshots. 68:1-68:27","address":"https://doi.org/10.1145/3133892","index":751},"https://doi.org/10.1145/3133893":{"title":"Benjamin P. Wood, Man Cao, Michael D. Bond, Dan Grossman: Instrumentation bias for dynamic data race detection. 69:1-69:31","address":"https://doi.org/10.1145/3133893","index":752},"https://doi.org/10.1145/3133894":{"title":"Yizhou Zhang, Andrew C. Myers: Familia: unifying interfaces, type classes, and family polymorphism. 70:1-70:31","address":"https://doi.org/10.1145/3133894","index":753},"https://doi.org/10.1145/3133895":{"title":"Adrian Sampson, Kathryn S. McKinley, Todd Mytkowicz: Static stages for heterogeneous programming. 71:1-71:27","address":"https://doi.org/10.1145/3133895","index":754},"https://doi.org/10.1145/3133896":{"title":"Sylvan Clebsch, Juliana Franco, Sophia Drossopoulou, Albert Mingkun Yang, Tobias Wrigstad, Jan Vitek: Orca: GC and type system co-design for actor languages. 72:1-72:28","address":"https://doi.org/10.1145/3133896","index":755},"https://doi.org/10.1145/3133897":{"title":"Ryan G. Scott, Omar S. Navarro Leija, Joseph Devietti, Ryan R. Newton: Monadic composition for deterministic, parallel batch processing. 73:1-73:26","address":"https://doi.org/10.1145/3133897","index":756},"https://doi.org/10.1145/3133898":{"title":"Yufei Ding, Xipeng Shen: GLORE: generalized loop redundancy elimination upon LER-notation. 74:1-74:28","address":"https://doi.org/10.1145/3133898","index":757},"https://doi.org/10.1145/3133899":{"title":"Dominic A. Orchard, Mistral Contrastin, Matthew Danish, Andrew C. Rice: Verifying spatial properties of array computations. 75:1-75:30","address":"https://doi.org/10.1145/3133899","index":758},"https://doi.org/10.1145/3133900":{"title":"Laith Sakka, Kirshanthan Sundararajah, Milind Kulkarni: TreeFuser: a framework for analyzing and fusing general recursive tree traversals. 76:1-76:30","address":"https://doi.org/10.1145/3133900","index":759},"https://doi.org/10.1145/3133901":{"title":"Fredrik Kjolstad, Shoaib Kamil, Stephen Chou, David Lugato, Saman P. Amarasinghe: The tensor algebra compiler. 77:1-77:29","address":"https://doi.org/10.1145/3133901","index":760},"https://doi.org/10.1145/3133902":{"title":"Manolis Papadakis, Gilbert Louis Bernstein, Rahul Sharma, Alex Aiken, Pat Hanrahan: Seam: provably safe local edits on graphs. 78:1-78:29","address":"https://doi.org/10.1145/3133902","index":761},"https://doi.org/10.1145/3133903":{"title":"Peng Wang, Di Wang, Adam Chlipala: TiML: a functional language for practical complexity analysis with invariants. 79:1-79:26","address":"https://doi.org/10.1145/3133903","index":762},"https://doi.org/10.1145/3133904":{"title":"Aws Albarghouthi, Loris D'Antoni, Samuel Drews, Aditya V. Nori: FairSquare: probabilistic verification of program fairness. 80:1-80:30","address":"https://doi.org/10.1145/3133904","index":763},"https://doi.org/10.1145/3133905":{"title":"Davide Ancona, Francesco Dagnino, Elena Zucca: Reasoning on divergent computations with coaxioms. 81:1-81:26","address":"https://doi.org/10.1145/3133905","index":764},"https://doi.org/10.1145/3133906":{"title":"Michael D. Adams, Matthew Might: Restricting grammars with tree automata. 82:1-82:25","address":"https://doi.org/10.1145/3133906","index":765},"https://doi.org/10.1145/3133907":{"title":"Syeda Khairunnesa Samantha, Hoan Anh Nguyen, Tien N. Nguyen, Hridesh Rajan: Exploiting implicit beliefs to resolve sparse usage problem in usage-based specification mining. 83:1-83:29","address":"https://doi.org/10.1145/3133907","index":766},"https://doi.org/10.1145/3133908":{"title":"Cristina V. Lopes, Petr Maj, Pedro Martins, Vaibhav Saini, Di Yang, Jakub Zitny, Hitesh Sajnani, Jan Vitek: DéjàVu: a map of code duplicates on GitHub. 84:1-84:28","address":"https://doi.org/10.1145/3133908","index":767},"https://doi.org/10.1145/3133909":{"title":"Davood Mazinanian, Ameya Ketkar, Nikolaos Tsantalis, Danny Dig: Understanding the use of lambda expressions in Java. 85:1-85:31","address":"https://doi.org/10.1145/3133909","index":768},"https://doi.org/10.1145/3133910":{"title":"Magnus Madsen, Ondrej Lhoták, Frank Tip: A model for reasoning about JavaScript promises. 86:1-86:24","address":"https://doi.org/10.1145/3133910","index":769},"https://doi.org/10.1145/3133911":{"title":"William Mansky, Andrew W. Appel, Aleksey Nogin: A verified messaging system. 87:1-87:28","address":"https://doi.org/10.1145/3133911","index":770},"https://doi.org/10.1145/3133912":{"title":"Alastair Reid: Who guards the guards? formal validation of the Arm v8-m architecture specification. 88:1-88:24","address":"https://doi.org/10.1145/3133912","index":771},"https://doi.org/10.1145/3133913":{"title":"David Swasey, Deepak Garg, Derek Dreyer: Robust and compositional verification of object capability patterns. 89:1-89:26","address":"https://doi.org/10.1145/3133913","index":772},"https://doi.org/10.1145/3133914":{"title":"Erik Krogh Kristensen, Anders Møller: Type test scripts for TypeScript testing. 90:1-90:25","address":"https://doi.org/10.1145/3133914","index":773},"https://doi.org/10.1145/3133915":{"title":"Talia Ringer, Dan Grossman, Daniel Schwartz-Narbonne, Serdar Tasiran: A solver-aided language for test input generation. 91:1-91:24","address":"https://doi.org/10.1145/3133915","index":774},"https://doi.org/10.1145/3133916":{"title":"Xia Li, Lingming Zhang: Transforming programs and tests in tandem for fault localization. 92:1-92:30","address":"https://doi.org/10.1145/3133916","index":775},"https://doi.org/10.1145/3133917":{"title":"Alastair F. Donaldson, Hugues Evrard, Andrei Lascu, Paul Thomson: Automated testing of graphics shader compilers. 93:1-93:29","address":"https://doi.org/10.1145/3133917","index":776},"https://doi.org/10.1145/3133918":{"title":"Ahmet Çelik, Sreepathi Pai, Sarfraz Khurshid, Milos Gligoric: Bounded exhaustive test-input generation on GPUs. 94:1-94:25","address":"https://doi.org/10.1145/3133918","index":777},"https://doi.org/10.1145/3141879":{"title":"Matthew J. Parkinson, Dimitrios Vytiniotis, Kapil Vaswani, Manuel Costa, Pantazis Deligiannis, Dylan McDermott, Aaron Blankstein, Jonathan Balkind: Project snowflake: non-blocking safe manual memory management in .NET. 95:1-95:25","address":"https://doi.org/10.1145/3141879","index":778},"https://doi.org/10.1145/3133920":{"title":"Kiwan Maeng, Alexei Colin, Brandon Lucia: Alpaca: intermittent execution without checkpoints. 96:1-96:30","address":"https://doi.org/10.1145/3133920","index":779},"https://doi.org/10.1145/3133921":{"title":"Ennan Zhai, Ruzica Piskac, Ronghui Gu, Xun Lao, Xi Wang: An auditing language for preventing correlated failures in the cloud. 97:1-97:28","address":"https://doi.org/10.1145/3133921","index":780},"https://doi.org/10.1145/3138224":{"title":"Ted Kaminski, Lucas Kramer, Travis Carlson, Eric Van Wyk: Reliable and automatic composition of language extensions to C: the ableC extensible language framework. 98:1-98:29","address":"https://doi.org/10.1145/3138224","index":781},"https://doi.org/10.1145/3133923":{"title":"Johannes Späth, Karim Ali, Eric Bodden: IDEal: efficient and precise alias-aware dataflow analysis. 99:1-99:27","address":"https://doi.org/10.1145/3133923","index":782},"https://doi.org/10.1145/3133924":{"title":"Sehun Jeong, Minseok Jeon, Sung Deok Cha, Hakjoo Oh: Data-driven context-sensitivity for points-to analysis. 100:1-100:28","address":"https://doi.org/10.1145/3133924","index":783},"https://doi.org/10.1145/3133925":{"title":"Kwonsoo Chae, Hakjoo Oh, Kihong Heo, Hongseok Yang: Automatically generating features for learning program analysis heuristics for C-like languages. 101:1-101:25","address":"https://doi.org/10.1145/3133925","index":784},"https://doi.org/10.1145/3133926":{"title":"Neville Grech, Yannis Smaragdakis: P/Taint: unified points-to and taint analysis. 102:1-102:28","address":"https://doi.org/10.1145/3133926","index":785},"https://doi.org/10.1145/3143359":{"title":"Tiago Cogumbreiro, Rishi Surendran, Francisco Martins, Vivek Sarkar, Vasco T. Vasconcelos, Max Grossman: Deadlock avoidance in parallel programs with futures: why parallel tasks should not wait for strangers. 103:1-103:26","address":"https://doi.org/10.1145/3143359","index":786},"https://doi.org/10.1145/3133928":{"title":"Andrew Rice, Edward Aftandilian, Ciera Jaspan, Emily Johnston, Michael Pradel, Yulissa Arroyo-Paredes: Detecting argument selection defects. 104:1-104:22","address":"https://doi.org/10.1145/3133928","index":787},"https://doi.org/10.1145/3133929":{"title":"Baijun Wu, Sheng Chen: How type errors were fixed and what students did? 105:1-105:27","address":"https://doi.org/10.1145/3133929","index":788},"https://doi.org/10.1145/3133930":{"title":"Baijun Wu, John Peter Campora III, Sheng Chen: Learning user friendly type-error messages. 106:1-106:29","address":"https://doi.org/10.1145/3133930","index":789},"https://doi.org/10.1145/3133931":{"title":"Philip A. Bernstein, Sebastian Burckhardt, Sergey Bykov, Natacha Crooks, Jose M. Faleiro, Gabriel Kliot, Alok Kumbhare, Muntasir Raihan Rahman, Vivek Shah, Adriana Szekeres, Jorgen Thelin: Geo-distribution of actor-based services. 107:1-107:26","address":"https://doi.org/10.1145/3133931","index":790},"https://doi.org/10.1145/3140568":{"title":"Oded Padon, Giuliano Losa, Mooly Sagiv, Sharon Shoham: Paxos made EPR: decidable reasoning about distributed protocols. 108:1-108:31","address":"https://doi.org/10.1145/3140568","index":791},"https://doi.org/10.1145/3133933":{"title":"Victor B. F. Gomes, Martin Kleppmann, Dominic P. Mulligan, Alastair R. Beresford: Verifying strong eventual consistency in distributed systems. 109:1-109:28","address":"https://doi.org/10.1145/3133933","index":792},"https://doi.org/10.1145/3133934":{"title":"Alexander Bakst, Klaus von Gleissenthall, Rami Gökhan Kici, Ranjit Jhala: Verifying distributed programs via canonical sequentialization. 110:1-110:27","address":"https://doi.org/10.1145/3133934","index":793},"index":0}