{"https://doi.org/10.1145/3436809":{"title":"Marco Patrignani, Deepak Garg: Robustly Safe Compilation, an Efficient Form of Secure Compilation. 1:1-1:41","address":"https://doi.org/10.1145/3436809","index":0},"https://doi.org/10.1145/3436808":{"title":"David Sanán, Yongwang Zhao, Shang-Wei Lin, Yang Liu: CSim2: Compositional Top-down Verification of Concurrent Systems using Rely-Guarantee. 2:1-2:46","address":"https://doi.org/10.1145/3436808","index":1},"https://doi.org/10.1145/3443420":{"title":"David J. Pearce: A Lightweight Formalism for Reference Lifetimes and Borrowing in Rust. 3:1-3:73","address":"https://doi.org/10.1145/3443420","index":2},"https://doi.org/10.1145/3450272":{"title":"Colin S. Gordon: Polymorphic Iterable Sequential Effect Systems. 4:1-4:79","address":"https://doi.org/10.1145/3450272","index":3},"https://doi.org/10.1145/3450967":{"title":"Toru Takisaka, Yuichiro Oyabu, Natsuki Urabe, Ichiro Hasuo: Ranking and Repulsing Supermartingales for Reachability in Randomized Programs. 5:1-5:46","address":"https://doi.org/10.1145/3450967","index":4},"https://doi.org/10.1145/3452096":{"title":"Elisabet Lobo Vesga, Alejandro Russo, Marco Gaboardi: A Programming Language for Data Privacy with Accuracy Estimations. 6:1-6:42","address":"https://doi.org/10.1145/3452096","index":5},"https://doi.org/10.1145/3457884":{"title":"Bernardo Toninho, Nobuko Yoshida: On Polymorphic Sessions and Functions: A Tale of Two (Fully Abstract) Encodings. 7:1-7:55","address":"https://doi.org/10.1145/3457884","index":6},"https://doi.org/10.1145/3458926":{"title":"Jade Alglave, Will Deacon, Richard Grisenthwaite, Antoine Hacquard, Luc Maranget: Armed Cats: Formal Concurrency Modelling at Arm. 8:1-8:54","address":"https://doi.org/10.1145/3458926","index":7},"https://doi.org/10.1145/3460228":{"title":"Weixin Zhang, Yaozhu Sun, Bruno C. d. S. Oliveira: Compositional Programming. 9:1-9:61","address":"https://doi.org/10.1145/3460228","index":8},"https://doi.org/10.1145/3462206":{"title":"Lun Liu, Todd D. Millstein, Madanlal Musuvathi: Safe-by-default Concurrency for Modern Programming Languages. 10:1-10:50","address":"https://doi.org/10.1145/3462206","index":9},"https://doi.org/10.1145/3457885":{"title":"Graeme Gange, Zequn Ma, Jorge A. Navas, Peter Schachte, Harald Søndergaard, Peter J. Stuckey: A Fresh Look at Zones and Octagons. 11:1-11:51","address":"https://doi.org/10.1145/3457885","index":10},"https://doi.org/10.1145/3470534":{"title":"Matteo Busi, Job Noorman, Jo Van Bulck, Letterio Galletta, Pierpaolo Degano, Jan Tobias Mühlberg, Frank Piessens: Securing Interruptible Enclaved Execution on Small Microprocessors. 12:1-12:77","address":"https://doi.org/10.1145/3470534","index":11},"https://doi.org/10.1145/3368252":{"title":"Amal Ahmed: Introduction to the Special Issue on ESOP 2018. 1:1","address":"https://doi.org/10.1145/3368252","index":12},"https://doi.org/10.1145/3310339":{"title":"Ningning Xie, Xuan Bi, Bruno C. d. S. Oliveira, Tom Schrijvers: Consistent Subtyping for All. 2:1-2:79","address":"https://doi.org/10.1145/3310339","index":13},"https://doi.org/10.1145/3324783":{"title":"Marco Eilers, Peter Müller, Samuel Hitz: Modular Product Programs. 3:1-3:37","address":"https://doi.org/10.1145/3324783","index":14},"https://doi.org/10.1145/3363518":{"title":"Alex Simpson, Niels F. W. Voorneveld: Behavioural Equivalence via Modalities for Algebraic Effects. 4:1-4:45","address":"https://doi.org/10.1145/3363518","index":15},"https://doi.org/10.1145/3363519":{"title":"Lau Skorstengaard, Dominique Devriese, Lars Birkedal: Reasoning about a Machine with Local Capabilities: Provably Safe Stack and Return Pointer Management. 5:1-5:53","address":"https://doi.org/10.1145/3363519","index":16},"https://doi.org/10.1145/3372895":{"title":"Torben Amtoft, Anindya Banerjee: A Theory of Slicing for Imperative Probabilistic Programs. 6:1-6:71","address":"https://doi.org/10.1145/3372895","index":17},"https://doi.org/10.1145/3379446":{"title":"David Zhao, Pavle Subotic, Bernhard Scholz: Debugging Large-scale Datalog: A Scalable Provenance Evaluation Strategy. 7:1-7:35","address":"https://doi.org/10.1145/3379446","index":18},"https://doi.org/10.1145/3382092":{"title":"Pritam M. Gharat, Uday P. Khedker, Alan Mycroft: Generalized Points-to Graphs: A Precise and Scalable Abstraction for Points-to Analysis. 8:1-8:78","address":"https://doi.org/10.1145/3382092","index":19},"https://doi.org/10.1145/3374208":{"title":"Praveen Narayanan, Chung-chieh Shan: Symbolic Disintegration with a Variety of Base Measures. 9:1-9:60","address":"https://doi.org/10.1145/3374208","index":20},"https://doi.org/10.1145/3381915":{"title":"Yue Li, Tian Tan, Anders Møller, Yannis Smaragdakis: A Principled Approach to Selective Context Sensitivity for Pointer Analysis. 10:1-10:40","address":"https://doi.org/10.1145/3381915","index":21},"https://doi.org/10.1145/3387725":{"title":"Matías Toro, Ronald Garcia, Éric Tanter: Corrigendum to \"Type-driven Gradual Security with References, \" by Toro et al., ACM Transactions on Programming Languages and Systems (TOPLAS) Volume 40, Issue 4, Article No. 16. 11:1-11:2","address":"https://doi.org/10.1145/3387725","index":22},"https://doi.org/10.1145/3404846":{"title":"Abhinav Jangda, Uday Bondhugula: An Effective Fusion and Tile Size Model for PolyMage. 12:1-12:27","address":"https://doi.org/10.1145/3404846","index":23},"https://doi.org/10.1145/3410331":{"title":"Florian Frohn, Matthias Naaf, Marc Brockschmidt, Jürgen Giesl: Inferring Lower Runtime Bounds for Integer Programs. 13:1-13:50","address":"https://doi.org/10.1145/3410331","index":24},"https://doi.org/10.1145/3417516":{"title":"Michael J. Coblenz, Reed Oei, Tyler Etzel, Paulette Koronkevich, Miles Baker, Yannick Bloem, Brad A. Myers, Joshua Sunshine, Jonathan Aldrich: Obsidian: Typestate and Assets for Safer Blockchain Programming. 14:1-14:82","address":"https://doi.org/10.1145/3417516","index":25},"https://doi.org/10.1145/3421472":{"title":"Leandro T. C. Melo, Rodrigo Geraldo Ribeiro, Breno Campos Ferreira Guimarães, Fernando Magno Quintão Pereira: Type Inference for C: Applications to the Static Analysis of Incomplete Programs. 15:1-15:71","address":"https://doi.org/10.1145/3421472","index":26},"https://doi.org/10.1145/3418583":{"title":"Peizun Liu, Thomas Wahl, Thomas W. Reps: Interprocedural Context-Unbounded Program Analysis Using Observation Sequences. 16:1-16:34","address":"https://doi.org/10.1145/3418583","index":27},"https://doi.org/10.1145/3427201":{"title":"Janwillem Swalens, Joeri De Koster, Wolfgang De Meuter: Chocola: Composable Concurrency Language. 17:1-17:56","address":"https://doi.org/10.1145/3427201","index":28},"https://doi.org/10.1145/3430952":{"title":"Jiasi Shen, Martin C. Rinard: Active Learning for Inference and Regeneration of Applications that Access Databases. 18:1-18:119","address":"https://doi.org/10.1145/3430952","index":29},"https://doi.org/10.1145/3434489":{"title":"Abu Naser Masud, Björn Lisper: Semantic Correctness of Dependence-based Slicing for Interprocedural, Possibly Nonterminating Programs. 19:1-19:56","address":"https://doi.org/10.1145/3434489","index":30},"https://doi.org/10.1145/3229060":{"title":"Tiago Cogumbreiro, Raymond Hu, Francisco Martins, Nobuko Yoshida: Dynamic Deadlock Verification for General Barrier Synchronisation. 1:1-1:38","address":"https://doi.org/10.1145/3229060","index":31},"https://doi.org/10.1145/3230733":{"title":"Alexey Solovyev, Marek S. Baranowski, Ian Briggs, Charles Jacobsen, Zvonimir Rakamaric, Ganesh Gopalakrishnan: Rigorous Estimation of Floating-Point Round-Off Errors with Symbolic Taylor Expansions. 2:1-2:39","address":"https://doi.org/10.1145/3230733","index":32},"https://doi.org/10.1145/3282438":{"title":"Nicholas Jacek, Meng-Chieh Chiu, Benjamin M. Marlin, J. Eliot B. Moss: Optimal Choice of When to Garbage Collect. 3:1-3:35","address":"https://doi.org/10.1145/3282438","index":33},"https://doi.org/10.1145/3275519":{"title":"Leif Andersen, Vincent St-Amour, Jan Vitek, Matthias Felleisen: Feature-Specific Profiling. 4:1-4:34","address":"https://doi.org/10.1145/3275519","index":34},"https://doi.org/10.1145/3285955":{"title":"Rodolphe Lepigre, Christophe Raffalli: Practical Subtyping for Curry-Style Languages. 5:1-5:58","address":"https://doi.org/10.1145/3285955","index":35},"https://doi.org/10.1145/3293606":{"title":"Bozhen Liu, Jeff Huang, Lawrence Rauchwerger: Rethinking Incremental and Parallel Pointer Analysis. 6:1-6:31","address":"https://doi.org/10.1145/3293606","index":36},"https://doi.org/10.1145/3324782":{"title":"Andrew C. Myers: Editorial. 7:1","address":"https://doi.org/10.1145/3324782","index":37},"https://doi.org/10.1145/3230625":{"title":"Étienne Miquey: A Classical Sequent Calculus with Dependent Types. 8:1-8:47","address":"https://doi.org/10.1145/3230625","index":38},"https://doi.org/10.1145/3229062":{"title":"Luca Padovani: Context-Free Session Type Inference. 9:1-9:37","address":"https://doi.org/10.1145/3229062","index":39},"https://doi.org/10.1145/3293605":{"title":"Ugo Dal Lago, Charles Grellois: Probabilistic Termination by Monadic Affine Sized Typing. 10:1-10:65","address":"https://doi.org/10.1145/3293605","index":40},"https://doi.org/10.1145/3310338":{"title":"Conrad Cotton-Barratt, Andrzej S. Murawski, C.-H. Luke Ong: ML, Visibly Pushdown Class Memory Automata, and Extended Branching Vector Addition Systems with States. 11:1-11:38","address":"https://doi.org/10.1145/3310338","index":41},"https://doi.org/10.1145/3310337":{"title":"Matthew Hague, Anthony W. Lin, Chih-Duo Hong: CSS Minification via Constraint Solving. 12:1-12:76","address":"https://doi.org/10.1145/3310337","index":42},"https://doi.org/10.1145/3293607":{"title":"Minseok Jeon, Sehun Jeong, Sung Deok Cha, Hakjoo Oh: A Machine-Learning Algorithm with Disjunctive Model for Data-Driven Program Analysis. 13:1-13:41","address":"https://doi.org/10.1145/3293607","index":43},"https://doi.org/10.1145/3310340":{"title":"Leandro Facchinetti, Zachary Palmer, Scott F. Smith: Higher-order Demand-driven Program Analysis. 14:1-14:53","address":"https://doi.org/10.1145/3310340","index":44},"https://doi.org/10.1145/3332372":{"title":"David Grove, Sara S. Hamouda, Benjamin Herta, Arun Iyengar, Kiyokuni Kawachiya, Josh Milthorpe, Vijay A. Saraswat, Avraham Shinnar, Mikio Takeuchi, Olivier Tardieu: Failure Recovery in Resilient X10. 15:1-15:30","address":"https://doi.org/10.1145/3332372","index":45},"https://doi.org/10.1145/3337794":{"title":"Manas Thakur, V. Krishna Nandivada: PYE: A Framework for Precise-Yet-Efficient Just-In-Time Analyses for Java Programs. 16:1-16:37","address":"https://doi.org/10.1145/3337794","index":46},"https://doi.org/10.1145/3332373":{"title":"Roberto Castañeda Lozano, Mats Carlsson, Gabriel Hjort Blindell, Christian Schulte: Combinatorial Register Allocation and Instruction Scheduling. 17:1-17:53","address":"https://doi.org/10.1145/3332373","index":47},"https://doi.org/10.1145/3332371":{"title":"Fausto Spoto, Elisa Burato, Michael D. Ernst, Pietro Ferrara, Alberto Lovato, Damiano Macedonio, Ciprian Spiridon: Static Identification of Injection Attacks in Java. 18:1-18:58","address":"https://doi.org/10.1145/3332371","index":48},"https://doi.org/10.1145/3338497":{"title":"Andrea Rosà, Eduardo Rosales, Walter Binder: Analysis and Optimization of Task Granularity on the Java Virtual Machine. 19:1-19:47","address":"https://doi.org/10.1145/3338497","index":49},"https://doi.org/10.1145/3339984":{"title":"Krishnendu Chatterjee, Hongfei Fu, Amir Kafshdar Goharshady: Non-polynomial Worst-Case Analysis of Recursive Programs. 20:1-20:52","address":"https://doi.org/10.1145/3339984","index":50},"https://doi.org/10.1145/3340571":{"title":"Emery D. Berger, Celeste Hollenbeck, Petr Maj, Olga Vitek, Jan Vitek: On the Impact of Programming Languages on Code Quality: A Reproduction Study. 21:1-21:24","address":"https://doi.org/10.1145/3340571","index":51},"https://doi.org/10.1145/3350618":{"title":"Davide Sangiorgi, Valeria Vignudelli: Environmental Bisimulations for Probabilistic Higher-order Languages. 22:1-22:64","address":"https://doi.org/10.1145/3350618","index":52},"https://doi.org/10.1145/3363525":{"title":"Krishnendu Chatterjee, Amir Kafshdar Goharshady, Prateesh Goyal, Rasmus Ibsen-Jensen, Andreas Pavlogiannis: Faster Algorithms for Dynamic Algebraic Queries in Basic RSMs with Constant Treewidth. 23:1-23:46","address":"https://doi.org/10.1145/3363525","index":53},"https://doi.org/10.1145/3121136":{"title":"Hong-Yi Chen, Cristina David, Daniel Kroening, Peter Schrammel, Björn Wachter: Bit-Precise Procedure-Modular Termination Analysis. 1:1-1:38","address":"https://doi.org/10.1145/3121136","index":54},"https://doi.org/10.1145/3156016":{"title":"Friedrich Steimann: Constraint-Based Refactoring. 2:1-2:40","address":"https://doi.org/10.1145/3156016","index":55},"https://doi.org/10.1145/3156017":{"title":"Jacob Lidman, Sally A. McKee: Verifying Reliability Properties Using the Hyperball Abstract Domain. 3:1-3:29","address":"https://doi.org/10.1145/3156017","index":56},"https://doi.org/10.1145/3156018":{"title":"Federico Olmedo, Friedrich Gretz, Nils Jansen, Benjamin Lucien Kaminski, Joost-Pieter Katoen, Annabelle McIver: Conditioning in Probabilistic Programming. 4:1-4:50","address":"https://doi.org/10.1145/3156018","index":57},"https://doi.org/10.1145/3174802":{"title":"Cristina David, Pascal Kesseli, Daniel Kroening, Matt Lewis: Program Synthesis for Program Analysis. 5:1-5:45","address":"https://doi.org/10.1145/3174802","index":58},"https://doi.org/10.1145/3174801":{"title":"Anindya Banerjee, David A. Naumann, Mohammad Nikouei: A Logical Analysis of Framing for Specifications with Pure Method Calls. 6:1-6:90","address":"https://doi.org/10.1145/3174801","index":59},"https://doi.org/10.1145/3174800":{"title":"Krishnendu Chatterjee, Hongfei Fu, Petr Novotný, Rouzbeh Hasheminezhad: Algorithmic Analysis of Qualitative and Quantitative Termination Problems for Affine Probabilistic Programs. 7:1-7:45","address":"https://doi.org/10.1145/3174800","index":60},"https://doi.org/10.1145/3201898":{"title":"Matthias Grimmer, Roland Schatz, Chris Seaton, Thomas Würthinger, Mikel Luján: Cross-Language Interoperability in a Multi-Language Runtime. 8:1-8:43","address":"https://doi.org/10.1145/3201898","index":61},"https://doi.org/10.1145/3210257":{"title":"Krishnendu Chatterjee, Rasmus Ibsen-Jensen, Amir Kafshdar Goharshady, Andreas Pavlogiannis: Algorithms for Algebraic Path Properties in Concurrent Systems of Constant Treewidth Components. 9:1-9:43","address":"https://doi.org/10.1145/3210257","index":62},"https://doi.org/10.1145/3210256":{"title":"Spencer P. Florence, Burke Fetscher, Matthew Flatt, William H. Temps, Vincent St-Amour, Tina Kiguradze, Dennis P. West, Charlotte Niznik, Paul R. Yarnold, Robert Bruce Findler, Steven M. Belknap: POP-PL: A Patient-Oriented Prescription Programming Language. 10:1-10:37","address":"https://doi.org/10.1145/3210256","index":63},"https://doi.org/10.1145/3243871":{"title":"Andrew Myers: Editor's Foreword to \"Static Backward Slicing of Non-Deterministic Programs and Systems\".","address":"https://doi.org/10.1145/3243871","index":64},"https://doi.org/10.1145/2886098":{"title":"Sebastian Danicic, Michael R. Laurence: Static Backward Slicing of Non-deterministic Programs and Systems. 11:1-11:46","address":"https://doi.org/10.1145/2886098","index":65},"https://doi.org/10.1145/3210258":{"title":"Bart Jacobs, Dragan Bosnacki, Ruurd Kuiper: Modular Termination Verification of Single-Threaded and Multithreaded Programs. 12:1-12:59","address":"https://doi.org/10.1145/3210258","index":66},"https://doi.org/10.1145/3230624":{"title":"Se-Won Kim, Xavier Rival, Sukyoung Ryu: A Theoretical Foundation of Sensitivity in an Abstract Interpretation Framework. 13:1-13:44","address":"https://doi.org/10.1145/3230624","index":67},"https://doi.org/10.1145/3121135":{"title":"Kihong Heo, Hakjoo Oh, Hongseok Yang, Kwangkeun Yi: Adaptive Static Analysis via Learning with Bayesian Optimization. 14:1-14:37","address":"https://doi.org/10.1145/3121135","index":68},"https://doi.org/10.1145/3226225":{"title":"Tomoharu Ugawa, Carl G. Ritson, Richard E. Jones: Transactional Sapphire: Lessons in High-Performance, On-the-fly Garbage Collection. 15:1-15:56","address":"https://doi.org/10.1145/3226225","index":69},"https://doi.org/10.1145/3229061":{"title":"Matías Toro, Ronald Garcia, Éric Tanter: Type-Driven Gradual Security with References. 16:1-16:55","address":"https://doi.org/10.1145/3229061","index":70},"https://doi.org/10.1145/3242173":{"title":"Bernardo Toninho, Nobuko Yoshida: Interconnectability of Session-Based Logical Processes. 17:1-17:42","address":"https://doi.org/10.1145/3242173","index":71},"https://doi.org/10.1145/3283723":{"title":"Corrigendum to \"Cross-Language Interoperability in a Multi-Language Runtime\", by Grimmer et al., ACM Transactions on Programming Languages and Systems (TOPLAS) Volume 40, Issue 2, Article No. 8. 18:1","address":"https://doi.org/10.1145/3283723","index":72},"https://doi.org/10.1145/3052720":{"title":"Andrew Myers: Foreword. 1:1","address":"https://doi.org/10.1145/3052720","index":73},"https://doi.org/10.1145/2994597":{"title":"Nachshon Cohen, Erez Petrank: Limitations of Partial Compaction: Towards Practical Bounds. 2:1-2:44","address":"https://doi.org/10.1145/2994597","index":74},"https://doi.org/10.1145/2994594":{"title":"Taro Sekiyama, Atsushi Igarashi, Michael Greenberg: Polymorphic Manifest Contracts, Revised and Resolved. 3:1-3:36","address":"https://doi.org/10.1145/2994594","index":75},"https://doi.org/10.1145/2994596":{"title":"Jay Ligatti, Jeremy Blackburn, Michael Nachtigal: On Subtyping-Relation Completeness, with an Application to Iso-Recursive Types. 4:1-4:36","address":"https://doi.org/10.1145/2994596","index":76},"https://doi.org/10.1145/3039207":{"title":"Martin Hirzel, Scott Schneider, Bugra Gedik: SPL: An Extensible Language for Distributed Stream Processing. 5:1-5:39","address":"https://doi.org/10.1145/3039207","index":77},"https://doi.org/10.1145/2994593":{"title":"Jade Alglave, Daniel Kroening, Vincent Nimal, Daniel Poetzl: Don't Sit on the Fence: A Static Analysis Approach to Automatic Fence Insertion. 6:1-6:38","address":"https://doi.org/10.1145/2994593","index":78},"https://doi.org/10.1145/3014427":{"title":"Marie-Christine Jakobs, Heike Wehrheim: Programs from Proofs: A Framework for the Safe Execution of Untrusted Software. 7:1-7:56","address":"https://doi.org/10.1145/3014427","index":79},"https://doi.org/10.1145/3014426":{"title":"Eva Darulova, Viktor Kuncak: Towards a Compiler for Reals. 8:1-8:28","address":"https://doi.org/10.1145/3014426","index":80},"https://doi.org/10.1145/3024084":{"title":"Thomas W. Reps, Emma Turetsky, Prathmesh Prabhu: Newtonian Program Analysis via Tensor Product. 9:1-9:72","address":"https://doi.org/10.1145/3024084","index":81},"https://doi.org/10.1145/3024086":{"title":"Thomas H. Austin, Thomas Schmitz, Cormac Flanagan: Multiple Facets for Dynamic Information Flow with Exceptions. 10:1-10:56","address":"https://doi.org/10.1145/3024086","index":82},"https://doi.org/10.1145/3064850":{"title":"Colin S. Gordon, Michael D. Ernst, Dan Grossman, Matthew J. Parkinson: Verifying Invariants of Lock-Free Data Structures with Rely-Guarantee and Refinement Types. 11:1-11:54","address":"https://doi.org/10.1145/3064850","index":83},"https://doi.org/10.1145/2994595":{"title":"Yanhong A. Liu, Scott D. Stoller, Bo Lin: From Clarity to Efficiency for Distributed Algorithms. 12:1-12:41","address":"https://doi.org/10.1145/2994595","index":84},"https://doi.org/10.1145/3064849":{"title":"Silvia Crafa, Luca Padovani: The Chemical Approach to Typestate-Oriented Programming. 13:1-13:45","address":"https://doi.org/10.1145/3064849","index":85},"https://doi.org/10.1145/3064848":{"title":"Jacques-Henri Jourdan, François Pottier: A Simple, Possibly Correct LR Parser for C11. 14:1-14:36","address":"https://doi.org/10.1145/3064848","index":86},"https://doi.org/10.1145/3095075":{"title":"Vojtech Forejt, Saurabh Joshi, Daniel Kroening, Ganesh Narayanaswamy, Subodh Sharma: Precise Predictive Analysis for Discovering Communication Deadlocks in MPI Programs. 15:1-15:27","address":"https://doi.org/10.1145/3095075","index":87},"https://doi.org/10.1145/3095021":{"title":"Woosuk Lee, Wonchan Lee, Dongok Kang, Kihong Heo, Hakjoo Oh, Kwangkeun Yi: Sound Non-Statistical Clustering of Static Analysis Alarms. 16:1-16:35","address":"https://doi.org/10.1145/3095021","index":88},"https://doi.org/10.1145/3107937":{"title":"Phil Trinder, Natalia Chechina, Nikolaos Papaspyrou, Konstantinos Sagonas, Simon J. Thompson, Stephen Adams, Stavros Aronis, Robert Baker, Eva Bihari, Olivier Boudeville, Francesco Cesarini, Maurizio Di Stefano, Sverker Eriksson, Viktoria Fordós, Amir Ghaffari, Aggelos Giantsios, Rickard Green, Csaba Hoch, David Klaftenegger, Huiqing Li, Kenneth Lundin, Kenneth MacKenzie, Katerina Roukounaki, Yiannis Tsiouris, Kjell Winblad: Scaling Reliably: Improving the Scalability of the Erlang Distributed Actor Platform. 17:1-17:46","address":"https://doi.org/10.1145/3107937","index":89},"https://doi.org/10.1145/3121137":{"title":"Danfeng Zhang, Andrew C. Myers, Dimitrios Vytiniotis, Simon L. Peyton Jones: SHErrLoc: A Static Holistic Error Locator. 18:1-18:47","address":"https://doi.org/10.1145/3121137","index":90},"https://doi.org/10.1145/2791292":{"title":"Loris D'Antoni, Margus Veanes, Benjamin Livshits, David Molnar: Fast: A Transducer-Based Language for Tree Manipulation. 1:1-1:32","address":"https://doi.org/10.1145/2791292","index":91},"https://doi.org/10.1145/2794078":{"title":"Dariusz Biernacki, Olivier Danvy, Kevin Millikin: A Dynamic Continuation-Passing Style for Dynamic Delimited Continuations. 2:1-2:25","address":"https://doi.org/10.1145/2794078","index":92},"https://doi.org/10.1145/2812805":{"title":"Nils Gesbert, Pierre Genevès, Nabil Layaïda: A Logical Approach to Deciding Semantic Subtyping. 3:1-3:31","address":"https://doi.org/10.1145/2812805","index":93},"https://doi.org/10.1145/2818638":{"title":"Mike Dodds, Suresh Jagannathan, Matthew J. Parkinson, Kasper Svendsen, Lars Birkedal: Verifying Custom Synchronization Constructs Using Higher-Order Separation Logic. 4:1-4:72","address":"https://doi.org/10.1145/2818638","index":94},"https://doi.org/10.1145/2821505":{"title":"Paraskevas Yiapanis, Gavin Brown, Mikel Luján: Compiler-Driven Software Speculation for Thread-Level Parallelism. 5:1-5:45","address":"https://doi.org/10.1145/2821505","index":95},"https://doi.org/10.1145/2821504":{"title":"Hakjoo Oh, Wonchan Lee, Kihong Heo, Hongseok Yang, Kwangkeun Yi: Selective X-Sensitive Analysis Guided by Impact Pre-Analysis. 6:1-6:45","address":"https://doi.org/10.1145/2821504","index":96},"https://doi.org/10.1145/2853131":{"title":"Stefano Dissegna, Francesco Logozzo, Francesco Ranzato: An Abstract Interpretation-Based Model of Tracing Just-in-Time Compilation. 7:1-7:50","address":"https://doi.org/10.1145/2853131","index":97},"https://doi.org/10.1145/2888392":{"title":"Sukyoung Ryu: ThisType for Object-Oriented Languages: From Theory to Practice. 8:1-8:66","address":"https://doi.org/10.1145/2888392","index":98},"https://doi.org/10.1145/2866576":{"title":"Gregor Wagner, Per Larsen, Stefan Brunthaler, Michael Franz: Thinking Inside the Box: Compartmentalized Garbage Collection. 9:1-9:37","address":"https://doi.org/10.1145/2866576","index":99},"https://doi.org/10.1145/2806886":{"title":"Brian Norris, Brian Demsky: A Practical Approach for Model Checking C/C++11 Code. 10:1-10:51","address":"https://doi.org/10.1145/2806886","index":100},"https://doi.org/10.1145/2845078":{"title":"Somashekaracharya G. Bhaskaracharya, Uday Bondhugula, Albert Cohen: Automatic Storage Optimization for Arrays. 11:1-11:23","address":"https://doi.org/10.1145/2845078","index":101},"https://doi.org/10.1145/2896389":{"title":"Uday Bondhugula, Aravind Acharya, Albert Cohen: The Pluto+ Algorithm: A Practical Approach for Parallelization and Locality Optimization of Affine Loop Nests. 12:1-12:32","address":"https://doi.org/10.1145/2896389","index":102},"http://dl.acm.org/citation.cfm?id=2866575":{"title":"Marc Brockschmidt, Fabian Emmes, Stephan Falke, Carsten Fuhs, Jürgen Giesl: Analyzing Runtime and Size Complexity of Integer Programs. 13:1-13:50","address":"http://dl.acm.org/citation.cfm?id=2866575","index":103},"http://dl.acm.org/citation.cfm?id=2837022":{"title":"Thibaut Balabonski, François Pottier, Jonathan Protzenko: The Design and Formalization of Mezzo, a Permission-Based Programming Language. 14:1-14:94","address":"http://dl.acm.org/citation.cfm?id=2837022","index":104},"http://dl.acm.org/citation.cfm?id=2983574":{"title":"Stephen M. Blackburn, Amer Diwan, Matthias Hauswirth, Peter F. Sweeney, José Nelson Amaral, Tim Brecht, Lubomír Bulej, Cliff Click, Lieven Eeckhout, Sebastian Fischmeister, Daniel Frampton, Laurie J. Hendren, Michael Hind, Antony L. Hosking, Richard E. Jones, Tomas Kalibera, Nathan Keynes, Nathaniel Nystrom, Andreas Zeller: The Truth, The Whole Truth, and Nothing But the Truth: A Pragmatic Guide to Assessing Empirical Evaluations. 15:1-15:20","address":"http://dl.acm.org/citation.cfm?id=2983574","index":105},"http://dl.acm.org/citation.cfm?id=2925988":{"title":"Daniel Marino, Abhayendra Singh, Todd D. Millstein, Madanlal Musuvathi, Satish Narayanasamy: DRFx: An Understandable, High Performance, and Flexible Memory Model for Concurrent Languages. 16:1-16:40","address":"http://dl.acm.org/citation.cfm?id=2925988","index":106},"https://doi.org/10.1145/2683389":{"title":"Jens Palsberg: Editorial. 1e:1","address":"https://doi.org/10.1145/2683389","index":107},"https://doi.org/10.1145/2651360":{"title":"Graeme Gange, Jorge A. Navas, Peter Schachte, Harald Søndergaard, Peter J. Stuckey: Interval Analysis and Machine Arithmetic: Why Signedness Ignorance Is Bliss. 1:1-1:35","address":"https://doi.org/10.1145/2651360","index":108},"https://doi.org/10.1145/2658993":{"title":"Tony Nowatzki, Michael Sartin-Tarm, Lorenzo De Carli, Karthikeyan Sankaralingam, Cristian Estan, Behnam Robatmili: A Scheduling Framework for Spatial Architectures Across Multiple Constraint-Solving Theories. 2:1-2:30","address":"https://doi.org/10.1145/2658993","index":109},"https://doi.org/10.1145/2623200":{"title":"Camil Demetrescu, Irene Finocchi, Andrea Ribichini: Reactive Imperative Programming with Dataflow Constraints. 3:1-3:53","address":"https://doi.org/10.1145/2623200","index":110},"https://doi.org/10.1145/2638548":{"title":"Donald E. Porter, Michael D. Bond, Indrajit Roy, Kathryn S. McKinley, Emmett Witchel: Practical Fine-Grained Information Flow Control Using Laminar. 4:1-4:51","address":"https://doi.org/10.1145/2638548","index":111},"https://doi.org/10.1145/2665073":{"title":"Michael Frechtling, Philip Heng Wai Leong: MCALIB: Measuring Sensitivity to Rounding Error with Monte Carlo Programming. 5:1-5:25","address":"https://doi.org/10.1145/2665073","index":112},"https://doi.org/10.1145/2699503":{"title":"Marco Patrignani, Pieter Agten, Raoul Strackx, Bart Jacobs, Dave Clarke, Frank Piessens: Secure Compilation to Protected Module Architectures. 6:1-6:50","address":"https://doi.org/10.1145/2699503","index":113},"https://doi.org/10.1145/2701415":{"title":"Andrew W. Appel: Verification of a Cryptographic Primitive: SHA-256. 7:1-7:31","address":"https://doi.org/10.1145/2701415","index":114},"https://doi.org/10.1145/2734118":{"title":"Baris Kasikci, Cristian Zamfir, George Candea: Automated Classification of Data Races Under Both Strong and Weak Memory Models. 8:1-8:44","address":"https://doi.org/10.1145/2734118","index":115},"https://doi.org/10.1145/2734117":{"title":"Farn Wang, Sven Schewe, Chung-Hao Huang: An Extension of ATL with Strategy Interaction. 9:1-9:41","address":"https://doi.org/10.1145/2734117","index":116},"https://doi.org/10.1145/2743017":{"title":"Adam Betts, Nathan Chong, Alastair F. Donaldson, Jeroen Ketema, Shaz Qadeer, Paul Thomson, John Wickerson: The Design and Implementation of a Verification Technique for GPU Kernels. 10:1-10:49","address":"https://doi.org/10.1145/2743017","index":117},"https://doi.org/10.1145/2743018":{"title":"Michele Bugliesi, Stefano Calzavara, Fabienne Eigner, Matteo Maffei: Affine Refinement Types for Secure Distributed Programming. 11:1-11:66","address":"https://doi.org/10.1145/2743018","index":118},"https://doi.org/10.1145/2743016":{"title":"Tobias Grosser, Sven Verdoolaege, Albert Cohen: Polyhedral AST Generation Is More Than Scanning Polyhedra. 12:1-12:50","address":"https://doi.org/10.1145/2743016","index":119},"https://doi.org/10.1145/2766446":{"title":"Gary T. Leavens, David A. Naumann: Behavioral Subtyping, Specification Inheritance, and Modular Reasoning. 13:1-13:88","address":"https://doi.org/10.1145/2766446","index":120},"https://doi.org/10.1145/2518190":{"title":"Sheng Chen, Martin Erwig, Eric Walkingshaw: Extending Type Inference to Variational Programs. 1:1-1:54","address":"https://doi.org/10.1145/2518190","index":121},"https://doi.org/10.1145/2543920":{"title":"Sven Stork, Karl Naden, Joshua Sunshine, Manuel Mohr, Alcides Fonseca, Paulo Marques, Jonathan Aldrich: Æminium: A Permission-Based Concurrent-by-Default Programming Language Approach. 2:1-2:42","address":"https://doi.org/10.1145/2543920","index":122},"https://doi.org/10.1145/2576235":{"title":"Hongjin Liang, Xinyu Feng, Ming Fu: Rely-Guarantee-Based Simulation for Compositional Verification of Concurrent Program Transformations. 3:1-3:55","address":"https://doi.org/10.1145/2576235","index":123},"https://doi.org/10.1145/2579080":{"title":"Gilles Barthe, Delphine Demange, David Pichardie: Formal Verification of an SSA-Based Middle-End for CompCert. 4:1-4:35","address":"https://doi.org/10.1145/2579080","index":124},"https://doi.org/10.1145/2566620":{"title":"Min Aung, Susan Horwitz, Richard Joiner, Thomas W. Reps: Specialization Slicing. 5:1-5:67","address":"https://doi.org/10.1145/2566620","index":125},"https://doi.org/10.1145/2601339":{"title":"Suresh Jagannathan, Vincent Laporte, Gustavo Petri, David Pichardie, Jan Vitek: Atomicity Refinement for Verified Compilation. 6:1-6:30","address":"https://doi.org/10.1145/2601339","index":126},"https://doi.org/10.1145/2627752":{"title":"Jade Alglave, Luc Maranget, Michael Tautschnig: Herding Cats: Modelling, Simulation, Testing, and Data Mining for Weak Memory. 7:1-7:74","address":"https://doi.org/10.1145/2627752","index":127},"https://doi.org/10.1145/2590811":{"title":"Hakjoo Oh, Kihong Heo, Wonchan Lee, Woosuk Lee, Daejun Park, Jeehoon Kang, Kwangkeun Yi: Global Sparse Analysis Framework. 8:1-8:44","address":"https://doi.org/10.1145/2590811","index":128},"https://doi.org/10.1145/2629644":{"title":"Javier Esparza, Pierre Ganty, Tomás Poch: Pattern-Based Verification for Multithreaded Programs. 9:1-9:29","address":"https://doi.org/10.1145/2629644","index":129},"https://doi.org/10.1145/2629643":{"title":"Alexandros Tzannes, George C. Caragea, Uzi Vishkin, Rajeev Barua: Lazy Scheduling: A Runtime Adaptive Scheduler for Declarative Parallelism. 10:1-10:51","address":"https://doi.org/10.1145/2629643","index":130},"https://doi.org/10.1145/2651361":{"title":"Matt Elder, Junghee Lim, Tushar Sharma, Tycho Andersen, Thomas W. Reps: Abstract Domains of Affine Relations. 11:1-11:73","address":"https://doi.org/10.1145/2651361","index":131},"https://doi.org/10.1145/2629609":{"title":"Ronald Garcia, Éric Tanter, Roger Wolff, Jonathan Aldrich: Foundations of Typestate-Oriented Programming. 12:1-12:44","address":"https://doi.org/10.1145/2629609","index":132},"https://doi.org/10.1145/2629460":{"title":"Christopher M. Hayden, Karla Saur, Edward K. Smith, Michael W. Hicks, Jeffrey S. Foster: Kitsune: Efficient, General-Purpose Dynamic Software Updating for C. 13:1-13:38","address":"https://doi.org/10.1145/2629460","index":133},"https://doi.org/10.1145/2629608":{"title":"Alexander Kaiser, Daniel Kroening, Thomas Wahl: A Widening Approach to Multithreaded Program Verification. 14:1-14:29","address":"https://doi.org/10.1145/2629608","index":134},"https://doi.org/10.1145/2450136.2450141":{"title":"Jens Palsberg: Editorial. 1:1","address":"https://doi.org/10.1145/2450136.2450141","index":135},"https://doi.org/10.1145/2450136.2450137":{"title":"Andreas Rossberg, Derek Dreyer: Mixin' Up the ML Module System. 2:1-2:84","address":"https://doi.org/10.1145/2450136.2450137","index":136},"https://doi.org/10.1145/2450136.2450138":{"title":"V. Krishna Nandivada, Jun Shirako, Jisheng Zhao, Vivek Sarkar: A Transformation Framework for Optimizing Task-Parallel Programs. 3:1-3:48","address":"https://doi.org/10.1145/2450136.2450138","index":137},"https://doi.org/10.1145/2450136.2450139":{"title":"Junghee Lim, Thomas W. Reps: TSL: A System for Generating Abstract Interpreters and its Application to Machine-Code Analysis. 4:1-4:59","address":"https://doi.org/10.1145/2450136.2450139","index":138},"https://doi.org/10.1145/2450136.2450140":{"title":"Stefan Staiger-Stöhr: Practical Integrated Analysis of Pointers, Dataflow and Control Flow. 5:1-5:48","address":"https://doi.org/10.1145/2450136.2450140","index":139},"https://doi.org/10.1145/2491522.2491523":{"title":"Aleksandar Nanevski, Anindya Banerjee, Deepak Garg: Dependent Type Theory for Verification of Information Flow and Access Control Policies. 6:1-6:41","address":"https://doi.org/10.1145/2491522.2491523","index":140},"https://doi.org/10.1145/2491522.2491524":{"title":"David W. Binkley, Nicolas Gold, Mark Harman, Syed S. Islam, Jens Krinke, Zheng Li: Efficient Identification of Linchpin Vertices in Dependence Clusters. 7:1-7:35","address":"https://doi.org/10.1145/2491522.2491524","index":141},"https://doi.org/10.1145/2491522.2491525":{"title":"Matko Botincan, Mike Dodds, Suresh Jagannathan: Proof-Directed Parallelization Synthesis by Separation Logic. 8:1-8:60","address":"https://doi.org/10.1145/2491522.2491525","index":142},"https://doi.org/10.1145/2492061":{"title":"Gilles Barthe, Boris Köpf, Federico Olmedo, Santiago Zanella Béguelin: Probabilistic Relational Reasoning for Differential Privacy. 9:1-9:49","address":"https://doi.org/10.1145/2492061","index":143},"https://doi.org/10.1145/2518188":{"title":"Ahmed Bouajjani, Michael Emmi: Analysis of Recursively Parallel Programs. 10:1-10:49","address":"https://doi.org/10.1145/2518188","index":144},"https://doi.org/10.1145/2518189":{"title":"T. Stephen Strickland, Christos Dimoulas, Asumu Takikawa, Matthias Felleisen: Contracts for First-Class Classes. 11:1-11:58","address":"https://doi.org/10.1145/2518189","index":145},"https://doi.org/10.1145/2518191":{"title":"Andreas Lochbihler: Making the java memory model safe. 12:1-12:65","address":"https://doi.org/10.1145/2518191","index":146},"https://doi.org/10.1145/2523815":{"title":"Diogo Sampaio, Rafael Martins de Souza, Sylvain Collange, Fernando Magno Quintão Pereira: Divergence analysis. 13:1-13:36","address":"https://doi.org/10.1145/2523815","index":147},"https://doi.org/10.1145/2529990":{"title":"Durica Nikolic, Fausto Spoto: Reachability analysis of program variables. 14:1-14:68","address":"https://doi.org/10.1145/2529990","index":148},"https://doi.org/10.1145/2160910.2180860":{"title":"Jens Palsberg: Editorial. 1:1","address":"https://doi.org/10.1145/2160910.2180860","index":149},"https://doi.org/10.1145/2160910.2160911":{"title":"Jan Smans, Bart Jacobs, Frank Piessens: Implicit dynamic frames. 2:1-2:58","address":"https://doi.org/10.1145/2160910.2160911","index":150},"https://doi.org/10.1145/2160910.2160912":{"title":"Lakshminarayanan Renganarayanan, DaeGon Kim, Michelle Mills Strout, Sanjay V. Rajopadhye: Parameterized loop tiling. 3:1-3:41","address":"https://doi.org/10.1145/2160910.2160912","index":151},"https://doi.org/10.1145/2160910.2160913":{"title":"Julian Dolby, Christian Hammer, Daniel Marino, Frank Tip, Mandana Vaziri, Jan Vitek: A data-centric approach to synchronization. 4:1-4:48","address":"https://doi.org/10.1145/2160910.2160913","index":152},"https://doi.org/10.1145/2160910.2160914":{"title":"Xing Wu, Frank Mueller: ScalaExtrap: Trace-based communication extrapolation for SPMD programs. 5:1-5:29","address":"https://doi.org/10.1145/2160910.2160914","index":153},"https://doi.org/10.1145/2160910.2160915":{"title":"Pierre Ganty, Rupak Majumdar: Algorithmic verification of asynchronous programs. 6:1-6:48","address":"https://doi.org/10.1145/2160910.2160915","index":154},"https://doi.org/10.1145/2220365.2220366":{"title":"Eric Bodden, Patrick Lam, Laurie J. Hendren: Partially Evaluating Finite-State Runtime Monitors Ahead of Time. 7:1-7:52","address":"https://doi.org/10.1145/2220365.2220366","index":155},"https://doi.org/10.1145/2220365.2220367":{"title":"Marco Carbone, Kohei Honda, Nobuko Yoshida: Structured Communication-Centered Programming for Web Services. 8:1-8:78","address":"https://doi.org/10.1145/2220365.2220367","index":156},"https://doi.org/10.1145/2220365.2220368":{"title":"Pramod G. Joisha, Robert S. Schreiber, Prithviraj Banerjee, Hans-Juergen Boehm, Dhruva R. Chakrabarti: On a Technique for Transparently Empowering Classical Compiler Optimizations on Multithreaded Code. 9:1-9:42","address":"https://doi.org/10.1145/2220365.2220368","index":157},"https://doi.org/10.1145/2220365.2220369":{"title":"Gérard Boudol, Zhengqin Luo, Tamara Rezk, Manuel Serrano: Reasoning about Web Applications: An Operational Semantics for HOP. 10:1-10:40","address":"https://doi.org/10.1145/2220365.2220369","index":158},"https://doi.org/10.1145/2362389.2362390":{"title":"Sven Verdoolaege, Gerda Janssens, Maurice Bruynooghe: Equivalence checking of static affine programs using widening to handle recurrences. 11:1-11:35","address":"https://doi.org/10.1145/2362389.2362390","index":159},"https://doi.org/10.1145/2362389.2362391":{"title":"Bruno De Fraine, Erik Ernst, Mario Südholt: Essential AOP: The a calculus. 12:1-12:43","address":"https://doi.org/10.1145/2362389.2362391","index":160},"https://doi.org/10.1145/2362389.2362392":{"title":"Anna Bendersky, Erez Petrank: Space overhead bounds for dynamic memory management with partial compaction. 13:1-13:43","address":"https://doi.org/10.1145/2362389.2362392","index":161},"https://doi.org/10.1145/2362389.2362393":{"title":"Jan Hoffmann, Klaus Aehlig, Martin Hofmann: Multivariate amortized resource analysis. 14:1-14:62","address":"https://doi.org/10.1145/2362389.2362393","index":162},"https://doi.org/10.1145/2400676.2400678":{"title":"Maartje de Jonge, Lennart C. L. Kats, Eelco Visser, Emma Söderberg: Natural and Flexible Error Recovery for Generated Modular Language Environments. 15:1-15:50","address":"https://doi.org/10.1145/2400676.2400678","index":163},"https://doi.org/10.1145/2400676.2400679":{"title":"Amir M. Ben-Amram, Samir Genaim, Abu Naser Masud: On the Termination of Integer Loops. 16:1-16:24","address":"https://doi.org/10.1145/2400676.2400679","index":164},"https://doi.org/10.1145/2400676.2400680":{"title":"Yuan Feng, Runyao Duan, Mingsheng Ying: Bisimulation for Quantum Processes. 17:1-17:43","address":"https://doi.org/10.1145/2400676.2400680","index":165},"https://doi.org/10.1145/1889997.1889998":{"title":"Jens Palsberg: Editorial. 1:1","address":"https://doi.org/10.1145/1889997.1889998","index":166},"https://doi.org/10.1145/1889997.1889999":{"title":"Martín Abadi, Andrew Birrell, Tim Harris, Michael Isard: Semantics of transactional memory and automatic mutual exclusion. 2:1-2:50","address":"https://doi.org/10.1145/1889997.1889999","index":167},"https://doi.org/10.1145/1889997.1890000":{"title":"Polyvios Pratikakis, Jeffrey S. Foster, Michael Hicks: LOCKSMITH: Practical static race detection for C. 3:1-3:55","address":"https://doi.org/10.1145/1889997.1890000","index":168},"https://doi.org/10.1145/1889997.1890001":{"title":"John Derrick, Gerhard Schellhorn, Heike Wehrheim: Mechanically verified proof obligations for linearizability. 4:1-4:43","address":"https://doi.org/10.1145/1889997.1890001","index":169},"https://doi.org/10.1145/1889997.1890002":{"title":"Davide Sangiorgi, Naoki Kobayashi, Eijiro Sumii: Environmental bisimulations for higher-order languages. 5:1-5:69","address":"https://doi.org/10.1145/1889997.1890002","index":170},"https://doi.org/10.1145/1890028.1890029":{"title":"Shan Shan Huang, Yannis Smaragdakis: Morphing: Structurally shaping a class by reflecting on others. 6:1-6:44","address":"https://doi.org/10.1145/1890028.1890029","index":171},"https://doi.org/10.1145/1890028.1890030":{"title":"Jürgen Giesl, Matthias Raffelsieper, Peter Schneider-Kamp, Stephan Swiderski, René Thiemann: Automated termination proofs for haskell by term rewriting. 7:1-7:39","address":"https://doi.org/10.1145/1890028.1890030","index":172},"https://doi.org/10.1145/1890028.1890031":{"title":"Jesper Bengtson, Karthikeyan Bhargavan, Cédric Fournet, Andrew D. Gordon, Sergio Maffeis: Refinement types for secure implementations. 8:1-8:45","address":"https://doi.org/10.1145/1890028.1890031","index":173},"https://doi.org/10.1145/1961204.1961205":{"title":"Frank Tip, Robert M. Fuhrer, Adam Kiezun, Michael D. Ernst, Ittai Balaban, Bjorn De Sutter: Refactoring using type constraints. 9:1-9:47","address":"https://doi.org/10.1145/1961204.1961205","index":174},"https://doi.org/10.1145/1961204.1961206":{"title":"Utpal Banerjee: Mathematical foundation of trace scheduling. 10:1-10:24","address":"https://doi.org/10.1145/1961204.1961206","index":175},"https://doi.org/10.1145/1961204.1961207":{"title":"Thomas Martin Gawlitza, Helmut Seidl: Solving systems of rational equations through strategy iteration. 11:1-11:48","address":"https://doi.org/10.1145/1961204.1961207","index":176},"https://doi.org/10.1145/1985342.1985343":{"title":"Stefan Wehr, Peter Thiemann: JavaGI: The Interaction of Type Classes with Interfaces and Inheritance. 12:1-12:83","address":"https://doi.org/10.1145/1985342.1985343","index":177},"https://doi.org/10.1145/1985342.1985344":{"title":"Gilles Barthe, César Kunz: An Abstract Model of Certificate Translation. 13:1-13:46","address":"https://doi.org/10.1145/1985342.1985344","index":178},"https://doi.org/10.1145/1985342.1985345":{"title":"Stavros Tripakis, Ben Lickly, Thomas A. Henzinger, Edward A. Lee: A Theory of Synchronous Relational Interfaces. 14:1-14:41","address":"https://doi.org/10.1145/1985342.1985345","index":179},"https://doi.org/10.1145/2039346.2039347":{"title":"Rajeev Alur, Swarat Chaudhuri, P. Madhusudan: Software model checking using languages of nested trees. 15:1-15:45","address":"https://doi.org/10.1145/2039346.2039347","index":180},"https://doi.org/10.1145/2039346.2039348":{"title":"Christos Dimoulas, Matthias Felleisen: On contract satisfaction in a higher-order world. 16:1-16:29","address":"https://doi.org/10.1145/2039346.2039348","index":181},"https://doi.org/10.1145/2039346.2039349":{"title":"Bhargav S. Gulavani, Supratik Chakraborty, G. Ramalingam, Aditya V. Nori: Bottom-up shape analysis using LISF. 17:1-17:41","address":"https://doi.org/10.1145/2039346.2039349","index":182},"https://doi.org/10.1145/2049706.2049707":{"title":"Jens Palsberg: Editorial note. 18:1","address":"https://doi.org/10.1145/2049706.2049707","index":183},"https://doi.org/10.1145/2049706.2049708":{"title":"Mingsheng Ying: Floyd-hoare logic for quantum programs. 19:1-19:49","address":"https://doi.org/10.1145/2049706.2049708","index":184},"https://doi.org/10.1145/2049706.2049709":{"title":"Werner Dietl, Sophia Drossopoulou, Peter Müller: Separating ownership topology and encapsulation with generic universe types. 20:1-20:62","address":"https://doi.org/10.1145/2049706.2049709","index":185},"https://doi.org/10.1145/2049706.2049710":{"title":"Andrea Flexeder, Markus Müller-Olm, Michael Petter, Helmut Seidl: Fast interprocedural linear two-variable equalities. 21:1-21:33","address":"https://doi.org/10.1145/2049706.2049710","index":186},"https://doi.org/10.1145/1596527.1596528":{"title":"Mark Harman, David W. Binkley, Keith B. Gallagher, Nicolas Gold, Jens Krinke: Dependence clusters in source code. 1:1-1:33","address":"https://doi.org/10.1145/1596527.1596528","index":187},"https://doi.org/10.1145/1596527.1596529":{"title":"Haruo Hosoya, Alain Frisch, Giuseppe Castagna: Parametric polymorphism for XML. 2:1-2:56","address":"https://doi.org/10.1145/1596527.1596529","index":188},"https://doi.org/10.1145/1596527.1596530":{"title":"Umut A. Acar, Guy E. Blelloch, Matthias Blume, Robert Harper, Kanat Tangwongsan: An experimental analysis of self-adjusting computation. 3:1-3:53","address":"https://doi.org/10.1145/1596527.1596530","index":189},"https://doi.org/10.1145/1667048.1667049":{"title":"Shane Markstrum, Daniel Marino, Matthew Esquivel, Todd D. Millstein, Chris Andreae, James Noble: JavaCOP: Declarative pluggable types for java. 4:1-4:37","address":"https://doi.org/10.1145/1667048.1667049","index":190},"https://doi.org/10.1145/1667048.1667050":{"title":"Bertrand Jeannet, Alexey Loginov, Thomas W. Reps, Mooly Sagiv: A relational approach to interprocedural shape analysis. 5:1-5:52","address":"https://doi.org/10.1145/1667048.1667050","index":191},"https://doi.org/10.1145/1667048.1667051":{"title":"Kenneth Knowles, Cormac Flanagan: Hybrid type checking. 6:1-6:34","address":"https://doi.org/10.1145/1667048.1667051","index":192},"https://doi.org/10.1145/1709093.1709094":{"title":"Amal Ahmed, Andrew W. Appel, Christopher D. Richards, Kedar N. Swadi, Gang Tan, Daniel C. Wang: Semantic foundations for typed assembly languages. 7:1-7:67","address":"https://doi.org/10.1145/1709093.1709094","index":193},"https://doi.org/10.1145/1709093.1709095":{"title":"Fausto Spoto, Fred Mesnard, Étienne Payet: A termination analyzer for Java bytecode based on path-length. 8:1-8:70","address":"https://doi.org/10.1145/1709093.1709095","index":194},"https://doi.org/10.1145/1709093.1709096":{"title":"Rob van Nieuwpoort, Gosia Wrzesinska, Ceriel J. H. Jacobs, Henri E. Bal: Satin: A high-level and efficient grid programming model. 9:1-9:39","address":"https://doi.org/10.1145/1709093.1709096","index":195},"https://doi.org/10.1145/1734206.1734207":{"title":"Kathryn S. McKinley, Keshav Pingali: La dolce vita at TOPLAS. 10:1-10:6","address":"https://doi.org/10.1145/1734206.1734207","index":196},"https://doi.org/10.1145/1734206.1734208":{"title":"Xiaotong Zhuang, Santosh Pande: An optimization framework for embedded processors with auto-addressing mode. 11:1-11:41","address":"https://doi.org/10.1145/1734206.1734208","index":197},"https://doi.org/10.1145/1734206.1734209":{"title":"Peter Sewell, Pawel T. Wojciechowski, Asis Unyapoth: Nomadic pict: Programming languages, communication infrastructure overlays, and semantics for mobile computation. 12:1-12:63","address":"https://doi.org/10.1145/1734206.1734209","index":198},"https://doi.org/10.1145/1734206.1734210":{"title":"Vivy Suhendra, Abhik Roychoudhury, Tulika Mitra: Scratchpad allocation for concurrent embedded software. 13:1-13:47","address":"https://doi.org/10.1145/1734206.1734210","index":199},"https://doi.org/10.1145/1734206.1734211":{"title":"Peter H. Welch, Jan Bækgaard Pedersen: Santa Claus: Formal analysis of a process-oriented solution. 14:1-14:37","address":"https://doi.org/10.1145/1734206.1734211","index":200},"https://doi.org/10.1145/1734206.1734212":{"title":"Yuqiang Huang, Bruce R. Childers, Mary Lou Soffa: Detecting bugs in register allocation. 15:1-15:36","address":"https://doi.org/10.1145/1734206.1734212","index":201},"https://doi.org/10.1145/1745312.1745313":{"title":"Naoki Kobayashi, Davide Sangiorgi: A hybrid type system for lock-freedom of mobile processes. 16:1-16:49","address":"https://doi.org/10.1145/1745312.1745313","index":202},"https://doi.org/10.1145/1745312.1745314":{"title":"Dennis Jeffrey, Vijay Nagarajan, Rajiv Gupta, Neelam Gupta: Execution suppression: An automated iterative technique for locating memory errors. 17:1-17:36","address":"https://doi.org/10.1145/1745312.1745314","index":203},"https://doi.org/10.1145/1745312.1745315":{"title":"Eran Yahav, Mooly Sagiv: Verifying safety properties of concurrent heap-manipulating programs. 18:1-18:50","address":"https://doi.org/10.1145/1745312.1745315","index":204},"https://doi.org/10.1145/1745312.1745316":{"title":"Sven Apel, DeLesley Hutchins: A calculus for uniform feature composition. 19:1-19:33","address":"https://doi.org/10.1145/1745312.1745316","index":205},"https://doi.org/10.1145/1749608.1749609":{"title":"Kathryn S. McKinley, Keshav Pingali: La prossima vita at TOPLAS. 20:1","address":"https://doi.org/10.1145/1749608.1749609","index":206},"https://doi.org/10.1145/1749608.1749610":{"title":"Salvatore Ruggieri, Fred Mesnard: Typing linear constraints. 21:1-21:42","address":"https://doi.org/10.1145/1749608.1749610","index":207},"https://doi.org/10.1145/1749608.1749611":{"title":"John Tang Boyland: Semantics of fractional permissions with nesting. 22:1-22:33","address":"https://doi.org/10.1145/1749608.1749611","index":208},"https://doi.org/10.1145/1749608.1749612":{"title":"Gogul Balakrishnan, Thomas W. Reps: WYSINWYX: What you see is not what you eXecute. 23:1-23:84","address":"https://doi.org/10.1145/1749608.1749612","index":209},"https://doi.org/10.1145/1749608.1749613":{"title":"Thomas W. Reps, Mooly Sagiv, Alexey Loginov: Finite differencing of logical formulas for static analysis. 24:1-24:55","address":"https://doi.org/10.1145/1749608.1749613","index":210},"https://doi.org/10.1145/1452044.1452045":{"title":"Bart Jacobs, Frank Piessens, Jan Smans, K. Rustan M. Leino, Wolfram Schulte: A programming model for concurrent object-oriented programs. 1:1-1:48","address":"https://doi.org/10.1145/1452044.1452045","index":211},"https://doi.org/10.1145/1452044.1452046":{"title":"Christian Schulte, Peter J. Stuckey: Efficient constraint propagation engines. 2:1-2:43","address":"https://doi.org/10.1145/1452044.1452046","index":212},"https://doi.org/10.1145/1452044.1452047":{"title":"Cinzia Bernardeschi, Nicoletta De Francesco, Giuseppe Lettieri, Luca Martini, Paolo Masci: Decomposing bytecode verification by abstract interpretation. 3:1-3:63","address":"https://doi.org/10.1145/1452044.1452047","index":213},"https://doi.org/10.1145/1452044.1452048":{"title":"Sungwoo Park, Frank Pfenning, Sebastian Thrun: A probabilistic language based on sampling functions. 4:1-4:46","address":"https://doi.org/10.1145/1452044.1452048","index":214},"https://doi.org/10.1145/1452044.1452049":{"title":"Karthikeyan Bhargavan, Cédric Fournet, Andrew D. Gordon, Stephen Tse: Verified interoperable implementations of security protocols. 5:1-5:61","address":"https://doi.org/10.1145/1452044.1452049","index":215},"https://doi.org/10.1145/1462166.1462170":{"title":"Christian Schulte, Peter J. Stuckey: Erratum to \"Efficient constraint propagation engines\".","address":"https://doi.org/10.1145/1462166.1462170","index":216},"https://doi.org/10.1145/1462166.1462167":{"title":"Ana Lúcia de Moura, Roberto Ierusalimschy: Revisiting coroutines. 6:1-6:31","address":"https://doi.org/10.1145/1462166.1462167","index":217},"https://doi.org/10.1145/1462166.1462168":{"title":"Todd D. Millstein, Christopher Frost, Jason Ryder, Alessandro Warth: Expressive and modular predicate dispatch for Java. 7:1-7:54","address":"https://doi.org/10.1145/1462166.1462168","index":218},"https://doi.org/10.1145/1462166.1462169":{"title":"Jon Sneyers, Tom Schrijvers, Bart Demoen: The computational power and complexity of constraint handling rules. 8:1-8:42","address":"https://doi.org/10.1145/1462166.1462169","index":219},"https://doi.org/10.1145/1498926.1498927":{"title":"Steve MacDonald, Kai Tan, Jonathan Schaeffer, Duane Szafron: Deferring design pattern decisions and automating structural pattern changes using a design-pattern-based programming system. 9:1-9:49","address":"https://doi.org/10.1145/1498926.1498927","index":220},"https://doi.org/10.1145/1498926.1498928":{"title":"Chin Soon Lee: Ranking functions for size-change termination. 10:1-10:42","address":"https://doi.org/10.1145/1498926.1498928","index":221},"https://doi.org/10.1145/1498926.1498929":{"title":"Peter W. O'Hearn, Hongseok Yang, John C. Reynolds: Separation and information hiding. 11:1-11:50","address":"https://doi.org/10.1145/1498926.1498929","index":222},"https://doi.org/10.1145/1498926.1498930":{"title":"Jacob Matthews, Robert Bruce Findler: Operational semantics for multi-language programs. 12:1-12:44","address":"https://doi.org/10.1145/1498926.1498930","index":223},"https://doi.org/10.1145/1516507.1516508":{"title":"Zena M. Ariola, Aaron Bohannon, Amr Sabry: Sequent calculi and abstract machines. 13:1-13:48","address":"https://doi.org/10.1145/1516507.1516508","index":224},"https://doi.org/10.1145/1516507.1516509":{"title":"Sara Kalvala, Richard Warburton, David Lacey: Program transformations using temporal logic side conditions. 14:1-14:48","address":"https://doi.org/10.1145/1516507.1516509","index":225},"https://doi.org/10.1145/1516507.1516510":{"title":"Davide Sangiorgi: On the origins of bisimulation and coinduction. 15:1-15:41","address":"https://doi.org/10.1145/1516507.1516510","index":226},"https://doi.org/10.1145/1516507.1516511":{"title":"Joseph M. Morris, Alexander Bunkenburg, Malcolm Tyrrell: Term transformers: A new approach to state. 16:1-16:42","address":"https://doi.org/10.1145/1516507.1516511","index":227},"https://doi.org/10.1145/1516507.1538825":{"title":"Keshav Pingali, Kathryn S. McKinley: Remembrances of things past. 17.1:1-17.1:2","address":"https://doi.org/10.1145/1516507.1538825","index":228},"https://doi.org/10.1145/1538917.1538918":{"title":"Efe Yardimci, Michael Franz: Mostly static program partitioning of binary executables. 17:1-17:46","address":"https://doi.org/10.1145/1538917.1538918","index":229},"https://doi.org/10.1145/1538917.1538919":{"title":"Gilles Barthe, Benjamin Grégoire, César Kunz, Tamara Rezk: Certificate translation for optimizing compilers. 18:1-18:45","address":"https://doi.org/10.1145/1538917.1538919","index":230},"https://doi.org/10.1145/1538917.1538920":{"title":"Giuseppe Castagna, Nils Gesbert, Luca Padovani: A theory of contracts for Web services. 19:1-19:61","address":"https://doi.org/10.1145/1538917.1538920","index":231},"https://doi.org/10.1145/1552309.1552310":{"title":"Yutao Zhong, Xipeng Shen, Chen Ding: Program locality analysis using reuse distance. 20:1-20:39","address":"https://doi.org/10.1145/1552309.1552310","index":232},"https://doi.org/10.1145/1552309.1552311":{"title":"Yanhong A. Liu, Scott D. Stoller: From datalog rules to efficient programs with time and space guarantees. 21:1-21:38","address":"https://doi.org/10.1145/1552309.1552311","index":233},"https://doi.org/10.1145/1552309.1552312":{"title":"Shlomi Dolev, Yinnon A. Haviv, Mooly Sagiv: Self-stabilization preserving compiler. 22:1-22:42","address":"https://doi.org/10.1145/1552309.1552312","index":234},"https://doi.org/10.1145/1552309.1552313":{"title":"Massimo Bartoletti, Pierpaolo Degano, Gian Luigi Ferrari, Roberto Zunino: Local policies for resource usage analysis. 23:1-23:43","address":"https://doi.org/10.1145/1552309.1552313","index":235},"https://doi.org/10.1145/1290520.1290521":{"title":"Uday P. Khedker, Amitabha Sanyal, Amey Karkare: Heap reference analysis using access graphs. 1","address":"https://doi.org/10.1145/1290520.1290521","index":236},"https://doi.org/10.1145/1290520.1290522":{"title":"Peng Zhao, Shimin Cui, Yaoqing Gao, Raúl Silvera, José Nelson Amaral: Forma: A framework for safe automatic array reshaping. 2","address":"https://doi.org/10.1145/1290520.1290522","index":237},"https://doi.org/10.1145/1290520.1290523":{"title":"David W. Binkley, Mark Harman, Jens Krinke: Empirical study of optimization techniques for massive slicing. 3","address":"https://doi.org/10.1145/1290520.1290523","index":238},"https://doi.org/10.1145/1290520.1290524":{"title":"David J. Pearce, Paul H. J. Kelly, Chris Hankin: Efficient field-sensitive pointer analysis of C. 4","address":"https://doi.org/10.1145/1290520.1290524","index":239},"https://doi.org/10.1145/1290520.1290525":{"title":"Joseph Gil, Yoav Zibin: Efficient dynamic dispatching with type slicing. 5","address":"https://doi.org/10.1145/1290520.1290525","index":240},"https://doi.org/10.1145/1290520.1290526":{"title":"Stephen Tse, Steve Zdancewic: Run-time principals in information-flow type systems. 6","address":"https://doi.org/10.1145/1290520.1290526","index":241},"https://doi.org/10.1145/1330017.1330018":{"title":"Barak A. Pearlmutter, Jeffrey Mark Siskind: Reverse-mode AD in a functional framework: Lambda the ultimate backpropagator. 7:1-7:36","address":"https://doi.org/10.1145/1330017.1330018","index":242},"https://doi.org/10.1145/1330017.1330019":{"title":"Westley Weimer, George C. Necula: Exceptional situations and program reliability. 8:1-8:51","address":"https://doi.org/10.1145/1330017.1330019","index":243},"https://doi.org/10.1145/1330017.1330020":{"title":"Daniel E. Cooke, J. Nelson Rushton, Brad Nemanich, Robert G. Watson, Per Andersen: Normalize, transpose, and distribute: An automatic approach for handling nonscalars. 9:1-9:49","address":"https://doi.org/10.1145/1330017.1330020","index":244},"https://doi.org/10.1145/1330017.1330021":{"title":"Tao Wang, Abhik Roychoudhury: Dynamic slicing on Java bytecode traces. 10:1-10:49","address":"https://doi.org/10.1145/1330017.1330021","index":245},"https://doi.org/10.1145/1330017.1330022":{"title":"Luigi Liquori, Arnaud Spiwack: FeatherTrait: A modest extension of Featherweight Java. 11:1-11:32","address":"https://doi.org/10.1145/1330017.1330022","index":246},"https://doi.org/10.1145/1353445.1353446":{"title":"David Monniaux: The pitfalls of verifying floating-point computations. 12:1-12:41","address":"https://doi.org/10.1145/1353445.1353446","index":247},"https://doi.org/10.1145/1353445.1353447":{"title":"Noam Rinetzky, G. Ramalingam, Shmuel Sagiv, Eran Yahav: On the complexity of partially-flow-sensitive alias analysis. 13:1-13:28","address":"https://doi.org/10.1145/1353445.1353447","index":248},"https://doi.org/10.1145/1353445.1353448":{"title":"Daniel S. Dantas, David Walker, Geoffrey Washburn, Stephanie Weirich: AspectML: A polymorphic aspect-oriented functional programming language. 14:1-14:60","address":"https://doi.org/10.1145/1353445.1353448","index":249},"https://doi.org/10.1145/1353445.1353449":{"title":"Tachio Terauchi, Alex Aiken: Witnessing side effects. 15:1-15:42","address":"https://doi.org/10.1145/1353445.1353449","index":250},"https://doi.org/10.1145/1353445.1353450":{"title":"Amir M. Ben-Amram: Size-change termination with difference constraints. 16:1-16:31","address":"https://doi.org/10.1145/1353445.1353450","index":251},"https://doi.org/10.1145/1353445.1353451":{"title":"Zhelong Pan, Rudolf Eigenmann: PEAK - a fast and effective performance tuning system via compiler optimization orchestration. 17:1-17:43","address":"https://doi.org/10.1145/1353445.1353451","index":252},"https://doi.org/10.1145/1377492.1377493":{"title":"Michael Furr, Jeffrey S. Foster: Checking type safety of foreign function calls. 18:1-18:63","address":"https://doi.org/10.1145/1377492.1377493","index":253},"https://doi.org/10.1145/1377492.1377494":{"title":"Ondrej Lhoták, Laurie J. Hendren: Relations as an abstraction for BDD-based program analysis. 19:1-19:63","address":"https://doi.org/10.1145/1377492.1377494","index":254},"https://doi.org/10.1145/1377492.1377495":{"title":"Cormac Flanagan, Stephen N. Freund, Marina Lifshin, Shaz Qadeer: Types for atomicity: Static checking and inference for Java. 20:1-20:53","address":"https://doi.org/10.1145/1377492.1377495","index":255},"https://doi.org/10.1145/1377492.1377496":{"title":"Andreas Gal, Christian W. Probst, Michael Franz: Java bytecode verification via static single assignment form. 21:1-21:21","address":"https://doi.org/10.1145/1377492.1377496","index":256},"https://doi.org/10.1145/1377492.1377497":{"title":"Sapan Bhatia, Charles Consel, Calton Pu: Remote specialization for efficient embedded operating systems. 22:1-22:32","address":"https://doi.org/10.1145/1377492.1377497","index":257},"https://doi.org/10.1145/1377492.1377498":{"title":"Hongbo Rong, Alban Douillet, Guang R. Gao: Register allocation for software pipelined multidimensional loops. 23:1-23:68","address":"https://doi.org/10.1145/1377492.1377498","index":258},"https://doi.org/10.1145/1377492.1377499":{"title":"Noah Torp-Smith, Lars Birkedal, John C. Reynolds: Local reasoning about a copying garbage collector. 24:1-24:58","address":"https://doi.org/10.1145/1377492.1377499","index":259},"https://doi.org/10.1145/1387673.1387674":{"title":"Mila Dalla Preda, Mihai Christodorescu, Somesh Jha, Saumya K. Debray: A semantics-based approach to malware detection. 25:1-25:54","address":"https://doi.org/10.1145/1387673.1387674","index":260},"https://doi.org/10.1145/1387673.1387675":{"title":"James Cheney, Christian Urban: Nominal logic programming. 26:1-26:47","address":"https://doi.org/10.1145/1387673.1387675","index":261},"https://doi.org/10.1145/1387673.1387676":{"title":"Tachio Terauchi, Alex Aiken: A capability calculus for concurrency and determinism. 27:1-27:30","address":"https://doi.org/10.1145/1387673.1387676","index":262},"https://doi.org/10.1145/1387673.1387677":{"title":"Joseph Gil, William Pugh, Grant E. Weddell, Yoav Zibin: Two-dimensional bidirectional object layout. 28:1-28:38","address":"https://doi.org/10.1145/1387673.1387677","index":263},"https://doi.org/10.1145/1387673.1387678":{"title":"Mayur Naik, Jens Palsberg: A type system equivalent to a model checker. 29:1-29:24","address":"https://doi.org/10.1145/1387673.1387678","index":264},"https://doi.org/10.1145/1391956.1391957":{"title":"Karthikeyan Bhargavan, Cédric Fournet, Andrew D. Gordon: Verifying policy-based web services security. 30:1-30:59","address":"https://doi.org/10.1145/1391956.1391957","index":265},"https://doi.org/10.1145/1391956.1391958":{"title":"Laurence Tratt: Domain specific language implementation via compile-time meta-programming. 31:1-31:40","address":"https://doi.org/10.1145/1391956.1391958","index":266},"https://doi.org/10.1145/1391956.1391959":{"title":"Manuel Arenaz, Juan Touriño, Ramon Doallo: XARK: An extensible framework for automatic recognition of computational kernels. 32:1-32:56","address":"https://doi.org/10.1145/1391956.1391959","index":267},"https://doi.org/10.1145/1391956.1391960":{"title":"Roland Ducournau: Perfect hashing as an almost perfect subtype test. 33:1-33:56","address":"https://doi.org/10.1145/1391956.1391960","index":268},"https://doi.org/10.1145/1391956.1391961":{"title":"Joseph M. Morris, Malcolm Tyrrell: Dually nondeterministic functions. 34:1-34:34","address":"https://doi.org/10.1145/1391956.1391961","index":269},"https://doi.org/10.1145/1180475.1180476":{"title":"Vincent Simonet, François Pottier: A constraint-based approach to guarded algebraic data types. 1","address":"https://doi.org/10.1145/1180475.1180476","index":270},"https://doi.org/10.1145/1180475.1180477":{"title":"Stephen M. Blackburn, Matthew Hertz, Kathryn S. McKinley, J. Eliot B. Moss, Ting Yang: Profile-based pretenuring. 2","address":"https://doi.org/10.1145/1180475.1180477","index":271},"https://doi.org/10.1145/1180475.1180478":{"title":"Milenko Drinic, Darko Kirovski, Hoi Vo: PPMexe: Program compression. 3","address":"https://doi.org/10.1145/1180475.1180478","index":272},"https://doi.org/10.1145/1180475.1180479":{"title":"Tomoyuki Higuchi, Atsushi Ohori: A static type system for JVM access control. 4","address":"https://doi.org/10.1145/1180475.1180479","index":273},"https://doi.org/10.1145/1180475.1180480":{"title":"Amir M. Ben-Amram, Chin Soon Lee: Program termination analysis in polynomial time. 5:1-5:37","address":"https://doi.org/10.1145/1180475.1180480","index":274},"https://doi.org/10.1145/1180475.1180481":{"title":"Patrick Eugster: Type-based publish/subscribe: Concepts and experiences. 6","address":"https://doi.org/10.1145/1180475.1180481","index":275},"https://doi.org/10.1145/1216374.1216375":{"title":"Martin P. Ward, Hussein Zedan: Slicing as a program transformation. 7","address":"https://doi.org/10.1145/1216374.1216375","index":276},"https://doi.org/10.1145/1216374.1216376":{"title":"Olivier Tardieu: A deterministic logical semantics for pure Esterel. 8","address":"https://doi.org/10.1145/1216374.1216376","index":277},"https://doi.org/10.1145/1216374.1216377":{"title":"Xiaotong Zhuang, Santosh Pande: Allocating architected registers through differential encoding. 9","address":"https://doi.org/10.1145/1216374.1216377","index":278},"https://doi.org/10.1145/1216374.1216378":{"title":"Maurice Bruynooghe, Michael Codish, John P. Gallagher, Samir Genaim, Wim Vanhoof: Termination analysis of logic programs through combination of type-based norms. 10","address":"https://doi.org/10.1145/1216374.1216378","index":279},"https://doi.org/10.1145/1216374.1216379":{"title":"Martin Hirzel, Daniel von Dincklage, Amer Diwan, Michael Hind: Fast online pointer analysis. 11","address":"https://doi.org/10.1145/1216374.1216379","index":280},"https://doi.org/10.1145/1216374.1216380":{"title":"Jaydeep Marathe, Frank Mueller, Tushar Mohan, Sally A. McKee, Bronis R. de Supinski, Andy Yoo: METRIC: Memory tracing via dynamic binary rewriting to identify cache inefficiencies. 12","address":"https://doi.org/10.1145/1216374.1216380","index":281},"https://doi.org/10.1145/1216374.1216381":{"title":"Davide Ancona, Christopher Anderson, Ferruccio Damiani, Sophia Drossopoulou, Paola Giannini, Elena Zucca: A provenly correct translation of Fickle into Java. 13","address":"https://doi.org/10.1145/1216374.1216381","index":282},"https://doi.org/10.1145/1232420.1232421":{"title":"Martín Abadi, Jens Palsberg: Editorial. 14","address":"https://doi.org/10.1145/1232420.1232421","index":283},"https://doi.org/10.1145/1232420.1232422":{"title":"Andreas Podelski, Andrey Rybalchenko: Transition predicate abstraction and fair termination. 15","address":"https://doi.org/10.1145/1232420.1232422","index":284},"https://doi.org/10.1145/1232420.1232423":{"title":"Yichen Xie, Alex Aiken: Saturn: A scalable framework for error detection using Boolean satisfiability. 16","address":"https://doi.org/10.1145/1232420.1232423","index":285},"https://doi.org/10.1145/1232420.1232424":{"title":"J. Nathan Foster, Michael B. Greenwald, Jonathan T. Moore, Benjamin C. Pierce, Alan Schmitt: Combinators for bidirectional tree transformations: A linguistic approach to the view-update problem. 17","address":"https://doi.org/10.1145/1232420.1232424","index":286},"https://doi.org/10.1145/1255450.1255451":{"title":"Han Bok Lee, Amer Diwan, J. Eliot B. Moss: Design, implementation, and evaluation of a compilation server. 18","address":"https://doi.org/10.1145/1255450.1255451","index":287},"https://doi.org/10.1145/1255450.1255452":{"title":"Bjorn De Sutter, Ludo Van Put, Koen De Bosschere: A practical interprocedural dominance algorithm. 19","address":"https://doi.org/10.1145/1255450.1255452","index":288},"https://doi.org/10.1145/1255450.1255453":{"title":"Harel Paz, David F. Bacon, Elliot K. Kolodner, Erez Petrank, V. T. Rajan: An efficient on-the-fly cycle collection. 20","address":"https://doi.org/10.1145/1255450.1255453","index":289},"https://doi.org/10.1145/1255450.1255454":{"title":"Anders Møller, Mads Østerby Olesen, Michael I. Schwartzbach: Static validation of XSL transformations. 21","address":"https://doi.org/10.1145/1255450.1255454","index":290},"https://doi.org/10.1145/1255450.1255455":{"title":"Gareth Paul Stoyle, Michael W. Hicks, Gavin M. Bierman, Peter Sewell, Iulian Neamtiu: Mutatis Mutandis: Safe and predictable dynamic software updating. 22","address":"https://doi.org/10.1145/1255450.1255455","index":291},"https://doi.org/10.1145/1275497.1275498":{"title":"Mooly Sagiv: Introduction to special ESOP'05 issue. 23","address":"https://doi.org/10.1145/1275497.1275498","index":292},"https://doi.org/10.1145/1275497.1275499":{"title":"Bodil Biering, Lars Birkedal, Noah Torp-Smith: BI-hyperdoctrines, higher-order separation logic, and abstraction. 24","address":"https://doi.org/10.1145/1275497.1275499","index":293},"https://doi.org/10.1145/1275497.1275500":{"title":"Cédric Fournet, Andrew D. Gordon, Sergio Maffeis: A type discipline for authorization policies. 25","address":"https://doi.org/10.1145/1275497.1275500","index":294},"https://doi.org/10.1145/1275497.1275501":{"title":"Xavier Rival, Laurent Mauborgne: The trace partitioning abstract domain. 26","address":"https://doi.org/10.1145/1275497.1275501","index":295},"https://doi.org/10.1145/1275497.1275502":{"title":"Venkatesh Prasad Ranganath, Torben Amtoft, Anindya Banerjee, John Hatcliff, Matthew B. Dwyer: A new foundation for control dependence and slicing for modern program structures. 27","address":"https://doi.org/10.1145/1275497.1275502","index":296},"https://doi.org/10.1145/1275497.1275503":{"title":"Ajay Chander, David Espinosa, Nayeem Islam, Peter Lee, George C. Necula: Enforcing resource bounds via static verification of dynamic checks. 28","address":"https://doi.org/10.1145/1275497.1275503","index":297},"https://doi.org/10.1145/1275497.1275504":{"title":"Markus Müller-Olm, Helmut Seidl: Analysis of modular arithmetic. 29","address":"https://doi.org/10.1145/1275497.1275504","index":298},"https://doi.org/10.1145/1286821.1293892":{"title":"Kathryn S. McKinley, Keshav Pingali: Editorial: A changing of the guard. 30","address":"https://doi.org/10.1145/1286821.1293892","index":299},"https://doi.org/10.1145/1286821.1286822":{"title":"Kohei Honda, Nobuko Yoshida: A uniform type structure for secure information flow. 31","address":"https://doi.org/10.1145/1286821.1286822","index":300},"https://doi.org/10.1145/1286821.1286823":{"title":"Christian Grothoff, Jens Palsberg, Jan Vitek: Encapsulating objects with confined types. 32","address":"https://doi.org/10.1145/1286821.1286823","index":301},"https://doi.org/10.1145/1286821.1286824":{"title":"Thomas A. Henzinger, Christoph M. Kirsch: The embedded machine: Predictable, portable real-time code. 33","address":"https://doi.org/10.1145/1286821.1286824","index":302},"https://doi.org/10.1145/1286821.1286825":{"title":"William Thies, Frédéric Vivien, Saman P. Amarasinghe: A step towards unifying schedule and storage optimization. 34","address":"https://doi.org/10.1145/1286821.1286825","index":303},"https://doi.org/10.1145/1286821.1286826":{"title":"Christian S. Collberg, Clark D. Thomborson, Gregg M. Townsend: Dynamic graph-based software fingerprinting. 35","address":"https://doi.org/10.1145/1286821.1286826","index":304},"https://doi.org/10.1145/1286821.1286827":{"title":"Atsushi Ohori: A proof theory for machine code. 36","address":"https://doi.org/10.1145/1286821.1286827","index":305},"https://doi.org/10.1145/1286821.1286828":{"title":"Kevin Casey, M. Anton Ertl, David Gregg: Optimizing indirect branch prediction accuracy in virtual machine interpreters. 37","address":"https://doi.org/10.1145/1286821.1286828","index":306},"https://doi.org/10.1145/1286821.1286829":{"title":"Bageshri Karkare, Uday P. Khedker: An improved bound for call strings based interprocedural analysis of bit vector frameworks. 38","address":"https://doi.org/10.1145/1286821.1286829","index":307},"https://doi.org/10.1145/1286821.1286830":{"title":"Sunae Seo, Hongseok Yang, Kwangkeun Yi, Taisook Han: Goal-directed weakening of abstract interpretation results. 39","address":"https://doi.org/10.1145/1286821.1286830","index":308},"https://doi.org/10.1145/1111596.1111597":{"title":"Yossi Levanoni, Erez Petrank: An on-the-fly reference-counting garbage collector for java. 1-69","address":"https://doi.org/10.1145/1111596.1111597","index":309},"https://doi.org/10.1145/1111596.1111598":{"title":"Takeshi Ogasawara, Hideaki Komatsu, Toshio Nakatani: EDO: Exception-directed optimization in java. 70-105","address":"https://doi.org/10.1145/1111596.1111598","index":310},"https://doi.org/10.1145/1111596.1111599":{"title":"Motohiro Kawahito, Hideaki Komatsu, Toshio Nakatani: Effective sign extension elimination for java. 106-133","address":"https://doi.org/10.1145/1111596.1111599","index":311},"https://doi.org/10.1145/1111596.1111600":{"title":"Toshio Suganuma, Toshiaki Yasue, Toshio Nakatani: A region-based compilation technique for dynamic compilers. 134-174","address":"https://doi.org/10.1145/1111596.1111600","index":312},"https://doi.org/10.1145/1111596.1111601":{"title":"Kevin W. Hamlen, J. Gregory Morrisett, Fred B. Schneider: Computability classes for enforcement mechanisms. 175-205","address":"https://doi.org/10.1145/1111596.1111601","index":313},"https://doi.org/10.1145/1119479.1119480":{"title":"Martín Abadi, Cormac Flanagan, Stephen N. Freund: Types for safe locking: Static race detection for Java. 207-255","address":"https://doi.org/10.1145/1119479.1119480","index":314},"https://doi.org/10.1145/1119479.1119481":{"title":"Étienne Payet, Frédéric Mesnard: Nontermination inference of logic programs. 256-289","address":"https://doi.org/10.1145/1119479.1119481","index":315},"https://doi.org/10.1145/1119479.1119482":{"title":"Massimo Merro, Matthew Hennessy: A bisimulation-based semantic theory of Safe Ambients. 290-330","address":"https://doi.org/10.1145/1119479.1119482","index":316},"https://doi.org/10.1145/1119479.1119483":{"title":"Stéphane Ducasse, Oscar Nierstrasz, Nathanael Schärli, Roel Wuyts, Andrew P. Black: Traits: A mechanism for fine-grained reuse. 331-388","address":"https://doi.org/10.1145/1119479.1119483","index":317},"https://doi.org/10.1145/1133651.1133652":{"title":"Stijn Vansummeren: Type inference for unique pattern matching. 389-428","address":"https://doi.org/10.1145/1133651.1133652","index":318},"https://doi.org/10.1145/1133651.1133653":{"title":"Dan Grossman: Quantified types in an imperative language. 429-475","address":"https://doi.org/10.1145/1133651.1133653","index":319},"https://doi.org/10.1145/1133651.1133654":{"title":"Matthew Hertz, Stephen M. Blackburn, J. Eliot B. Moss, Kathryn S. McKinley, Darko Stefanovic: Generating object lifetime traces with Merlin. 476-516","address":"https://doi.org/10.1145/1133651.1133654","index":320},"https://doi.org/10.1145/1133651.1133655":{"title":"Curtis Clifton, Todd D. Millstein, Gary T. Leavens, Craig Chambers: MultiJava: Design rationale, compiler implementation, and applications. 517-575","address":"https://doi.org/10.1145/1133651.1133655","index":321},"http://doi.acm.org/10.1145/1146810":{"title":"Elizabeth Scott, Adrian Johnstone: Right nulled GLR parsers. 577-618","address":"http://doi.acm.org/10.1145/1146810","index":322},"http://doi.acm.org/10.1145/1146811":{"title":"Gerwin Klein, Tobias Nipkow: A machine-checked model for a Java-like language, virtual machine, and compiler. 619-695","address":"http://doi.acm.org/10.1145/1146811","index":323},"http://doi.acm.org/10.1145/1146812":{"title":"Mads Sig Ager, Olivier Danvy, Henning Korsholm Rohde: Fast partial evaluation of pattern matching in strings. 696-714","address":"http://doi.acm.org/10.1145/1146812","index":324},"http://doi.acm.org/10.1145/1146813":{"title":"Richard Carlsson, Konstantinos Sagonas, Jesper Wilhelmsson: Message analysis for concurrent programs using message passing. 715-746","address":"http://doi.acm.org/10.1145/1146813","index":325},"http://doi.acm.org/10.1145/1146814":{"title":"Raymond T. Boute: Calculational semantics: Deriving programming theories from equations by functional predicate calculus. 747-793","address":"http://doi.acm.org/10.1145/1146814","index":326},"http://doi.acm.org/10.1145/1152650":{"title":"Atsushi Igarashi, Mirko Viroli: Variant parametric types: A flexible subtyping scheme for generics. 795-847","address":"http://doi.acm.org/10.1145/1152650","index":327},"http://doi.acm.org/10.1145/1152651":{"title":"Pramod G. Joisha, Prithviraj Banerjee: An algebraic array shape inference system for MATLAB. 848-907","address":"http://doi.acm.org/10.1145/1152651","index":328},"http://doi.acm.org/10.1145/1152652":{"title":"Tim Brecht, Eshrat Arjomandi, Chang Li, Hang Pham: Controlling garbage collection and heap growth to reduce the execution time of Java applications. 908-941","address":"http://doi.acm.org/10.1145/1152652","index":329},"http://doi.acm.org/10.1145/1152653":{"title":"Seon Wook Kim, Chong-liang Ooi, Rudolf Eigenmann, Babak Falsafi, T. N. Vijaykumar: Exploiting reference idempotency to reduce speculative storage overflow. 942-965","address":"http://doi.acm.org/10.1145/1152653","index":330},"http://doi.acm.org/10.1145/1186633":{"title":"Rajeev Joshi, Greg Nelson, Yunhong Zhou: Denali: A practical algorithm for generating optimal code. 967-989","address":"http://doi.acm.org/10.1145/1186633","index":331},"http://doi.acm.org/10.1145/1186634":{"title":"Umut A. Acar, Guy E. Blelloch, Robert Harper: Adaptive functional programming. 990-1034","address":"http://doi.acm.org/10.1145/1186634","index":332},"http://doi.acm.org/10.1145/1186635":{"title":"Jeffrey S. Foster, Robert Johnson, John Kodumal, Alex Aiken: Flow-insensitive type qualifiers. 1035-1087","address":"http://doi.acm.org/10.1145/1186635","index":333},"http://doi.acm.org/10.1145/1186636":{"title":"Mangala Gowri Nanda, S. Ramesh: Interprocedural slicing of multithreaded programs with applications to Java. 1088-1144","address":"http://doi.acm.org/10.1145/1186636","index":334},"http://doi.acm.org/10.1145/1186637":{"title":"Daniel J. Rosenkrantz, Lenore M. R. Mullin, Harry B. Hunt III: On minimizing materializations of array-valued temporaries. 1145-1177","address":"http://doi.acm.org/10.1145/1186637","index":335},"https://doi.org/10.1145/1053468.1053469":{"title":"Zhong Shao, Valery Trifonov, Bratin Saha, Nikolaos Papaspyrou: A type system for certified binaries. 1-45","address":"https://doi.org/10.1145/1053468.1053469","index":336},"https://doi.org/10.1145/1053468.1053470":{"title":"Haruo Hosoya, Jerome Vouillon, Benjamin C. Pierce: Regular expression types for XML. 46-90","address":"https://doi.org/10.1145/1053468.1053470","index":337},"https://doi.org/10.1145/1053468.1053471":{"title":"Yanhong A. Liu, Scott D. Stoller, Ning Li, Tom Rothamel: Optimizing aggregate array computations in loops. 91-125","address":"https://doi.org/10.1145/1053468.1053471","index":338},"https://doi.org/10.1145/1053468.1053472":{"title":"Jens Palsberg, Tian Zhao, Trevor Jim: Automatic discovery of covariant read-only fields. 126-162","address":"https://doi.org/10.1145/1053468.1053472","index":339},"https://doi.org/10.1145/1053468.1053473":{"title":"Olaf Chitil: Pretty printing with lazy dequeues. 163-184","address":"https://doi.org/10.1145/1053468.1053473","index":340},"https://doi.org/10.1145/1057387.1057388":{"title":"Radu Rugina, Martin C. Rinard: Symbolic bounds analysis of pointers, array indices, and accessed memory regions. 185-235","address":"https://doi.org/10.1145/1057387.1057388","index":341},"https://doi.org/10.1145/1057387.1057389":{"title":"Marco Gavanelli, Evelina Lamma, Paola Mello, Michela Milano: Dealing with incomplete knowledge on CLP(FD) variable domains. 236-263","address":"https://doi.org/10.1145/1057387.1057389","index":342},"https://doi.org/10.1145/1057387.1057390":{"title":"Atsushi Igarashi, Naoki Kobayashi: Resource usage analysis. 264-313","address":"https://doi.org/10.1145/1057387.1057390","index":343},"https://doi.org/10.1145/1057387.1057391":{"title":"Thomas Ball, Todd D. Millstein, Sriram K. Rajamani: Polymorphic predicate abstraction. 314-343","address":"https://doi.org/10.1145/1057387.1057391","index":344},"https://doi.org/10.1145/1057387.1057392":{"title":"François Pottier, Christian Skalka, Scott F. Smith: A systematic approach to static access control. 344-382","address":"https://doi.org/10.1145/1057387.1057392","index":345},"https://doi.org/10.1145/1065887.1065888":{"title":"Adam L. Buchsbaum, Haim Kaplan, Anne Rogers, Jeffery R. Westbrook: Corrigendum: a new, simpler linear-time dominators algorithm. 383-387","address":"https://doi.org/10.1145/1065887.1065888","index":346},"https://doi.org/10.1145/1065887.1065889":{"title":"Christian Schulte, Peter J. Stuckey: When do bounds and domain propagation lead to the same search space? 388-425","address":"https://doi.org/10.1145/1065887.1065889","index":347},"https://doi.org/10.1145/1065887.1065890":{"title":"Dibyendu Das, U. Ramakrishna: A practical and fast iterative algorithm for phi-function computation using DJ graphs. 426-440","address":"https://doi.org/10.1145/1065887.1065890","index":348},"https://doi.org/10.1145/1065887.1065891":{"title":"Luc Moreau, Christian Queinnec: Resource aware programming. 441-476","address":"https://doi.org/10.1145/1065887.1065891","index":349},"https://doi.org/10.1145/1065887.1065892":{"title":"George C. Necula, Jeremy Condit, Matthew Harren, Scott McPeak, Westley Weimer: CCured: type-safe retrofitting of legacy software. 477-526","address":"https://doi.org/10.1145/1065887.1065892","index":350},"https://doi.org/10.1145/1065887.1065893":{"title":"Thi Viet Nga Nguyen, François Irigoin: Efficient and effective array bound checking. 527-570","address":"https://doi.org/10.1145/1065887.1065893","index":351},"https://doi.org/10.1145/1065887.1065894":{"title":"Max Hailperin: Comparing conservative coalescing criteria. 571-582","address":"https://doi.org/10.1145/1065887.1065894","index":352},"https://doi.org/10.1145/1075382.1075383":{"title":"Godmar Back, Wilson C. Hsieh: The KaffeOS Java runtime system. 583-630","address":"https://doi.org/10.1145/1075382.1075383","index":353},"https://doi.org/10.1145/1075382.1075384":{"title":"Xiangyu Zhang, Rajiv Gupta, Youtao Zhang: Cost and precision tradeoffs of dynamic data slicing algorithms. 631-661","address":"https://doi.org/10.1145/1075382.1075384","index":354},"https://doi.org/10.1145/1075382.1075385":{"title":"Mary W. Hall, Saman P. Amarasinghe, Brian R. Murphy, Shih-Wei Liao, Monica S. Lam: Interprocedural parallelization analysis in SUIF. 662-731","address":"https://doi.org/10.1145/1075382.1075385","index":355},"https://doi.org/10.1145/1075382.1075386":{"title":"Toshio Suganuma, Toshiaki Yasue, Motohiro Kawahito, Hideaki Komatsu, Toshio Nakatani: Design and evaluation of dynamic optimizations for a Java just-in-time compiler. 732-785","address":"https://doi.org/10.1145/1075382.1075386","index":356},"https://doi.org/10.1145/1075382.1075387":{"title":"Rajeev Alur, Michael Benedikt, Kousha Etessami, Patrice Godefroid, Thomas W. Reps, Mihalis Yannakakis: Analysis of recursive state machines. 786-818","address":"https://doi.org/10.1145/1075382.1075387","index":357},"https://doi.org/10.1145/1086642.1086643":{"title":"Joseph Gil, Yoav Zibin: Efficient subtyping tests with PQ-encoding. 819-856","address":"https://doi.org/10.1145/1086642.1086643","index":358},"https://doi.org/10.1145/1086642.1086644":{"title":"Tom Hirschowitz, Xavier Leroy: Mixin modules in a call-by-value setting. 857-881","address":"https://doi.org/10.1145/1086642.1086644","index":359},"https://doi.org/10.1145/1086642.1086645":{"title":"Bjorn De Sutter, Bruno De Bus, Koen De Bosschere: Link-time binary rewriting techniques for program compaction. 882-945","address":"https://doi.org/10.1145/1086642.1086645","index":360},"https://doi.org/10.1145/1086642.1086646":{"title":"Xavier Vera, Jaume Abella, Josep Llosa, Antonio González: An accurate cost model for guiding data locality transformations. 946-987","address":"https://doi.org/10.1145/1086642.1086646","index":361},"https://doi.org/10.1145/1086642.1086647":{"title":"Raymond T. Boute: Functional declarative language design and predicate calculus: a practical approach. 988-1047","address":"https://doi.org/10.1145/1086642.1086647","index":362},"https://doi.org/10.1145/1108970.1108971":{"title":"Michael W. Hicks, Scott Nettles: Dynamic software updating. 1049-1096","address":"https://doi.org/10.1145/1108970.1108971","index":363},"https://doi.org/10.1145/1108970.1108972":{"title":"Katherine Barabash, Ori Ben-Yitzhak, Irit Goft, Elliot K. Kolodner, Victor Leikehman, Yoav Ossia, Avi Owshanko, Erez Petrank: A parallel, incremental, mostly concurrent garbage collector for servers. 1097-1146","address":"https://doi.org/10.1145/1108970.1108972","index":364},"https://doi.org/10.1145/1108970.1108973":{"title":"Arne J. Glenstrup, Neil D. Jones: Termination analysis and specialization-point insertion in offline partial evaluation. 1147-1215","address":"https://doi.org/10.1145/1108970.1108973","index":365},"https://doi.org/10.1145/1108970.1108974":{"title":"Peter J. Stuckey, Martin Sulzmann: A theory of overloading. 1216-1269","address":"https://doi.org/10.1145/1108970.1108974","index":366},"https://doi.org/10.1145/1108970.1108975":{"title":"Peter A. Buhr, Ashif S. Harji: Implicit-signal monitors. 1270-1343","address":"https://doi.org/10.1145/1108970.1108975","index":367},"https://doi.org/10.1145/1108970.1108976":{"title":"Luc Moreau, Peter Dickman, Richard E. Jones: Birrell's distributed reference listing revisited. 1344-1395","address":"https://doi.org/10.1145/1108970.1108976","index":368},"https://doi.org/10.1145/963778.963779":{"title":"Antonio J. Fernández, Patricia M. Hill: An interval constraint system for lattice domains. 1-46","address":"https://doi.org/10.1145/963778.963779","index":369},"https://doi.org/10.1145/963778.963780":{"title":"Sergei Gorlatch: Send-receive considered harmful: Myths and realities of message passing. 47-56","address":"https://doi.org/10.1145/963778.963780","index":370},"https://doi.org/10.1145/963778.963781":{"title":"Michele Bugliesi, Giuseppe Castagna, Silvia Crafa: Access control for mobile agents: The calculus of boxed ambients. 57-124","address":"https://doi.org/10.1145/963778.963781","index":371},"https://doi.org/10.1145/963778.963782":{"title":"Paul C. Attie, Anish Arora, E. Allen Emerson: Synthesis of fault-tolerant concurrent programs. 125-185","address":"https://doi.org/10.1145/963778.963782","index":372},"https://doi.org/10.1145/963778.963783":{"title":"Pei-Chi Wu: On exponential-time completeness of the circularity problem for attribute grammars. 186-190","address":"https://doi.org/10.1145/963778.963783","index":373},"https://doi.org/10.1145/963778.963784":{"title":"Niels H. Christensen, Robert Glück: Offline partial evaluation can be as accurate as online partial evaluation. 191-220","address":"https://doi.org/10.1145/963778.963784","index":374},"https://doi.org/10.1145/973097.973098":{"title":"Yifeng Chen, Jeff W. Sanders: Logic of global synchrony. 221-262","address":"https://doi.org/10.1145/973097.973098","index":375},"https://doi.org/10.1145/973097.973099":{"title":"Xavier Vera, Nerina Bermudo, Josep Llosa, Antonio González: A fast and accurate framework to analyze and optimize cache memory behavior. 263-300","address":"https://doi.org/10.1145/973097.973099","index":376},"https://doi.org/10.1145/973097.973100":{"title":"Corinna Cortes, Kathleen Fisher, Daryl Pregibon, Anne Rogers, Frederick Smith: Hancock: A language for analyzing transactional data streams. 301-338","address":"https://doi.org/10.1145/973097.973100","index":377},"https://doi.org/10.1145/973097.973101":{"title":"Rajeev Alur, Radu Grosu: Modular refinement of hierarchic reactive machines. 339-369","address":"https://doi.org/10.1145/973097.973101","index":378},"https://doi.org/10.1145/973097.973102":{"title":"Karl J. Lieberherr, Boaz Patt-Shamir, Doug Orleans: Traversals of object structures: Specification and Efficient Implementation. 370-412","address":"https://doi.org/10.1145/973097.973102","index":379},"https://doi.org/10.1145/982158.982159":{"title":"Michael Leuschel: A framework for the integration of partial evaluation and abstract interpretation of logic programs. 413-463","address":"https://doi.org/10.1145/982158.982159","index":380},"https://doi.org/10.1145/982158.982160":{"title":"Abhik Roychoudhury, K. Narayan Kumar, C. R. Ramakrishnan, I. V. Ramakrishnan: An unfold/fold transformation framework for definite logic programs. 464-509","address":"https://doi.org/10.1145/982158.982160","index":381},"https://doi.org/10.1145/982158.982161":{"title":"Sabine Glesner, Wolf Zimmermann: Natural semantics as a static program analysis framework. 510-577","address":"https://doi.org/10.1145/982158.982161","index":382},"https://doi.org/10.1145/982158.982162":{"title":"Aaron W. Keen, Tingjian Ge, Justin T. Maris, Ronald A. Olsson: JR: Flexible distributed programming in an extended Java. 578-608","address":"https://doi.org/10.1145/982158.982162","index":383},"https://doi.org/10.1145/1011508.1011509":{"title":"Rajiv Mirani, Paul Hudak: First-class monadic schedules. 609-651","address":"https://doi.org/10.1145/1011508.1011509","index":384},"https://doi.org/10.1145/1011508.1011510":{"title":"Simon Helsen, Peter Thiemann: Polymorphic specialization for ML. 652-701","address":"https://doi.org/10.1145/1011508.1011510","index":385},"https://doi.org/10.1145/1011508.1011511":{"title":"A. Prasad Sistla, Patrice Godefroid: Symmetry and reduced symmetry in model checking. 702-734","address":"https://doi.org/10.1145/1011508.1011511","index":386},"https://doi.org/10.1145/1011508.1011512":{"title":"Jinpyo Park, Soo-Mook Moon: Optimistic register coalescing. 735-765","address":"https://doi.org/10.1145/1011508.1011512","index":387},"https://doi.org/10.1145/1018203.1018204":{"title":"Martin Odersky, Benjamin C. Pierce: Guest editorial. 767-768","address":"https://doi.org/10.1145/1018203.1018204","index":388},"https://doi.org/10.1145/1018203.1018205":{"title":"Nick Benton, Luca Cardelli, Cédric Fournet: Modern concurrency abstractions for C#. 769-804","address":"https://doi.org/10.1145/1018203.1018205","index":389},"https://doi.org/10.1145/1018203.1018206":{"title":"Christopher A. Stone: Extensible objects without labels. 805-835","address":"https://doi.org/10.1145/1018203.1018206","index":390},"https://doi.org/10.1145/1018203.1018207":{"title":"Todd D. Millstein, Colin Bleckner, Craig Chambers: Modular typechecking for hierarchically extensible datatypes and functions. 836-889","address":"https://doi.org/10.1145/1018203.1018207","index":391},"https://doi.org/10.1145/1018203.1018208":{"title":"Mitchell Wand, Gregor Kiczales, Christopher Dutchyn: A semantics for advice and dynamic join points in aspect-oriented programming. 890-910","address":"https://doi.org/10.1145/1018203.1018208","index":392},"https://doi.org/10.1145/1034774.1034775":{"title":"C. Barry Jay: The pattern calculus. 911-937","address":"https://doi.org/10.1145/1034774.1034775","index":393},"https://doi.org/10.1145/1034774.1034776":{"title":"Sathyanarayanan Thammanur, Santosh Pande: A fast, memory-efficient register allocation framework for embedded systems. 938-974","address":"https://doi.org/10.1145/1034774.1034776","index":394},"https://doi.org/10.1145/1034774.1034777":{"title":"Zhiyuan Li, Yonghong Song: Automatic tiling of iterative stencil loops. 975-1028","address":"https://doi.org/10.1145/1034774.1034777","index":395},"https://doi.org/10.1145/1034774.1034778":{"title":"John Clements, Matthias Felleisen: A tail-recursive machine with stack inspection. 1029-1052","address":"https://doi.org/10.1145/1034774.1034778","index":396},"https://doi.org/10.1145/596980.596981":{"title":"Francesca Levi, Davide Sangiorgi: Mobile safe ambients. 1-69","address":"https://doi.org/10.1145/596980.596981","index":397},"https://doi.org/10.1145/596980.596982":{"title":"Radu Rugina, Martin C. Rinard: Pointer analysis for structured parallel programs. 70-116","address":"https://doi.org/10.1145/596980.596982","index":398},"https://doi.org/10.1145/596980.596983":{"title":"François Pottier, Vincent Simonet: Information flow inference for ML. 117-158","address":"https://doi.org/10.1145/596980.596983","index":399},"https://doi.org/10.1145/641888.641889":{"title":"Bratin Saha, Valery Trifonov, Zhong Shao: Intensional analysis of quantified types. 159-209","address":"https://doi.org/10.1145/641888.641889","index":400},"https://doi.org/10.1145/641888.641890":{"title":"Norman Ramsey, Cristina Cifuentes: A transformational approach to binary translation of delayed branches. 210-224","address":"https://doi.org/10.1145/641888.641890","index":401},"https://doi.org/10.1145/641888.641891":{"title":"Kim B. Bruce, Angela Schuett, Robert van Gent, Adrian Fiech: PolyTOIL: A type-safe polymorphic object-oriented language. 225-290","address":"https://doi.org/10.1145/641888.641891","index":402},"https://doi.org/10.1145/641909.641910":{"title":"Morten Rhiger: A foundation for embedded languages. 291-315","address":"https://doi.org/10.1145/641909.641910","index":403},"https://doi.org/10.1145/641909.641911":{"title":"Martin C. Rinard, Pedro C. Diniz: Eliminating synchronization bottlenecks using adaptive replication. 316-359","address":"https://doi.org/10.1145/641909.641911","index":404},"https://doi.org/10.1145/641909.641912":{"title":"Cédric Fournet, Andrew D. Gordon: Stack inspection: Theory and variants. 360-399","address":"https://doi.org/10.1145/641909.641912","index":405},"https://doi.org/10.1145/778559.778560":{"title":"Ferruccio Damiani: Rank 2 intersection types for local definitions and conditional expressions. 401-451","address":"https://doi.org/10.1145/778559.778560","index":406},"https://doi.org/10.1145/778559.778561":{"title":"Ulrik Pagh Schultz, Julia L. Lawall, Charles Consel: Automatic program specialization for Java. 452-499","address":"https://doi.org/10.1145/778559.778561","index":407},"https://doi.org/10.1145/778559.778562":{"title":"Thomas Kistler, Michael Franz: Continuous program optimization: A case study. 500-548","address":"https://doi.org/10.1145/778559.778562","index":408},"https://doi.org/10.1145/937563.937564":{"title":"Roberto M. Amadio, Gérard Boudol, Cédric Lhoussaine: The receptive distributed pi-calculus. 549-577","address":"https://doi.org/10.1145/937563.937564","index":409},"https://doi.org/10.1145/937563.937565":{"title":"Fausto Spoto, Thomas P. Jensen: Class analyses as abstract interpretations of trace semantics. 578-630","address":"https://doi.org/10.1145/937563.937565","index":410},"https://doi.org/10.1145/937563.937566":{"title":"Clinton L. Jeffery: Generating LR syntax error messages from examples. 631-640","address":"https://doi.org/10.1145/937563.937566","index":411},"https://doi.org/10.1145/937563.937567":{"title":"Davide Ancona, Giovanni Lagorio, Elena Zucca: Jam - designing a Java extension with mixins. 641-712","address":"https://doi.org/10.1145/937563.937567","index":412},"https://doi.org/10.1145/945885.945886":{"title":"Bruno Blanchet: Escape analysis for JavaTM: Theory and practice. 713-775","address":"https://doi.org/10.1145/945885.945886","index":413},"https://doi.org/10.1145/945885.945888":{"title":"Vijay Menon, Keshav Pingali, Nikolay Mateev: Fractal symbolic analysis. 776-813","address":"https://doi.org/10.1145/945885.945888","index":414},"https://doi.org/10.1145/945885.945890":{"title":"Aske Simon Christensen, Anders Møller, Michael I. Schwartzbach: Extending Java for high-level Web service construction. 814-875","address":"https://doi.org/10.1145/945885.945890","index":415},"https://doi.org/10.1145/945885.945892":{"title":"Jong-Deok Choi, Manish Gupta, Mauricio J. Serrano, Vugranam C. Sreedhar, Samuel P. Midkiff: Stack allocation and synchronization optimizations for Java using escape analysis. 876-910","address":"https://doi.org/10.1145/945885.945892","index":416},"https://doi.org/10.1145/509705.509706":{"title":"PeiZong Lee, Zvi M. Kedem: Automatic data and computation decomposition on distributed memory parallel computers. 1-50","address":"https://doi.org/10.1145/509705.509706","index":417},"https://doi.org/10.1145/509705.509707":{"title":"Thomas A. Henzinger, Shaz Qadeer, Sriram K. Rajamani, Serdar Tasiran: An assume-guarantee rule for checking simulation. 51-64","address":"https://doi.org/10.1145/509705.509707","index":418},"https://doi.org/10.1145/509705.509708":{"title":"Yunheung Paek, Jay Hoeflinger, David A. Padua: Efficient and precise array access analysis. 65-109","address":"https://doi.org/10.1145/509705.509708","index":419},"https://doi.org/10.1145/514952.514953":{"title":"Kathleen Fisher, Benjamin C. Pierce: Guest editorial. 111","address":"https://doi.org/10.1145/514952.514953","index":420},"https://doi.org/10.1145/514952.514954":{"title":"Christopher League, Zhong Shao, Valery Trifonov: Type-preserving compilation of Featherweight Java. 112-152","address":"https://doi.org/10.1145/514952.514954","index":421},"https://doi.org/10.1145/514952.514955":{"title":"Sophia Drossopoulou, Ferruccio Damiani, Mariangiola Dezani-Ciancaglini, Paola Giannini: More dynamic object reclassification: Fickle||. 153-191","address":"https://doi.org/10.1145/514952.514955","index":422},"https://doi.org/10.1145/514188.514189":{"title":"J Strother Moore, George Porter: The apprentice challenge. 193-216","address":"https://doi.org/10.1145/514188.514189","index":423},"https://doi.org/10.1145/514188.514190":{"title":"Shmuel Sagiv, Thomas W. Reps, Reinhard Wilhelm: Parametric shape analysis via 3-valued logic. 217-298","address":"https://doi.org/10.1145/514188.514190","index":424},"https://doi.org/10.1145/567097.567098":{"title":"Sebastian Unger, Frank Mueller: Handling irreducible loops: optimized node splitting versus DJ-graphs. 299-333","address":"https://doi.org/10.1145/567097.567098","index":425},"https://doi.org/10.1145/567097.567099":{"title":"Mark van den Brand, Jan Heering, Paul Klint, Pieter A. Olivier: Compiling language definitions: the ASF+SDF compiler. 334-368","address":"https://doi.org/10.1145/567097.567099","index":426},"https://doi.org/10.1145/567097.567100":{"title":"Christian S. Collberg: Automatic derivation of compiler machine descriptions. 369-408","address":"https://doi.org/10.1145/567097.567100","index":427},"https://doi.org/10.1145/567097.567101":{"title":"Marta Jiménez, José M. Llabería, Agustín Fernández: Register tiling in nonrectangular iteration spaces. 409-453","address":"https://doi.org/10.1145/567097.567101","index":428},"https://doi.org/10.1145/570886.570887":{"title":"G. Ramalingam: On loops, dominators, and dominance frontiers. 455-490","address":"https://doi.org/10.1145/570886.570887","index":429},"https://doi.org/10.1145/570886.570888":{"title":"K. Rustan M. Leino, Greg Nelson: Data abstraction and information hiding. 491-553","address":"https://doi.org/10.1145/570886.570888","index":430},"https://doi.org/10.1145/570886.570889":{"title":"Arthur Charlesworth: The undecidability of associativity and commutativity analysis. 554-565","address":"https://doi.org/10.1145/570886.570889","index":431},"https://doi.org/10.1145/570886.570890":{"title":"Matthew Hennessy, James Riely: Information flow vs. resource access in the asynchronous pi-calculus. 566-591","address":"https://doi.org/10.1145/570886.570890","index":432},"https://doi.org/10.1145/586088.586089":{"title":"Martin Hirzel, Amer Diwan, Johannes Henkel: On the usefulness of type and liveness accuracy for garbage collection and leak detection. 593-624","address":"https://doi.org/10.1145/586088.586089","index":433},"https://doi.org/10.1145/586088.586090":{"title":"Frank Tip, Peter F. Sweeney, Chris Laffra, Aldo Eisma, David Streeter: Practical extraction techniques for Java. 625-666","address":"https://doi.org/10.1145/586088.586090","index":434},"https://doi.org/10.1145/586088.586091":{"title":"Minghui Yang, Gang-Ryung Uh, David B. Whalley: Efficient and effective branch reordering using profile data. 667-697","address":"https://doi.org/10.1145/586088.586091","index":435},"https://doi.org/10.1145/586088.586092":{"title":"Rafael Corchuelo, José Antonio Pérez, Antonio Ruiz Cortés, Miguel Toro: Repairing syntax errors in LR parsers. 698-710","address":"https://doi.org/10.1145/586088.586092","index":436},"https://doi.org/10.1145/586088.586093":{"title":"Dominic Duggan: Type-Safe linking with recursive DLLs and shared libraries. 711-804","address":"https://doi.org/10.1145/586088.586093","index":437},"https://doi.org/10.1145/383721.383725":{"title":"Stefano Bistarelli, Ugo Montanari, Francesca Rossi: Semiring-based contstraint logic programming: syntax and semantics. 1-29","address":"https://doi.org/10.1145/383721.383725","index":438},"https://doi.org/10.1145/383721.383732":{"title":"Amer Diwan, Kathryn S. McKinley, J. Eliot B. Moss: Using types to analyze and optimize object-oriented programs. 30-72","address":"https://doi.org/10.1145/383721.383732","index":439},"https://doi.org/10.1145/383721.383733":{"title":"Allen Leung, Krishna V. Palem, Amir Pnueli: Scheduling time-constrained instructions on pipelined processors. 73-103","address":"https://doi.org/10.1145/383721.383733","index":440},"https://doi.org/10.1145/383043.381532":{"title":"Barbara G. Ryder, William Landi, Phil Stocks, Sean Zhang, Rita Altucher: A schema for interprocedural modification side-effect analysis with pointer aliasing. 105-186","address":"https://doi.org/10.1145/383043.381532","index":441},"https://doi.org/10.1145/383043.383044":{"title":"Paul C. Attie, E. Allen Emerson: Synthesis of concurrent programs for an atomic read/write model of computation. 187-242","address":"https://doi.org/10.1145/383043.383044","index":442},"https://doi.org/10.1145/383043.383045":{"title":"Todd B. Knoblock, Jakob Rehof: Type elaboration and subtype completion for Java bytecode. 243-272","address":"https://doi.org/10.1145/383043.383045","index":443},"https://doi.org/10.1145/503502.503503":{"title":"Rajeev Alur, Mihalis Yannakakis: Model checking of hierarchical state machines. 273-303","address":"https://doi.org/10.1145/503502.503503","index":444},"https://doi.org/10.1145/503502.503504":{"title":"Sandro Etalle, Maurizio Gabbrielli, Maria Chiara Meo: Transformations of CCP programs. 304-395","address":"https://doi.org/10.1145/503502.503504","index":445},"https://doi.org/10.1145/503502.503505":{"title":"Atsushi Igarashi, Benjamin C. Pierce, Philip Wadler: Featherweight Java: a minimal core calculus for Java and GJ. 396-450","address":"https://doi.org/10.1145/503502.503505","index":446},"https://doi.org/10.1145/504083.504084":{"title":"Ik-Soon Kim, Kwang-Moo Choe: Error repair with validation in LR-based parsing. 451-471","address":"https://doi.org/10.1145/504083.504084","index":447},"https://doi.org/10.1145/504083.504085":{"title":"Gopal Gupta, Enrico Pontelli, Khayri A. M. Ali, Mats Carlsson, Manuel V. Hermenegildo: Parallel execution of prolog programs: a survey. 472-602","address":"https://doi.org/10.1145/504083.504085","index":448},"https://doi.org/10.1145/504709.504710":{"title":"Keith D. Cooper, L. Taylor Simpson, Christopher A. Vick: Operator strength reduction. 603-625","address":"https://doi.org/10.1145/504709.504710","index":449},"https://doi.org/10.1145/504709.504711":{"title":"Lawrence C. Paulson: Mechanizing a theory of program composition for UNITY. 626-656","address":"https://doi.org/10.1145/504709.504711","index":450},"https://doi.org/10.1145/504709.504712":{"title":"Andrew W. Appel, David A. McAllester: An indexed model of recursive types for foundational proof-carrying code. 657-683","address":"https://doi.org/10.1145/504709.504712","index":451},"https://doi.org/10.1145/506315.506316":{"title":"David Grove, Craig Chambers: A framework for call graph construction algorithms. 685-746","address":"https://doi.org/10.1145/506315.506316","index":452},"https://doi.org/10.1145/506315.506317":{"title":"Jason Maassen, Rob van Nieuwpoort, Ronald Veldema, Henri E. Bal, Thilo Kielmann, Ceriel J. H. Jacobs, Rutger F. H. Hofman: Efficient Java RMI for parallel programming. 747-775","address":"https://doi.org/10.1145/506315.506317","index":453},"https://doi.org/10.1145/506315.506318":{"title":"Bradley T. Vander Zanden, Richard L. Halterman, Brad A. Myers, Richard G. McDaniel, Robert C. Miller, Pedro A. Szekely, Dario A. Giuse, David S. Kosbie: Lessons learned about one-way, dataflow constraints in the Garnet and Amulet graphical toolkits. 776-796","address":"https://doi.org/10.1145/506315.506318","index":454},"https://doi.org/10.1145/345099.345100":{"title":"Benjamin C. Pierce, David N. Turner: Local type inference. 1-44","address":"https://doi.org/10.1145/345099.345100","index":455},"https://doi.org/10.1145/345099.345102":{"title":"Wan J. Fokkink, Jasper Kamperman, Pum Walters: Lazy rewriting on eager machinery. 45-86","address":"https://doi.org/10.1145/345099.345102","index":456},"https://doi.org/10.1145/345099.345104":{"title":"Orna Kupferman, Moshe Y. Vardi: An automata-theortetic approach to modular model checking. 87-128","address":"https://doi.org/10.1145/345099.345104","index":457},"https://doi.org/10.1145/345099.345125":{"title":"Zhong Shao, Andrew W. Appel: Efficient and safe-for-space closure conversion. 129-161","address":"https://doi.org/10.1145/345099.345125","index":458},"https://doi.org/10.1145/345099.345137":{"title":"Thomas W. Reps: Undecidability of context-sensitive data-independence analysis. 162-186","address":"https://doi.org/10.1145/345099.345137","index":459},"https://doi.org/10.1145/349214.349216":{"title":"Manuel V. Hermenegildo, Germán Puebla, Kim Marriott, Peter J. Stuckey: Incremental analysis of constraint logic programs. 187-223","address":"https://doi.org/10.1145/349214.349216","index":460},"https://doi.org/10.1145/349214.349219":{"title":"Michael Sperber, Peter Thiemann: Generation of LR parsers by partial evaluation. 224-264","address":"https://doi.org/10.1145/349214.349219","index":461},"https://doi.org/10.1145/349214.349222":{"title":"José E. Moreira, Samuel P. Midkiff, Manish Gupta: From flop to megaflops: Java for technical computing. 265-295","address":"https://doi.org/10.1145/349214.349222","index":462},"https://doi.org/10.1145/349214.349224":{"title":"Maria J. García de la Banda, Manuel V. Hermenegildo, Kim Marriott: Independence in CLP languages. 296-339","address":"https://doi.org/10.1145/349214.349224","index":463},"https://doi.org/10.1145/349214.349230":{"title":"Xavier Leroy, François Pessaux: Type-based analysis of uncaught exceptions. 340-377","address":"https://doi.org/10.1145/349214.349230","index":464},"https://doi.org/10.1145/349214.349233":{"title":"Saumya K. Debray, William S. Evans, Robert Muth, Bjorn De Sutter: Compiler techniques for code compaction. 378-415","address":"https://doi.org/10.1145/349214.349233","index":465},"https://doi.org/10.1145/349214.349241":{"title":"G. Ramalingam: Context-sensitive synchronization-sensitive analysis is undecidable. 416-430","address":"https://doi.org/10.1145/349214.349241","index":466},"https://doi.org/10.1145/353926.353929":{"title":"Guei-Yuan Lueh, Thomas R. Gross, Ali-Reza Adl-Tabatabai: Fusion-based register allocation. 431-470","address":"https://doi.org/10.1145/353926.353929","index":467},"https://doi.org/10.1145/353926.353933":{"title":"Lars Ræder Clausen, Ulrik Pagh Schultz, Charles Consel, Gilles Muller: Java bytecode compression for low-end embedded systems. 471-489","address":"https://doi.org/10.1145/353926.353933","index":468},"https://doi.org/10.1145/353926.353937":{"title":"Thomas Kistler, Michael Franz: Automated data-member layout of help objects to improve memory-hierarchy performance. 490-505","address":"https://doi.org/10.1145/353926.353937","index":469},"https://doi.org/10.1145/353926.353938":{"title":"Andy J. Wellings, Bob Johnson, Bo Ingvar Sandén, Jörg Kienzle, Thomas Wolf, Stephen Michell: Integrating object-oriented programming and protected objects in Ada 95. 506-539","address":"https://doi.org/10.1145/353926.353938","index":470},"https://doi.org/10.1145/353926.353940":{"title":"Gregor Snelting, Frank Tip: Understanding class hierarchies using concept analysis. 540-582","address":"https://doi.org/10.1145/353926.353940","index":471},"https://doi.org/10.1145/363911.363914":{"title":"Uwe Aßmann: Graph rewrite systems for program optimization. 583-637","address":"https://doi.org/10.1145/363911.363914","index":472},"https://doi.org/10.1145/363911.363915":{"title":"Zhenyu Qian: Standard fixpoint iteration for Java bytecode verification. 638-672","address":"https://doi.org/10.1145/363911.363915","index":473},"https://doi.org/10.1145/363911.363920":{"title":"Hong Tang, Kai Shen, Tao Yang: Program transformation and runtime support for threaded MPI execution on shared-memory machines. 673-700","address":"https://doi.org/10.1145/363911.363920","index":474},"https://doi.org/10.1145/363911.363923":{"title":"David Walker, Karl Crary, J. Gregory Morrisett: Typed memory management via static capabilities. 701-771","address":"https://doi.org/10.1145/363911.363923","index":475},"https://doi.org/10.1145/365151.365152":{"title":"Fabien Quilleré, Sanjay V. Rajopadhye: Optimizing memory usage in the polyhedral model. 773-815","address":"https://doi.org/10.1145/365151.365152","index":476},"https://doi.org/10.1145/365151.365161":{"title":"Reinhard von Hanxleden, Ken Kennedy: A balanced code placement framework. 816-860","address":"https://doi.org/10.1145/365151.365161","index":477},"https://doi.org/10.1145/365151.365169":{"title":"Agostino Dovier, Carla Piazza, Enrico Pontelli, Gianfranco Rossi: Sets and constraint logic programming. 861-931","address":"https://doi.org/10.1145/365151.365169","index":478},"https://doi.org/10.1145/365151.367161":{"title":"Brian Grant, Markus Mock, Matthai Philipose, Craig Chambers, Susan J. Eggers: The benefits and costs of DyC's run-time optimizations. 932-972","address":"https://doi.org/10.1145/365151.367161","index":479},"https://doi.org/10.1145/371880.371881":{"title":"Maya Madhavan, Priti Shankar, Siddhartha Rai, U. Ramakrishna: Extending Graham-Glanville techniques for optimal code generation. 973-1001","address":"https://doi.org/10.1145/371880.371881","index":480},"https://doi.org/10.1145/371880.371884":{"title":"Krzysztof R. Apt: The role of commutativity in constraint propagation algorithms. 1002-1036","address":"https://doi.org/10.1145/371880.371884","index":481},"https://doi.org/10.1145/371880.371887":{"title":"Dan Grossman, J. Gregory Morrisett, Steve Zdancewic: Syntactic type abstraction. 1037-1080","address":"https://doi.org/10.1145/371880.371887","index":482},"https://doi.org/10.1145/314602.314603":{"title":"Eberhard Bertsch, Mark-Jan Nederhof: On Failure of the Pruning Technique in \"Error Repair in Shift-Reduce Parsers\". 1-10","address":"https://doi.org/10.1145/314602.314603","index":483},"https://doi.org/10.1145/314602.314604":{"title":"Dominic Duggan: Dynamic Typing for Distributed Programming in Polymorphic Languages. 11-45","address":"https://doi.org/10.1145/314602.314604","index":484},"https://doi.org/10.1145/314602.314605":{"title":"Zhiming Liu, Mathai Joseph: Specification and Verification of Fault-Tolerance, Timing, and Scheduling. 46-89","address":"https://doi.org/10.1145/314602.314605","index":485},"https://doi.org/10.1145/314602.314606":{"title":"Raymie Stata, Martín Abadi: A Type System for Java Bytecode Subroutines. 90-137","address":"https://doi.org/10.1145/314602.314606","index":486},"https://doi.org/10.1145/314602.314607":{"title":"Girija J. Narlikar, Guy E. Blelloch: Space-Efficient Scheduling of Nested Parallelism. 138-173","address":"https://doi.org/10.1145/314602.314607","index":487},"https://doi.org/10.1145/316686.316687":{"title":"G. Ramalingam: Identifying Loops in Almost Linear Time. 175-188","address":"https://doi.org/10.1145/316686.316687","index":488},"https://doi.org/10.1145/316686.316688":{"title":"Francisco Bueno, Maria J. García de la Banda, Manuel V. Hermenegildo: Effectivness of Abstract Interpretation in Automatic Parallelization: A Case Study in Logic Programming. 189-239","address":"https://doi.org/10.1145/316686.316688","index":489},"https://doi.org/10.1145/316686.316690":{"title":"John Greiner, Guy E. Blelloch: A Provably Time-Efficient Parallel Implementation of Full Speculation. 240-285","address":"https://doi.org/10.1145/316686.316690","index":490},"https://doi.org/10.1145/316686.316693":{"title":"Luiz De Rose, David A. Padua: Techniques for the Translation of MATLAB Programs into Fortran 90. 286-323","address":"https://doi.org/10.1145/316686.316693","index":491},"https://doi.org/10.1145/316686.316697":{"title":"Massimiliano Poletto, Wilson C. Hsieh, Dawson R. Engler, M. Frans Kaashoek: 'C and tcc: A Language and Compiler for Dynamic Code Generation. 324-369","address":"https://doi.org/10.1145/316686.316697","index":492},"https://doi.org/10.1145/316686.316703":{"title":"Cormac Flanagan, Matthias Felleisen: Componential Set-Based Analysis. 370-416","address":"https://doi.org/10.1145/316686.316703","index":493},"https://doi.org/10.1145/319301.319303":{"title":"Michael J. Butler, Pieter H. Hartel: Reasoning about Grover's quantum search algorithm using probabilistic wp. 417-429","address":"https://doi.org/10.1145/319301.319303","index":494},"https://doi.org/10.1145/319301.319309":{"title":"Gudjon Gudjonsson, William H. Winsborough: Compile-time memory reuse in logic programming languages through update in place. 430-501","address":"https://doi.org/10.1145/319301.319309","index":495},"https://doi.org/10.1145/319301.319317":{"title":"Leslie Lamport, Lawrence C. Paulson: Should your specification language be typed. 502-526","address":"https://doi.org/10.1145/319301.319317","index":496},"https://doi.org/10.1145/319301.319345":{"title":"J. Gregory Morrisett, David Walker, Karl Crary, Neal Glew: From system F to typed assembly language. 527-568","address":"https://doi.org/10.1145/319301.319345","index":497},"https://doi.org/10.1145/319301.319347":{"title":"Seif Haridi, Peter Van Roy, Per Brand, Michael Mehl, Ralf Scheidhauer, Gert Smolka: Efficient logic variables for distributed computing. 569-626","address":"https://doi.org/10.1145/319301.319347","index":498},"https://doi.org/10.1145/319301.319348":{"title":"Robert Kennedy, Sun Chan, Shin-Ming Liu, Raymond Lo, Peng Tu, Fred C. Chow: Partial redundancy elimination in SSA form. 627-676","address":"https://doi.org/10.1145/319301.319348","index":499},"https://doi.org/10.1145/319301.319350":{"title":"Joseph M. Morris, Alexander Bunkenburg: Specificational functions. 677-701","address":"https://doi.org/10.1145/319301.319350","index":500},"https://doi.org/10.1145/325478.325479":{"title":"Somnath Ghosh, Margaret Martonosi, Sharad Malik: Cache miss equations: a compiler framework for analyzing and tuning memory behavior. 703-746","address":"https://doi.org/10.1145/325478.325479","index":501},"https://doi.org/10.1145/325478.325480":{"title":"Tevfik Bultan, Richard Gerber, William Pugh: Model-checking concurrent systems with unbounded integer variables: symbolic representations, approximations, and experimental results. 747-789","address":"https://doi.org/10.1145/325478.325480","index":502},"https://doi.org/10.1145/325478.325481":{"title":"Matthias Blume: Dependency analysis for Standard ML. 790-812","address":"https://doi.org/10.1145/325478.325481","index":503},"https://doi.org/10.1145/325478.325518":{"title":"Matthias Blume, Andrew W. Appel: Hierarchical modularity. 813-847","address":"https://doi.org/10.1145/325478.325518","index":504},"https://doi.org/10.1145/325478.325519":{"title":"Michael Hind, Michael G. Burke, Paul R. Carini, Jong-Deok Choi: Interprocedural pointer alias analysis. 848-894","address":"https://doi.org/10.1145/325478.325519","index":505},"https://doi.org/10.1145/330249.330250":{"title":"Massimiliano Poletto, Vivek Sarkar: Linear scan register allocation. 895-913","address":"https://doi.org/10.1145/330249.330250","index":506},"https://doi.org/10.1145/330249.330251":{"title":"Naoki Kobayashi, Benjamin C. Pierce, David N. Turner: Linearity and the pi-calculus. 914-947","address":"https://doi.org/10.1145/330249.330251","index":507},"https://doi.org/10.1145/330249.330252":{"title":"Michael Codish, Harald Søndergaard, Peter J. Stuckey: Sharing and groundness dependencies in logic programs. 948-976","address":"https://doi.org/10.1145/330249.330252","index":508},"https://doi.org/10.1145/330249.330254":{"title":"Nicholas C. Gloy, Michael D. Smith: Procedure placement using temporal-ordering information. 977-1027","address":"https://doi.org/10.1145/330249.330254","index":509},"https://doi.org/10.1145/330249.330255":{"title":"Cliff Young, Michael D. Smith: Static correlated branch prediction. 1028-1075","address":"https://doi.org/10.1145/330249.330255","index":510},"https://doi.org/10.1145/330643.330644":{"title":"Paolo Bottoni, Maria Francesca Costabile, Piero Mussio: Specification and dialogue control of visual interaction through visual rewriting systems. 1077-1136","address":"https://doi.org/10.1145/330643.330644","index":511},"https://doi.org/10.1145/330643.330645":{"title":"Stefaan Decorte, Danny De Schreye, Henk Vandecasteele: Constraint-based termination analysis of logic programs. 1137-1195","address":"https://doi.org/10.1145/330643.330645","index":512},"https://doi.org/10.1145/330643.330646":{"title":"Stephen N. Freund, John C. Mitchell: The type system for object initializatiion in the Jave bytecode language. 1196-1250","address":"https://doi.org/10.1145/330643.330646","index":513},"https://doi.org/10.1145/330643.330647":{"title":"Mahmut T. Kandemir, Prithviraj Banerjee, Alok N. Choudhary, J. Ramanujam, U. Nagaraj Shenoy: A global communication optimization technique based on data-flow analysis and linear algebra. 1251-1297","address":"https://doi.org/10.1145/330643.330647","index":514},"https://doi.org/10.1145/271510.271517":{"title":"Shmuel Sagiv, Thomas W. Reps, Reinhard Wilhelm: Solving Shape-Analysis Problems in Languages with Destructive Updating. 1-50","address":"https://doi.org/10.1145/271510.271517","index":515},"https://doi.org/10.1145/271510.271519":{"title":"Paul C. Attie, E. Allen Emerson: Synthesis of Concurrent Systems with Many Similar Processes. 51-115","address":"https://doi.org/10.1145/271510.271519","index":516},"https://doi.org/10.1145/271510.271521":{"title":"Eric Dujardin, Eric Amiel, Eric Simon: Fast Algorithms for Compressed Multimethod Dispatch Table Generation. 116-165","address":"https://doi.org/10.1145/271510.271521","index":517},"https://doi.org/10.1145/271510.271523":{"title":"Andrew K. Wright, Suresh Jagannathan: Polymorphic Splitting: An Effective Polyvariant Flow Analysis. 166-207","address":"https://doi.org/10.1145/271510.271523","index":518},"https://doi.org/10.1145/271510.271525":{"title":"Michael Leuschel, Bern Martens, Danny De Schreye: Controlling Generalization amd Polyvariance in Partial Deduction of Normal Logic Programs. 208-258","address":"https://doi.org/10.1145/271510.271525","index":519},"https://doi.org/10.1145/276393.276394":{"title":"Thomas W. Reps: \"Maximal-munch\" Tokenization in Linear Time. 259-273","address":"https://doi.org/10.1145/276393.276394","index":520},"https://doi.org/10.1145/276393.276395":{"title":"Jun Lang, David B. Stewart: A Study of the Applicability of Existing Exception-Handling Techniques to Component-Base Real-Time Software Technology. 274-301","address":"https://doi.org/10.1145/276393.276395","index":521},"https://doi.org/10.1145/276393.276396":{"title":"Daniel Jackson, Somesh Jha, Craig Damon: Isomorph-Free Model Enumeration: A New Method for Checking Relational Specifications. 302-343","address":"https://doi.org/10.1145/276393.276396","index":522},"https://doi.org/10.1145/276393.276397":{"title":"Rémi Douence, Pascal Fradet: A Systematic Study of Functional Language Implementations. 344-387","address":"https://doi.org/10.1145/276393.276397","index":523},"https://doi.org/10.1145/276393.278523":{"title":"Vugranam C. Sreedhar, Guang R. Gao, Yong-Fong Lee: A New Framework for Elimination-Based Data Flow Analysis Using DJ Graphs. 388-435","address":"https://doi.org/10.1145/276393.278523","index":524},"https://doi.org/10.1145/276393.278524":{"title":"Naoki Kobayashi: A Partially Deadlock-Free Typed Process Calculus. 436-482","address":"https://doi.org/10.1145/276393.278524","index":525},"https://doi.org/10.1145/291889.291893":{"title":"Martin C. Rinard, Monica S. Lam: The Design, Implementation, and Evaluation of Jade. 483-545","address":"https://doi.org/10.1145/291889.291893","index":526},"https://doi.org/10.1145/291889.291895":{"title":"Yanhong A. Liu, Scott D. Stoller, Tim Teitelbaum: Static Caching for Incremental Computation. 546-585","address":"https://doi.org/10.1145/291889.291895","index":527},"https://doi.org/10.1145/291889.291897":{"title":"Konstantinos Sagonas, Terrance Swift: An Abstract Machine for Tabled Execution of Fixed-Order Stratified Logic Programs. 586-634","address":"https://doi.org/10.1145/291889.291897","index":528},"https://doi.org/10.1145/291889.291900":{"title":"William Pugh, David Wonnacott: Constraint-Based Array Dependence Analysis. 635-678","address":"https://doi.org/10.1145/291889.291900","index":529},"https://doi.org/10.1145/291889.291903":{"title":"Wan J. Fokkink, Jasper Kamperman, Pum Walters: Within ARM's Reach: Compilation of Left-Linear Rewrite Systems via Minimal Rewrite Systems. 679-706","address":"https://doi.org/10.1145/291889.291903","index":530},"https://doi.org/10.1145/291891.291892":{"title":"Oukseh Lee, Kwangkeun Yi: Proofs about a Folklore Let-Polymorphic Type Inference Algorithm. 707-723","address":"https://doi.org/10.1145/291891.291892","index":531},"https://doi.org/10.1145/291891.291894":{"title":"Mads Tofte, Lars Birkedal: A Region Inference Algorithm. 724-767","address":"https://doi.org/10.1145/291891.291894","index":532},"https://doi.org/10.1145/291891.291896":{"title":"María Alpuente, Moreno Falaschi, Germán Vidal: Partial Evaluation of Functional Logic Programs. 768-844","address":"https://doi.org/10.1145/291891.291896","index":533},"https://doi.org/10.1145/291891.291898":{"title":"J. Michael Ashley, R. Kent Dybvig: A Practical and Flexible Flow Analysis for Higher-Order Languages. 845-868","address":"https://doi.org/10.1145/291891.291898","index":534},"https://doi.org/10.1145/291891.291901":{"title":"Ken Kennedy, Ulrich Kremer: Automatic Data Layout for Distributed-Memory Machines. 869-916","address":"https://doi.org/10.1145/291891.291901","index":535},"https://doi.org/10.1145/293677.293681":{"title":"Eric Y. T. Juan, Jeffrey J. P. Tsai, Tadao Murata: Compositional Verification of Concurrent Systems Using Petri-Net-Based Condensation Rules. 917-979","address":"https://doi.org/10.1145/293677.293681","index":536},"https://doi.org/10.1145/293677.293678":{"title":"Tim A. Wagner, Susan L. Graham: Efficient and Flexible Incremental Parsing. 980-1013","address":"https://doi.org/10.1145/293677.293678","index":537},"https://doi.org/10.1145/293677.293679":{"title":"Krzysztof R. Apt, Jacob Brunekreef, Vincent Partington, Andrea Schaerf: Alma-O: An Imperative Language That Supports Declarative Programming. 1014-1066","address":"https://doi.org/10.1145/293677.293679","index":538},"https://doi.org/10.1145/293677.293680":{"title":"Roberto Giacobazzi, Francesca Scozzari: A Logical Model for Relational Abstract Domains. 1067-1109","address":"https://doi.org/10.1145/293677.293680","index":539},"https://doi.org/10.1145/295656.295657":{"title":"Dhananjay M. Dhamdhere, K. V. Sankaranarayanan: Dynamic Currency Determination in Optimized Programs. 1111-1130","address":"https://doi.org/10.1145/295656.295657","index":540},"https://doi.org/10.1145/295656.295658":{"title":"Saniya Ben Hassen, Henri E. Bal, Ceriel J. H. Jacobs: A Task- and Data-Parallel Programming Language Based on Shared Objects. 1131-1170","address":"https://doi.org/10.1145/295656.295658","index":541},"https://doi.org/10.1145/295656.295659":{"title":"Rajeev Alur, Thomas A. Henzinger: Finitary Fairness. 1171-1194","address":"https://doi.org/10.1145/295656.295659","index":542},"https://doi.org/10.1145/295656.295660":{"title":"Tao Yang, Cong Fu: Space/Time-Efficient Scheduling and Execution of Parallel Irregular Computations. 1195-1222","address":"https://doi.org/10.1145/295656.295660","index":543},"https://doi.org/10.1145/295656.295661":{"title":"Andrew D. Kelly, Kim Marriott, Andrew D. Macdonald, Peter J. Stuckey, Roland H. C. Yap: Optimizing Compilation of CLP(R). 1223-1250","address":"https://doi.org/10.1145/295656.295661","index":544},"https://doi.org/10.1145/295656.295662":{"title":"Jens Palsberg: Equality-based flow analysis versus recursive types. 1251-1264","address":"https://doi.org/10.1145/295656.295662","index":545},"https://doi.org/10.1145/295656.295663":{"title":"Adam L. Buchsbaum, Haim Kaplan, Anne Rogers, Jeffery R. Westbrook: A New, Simpler Linear-Time Dominators Algorithm. 1265-1296","address":"https://doi.org/10.1145/295656.295663","index":546},"https://doi.org/10.1145/295656.295664":{"title":"Max Hailperin: Cost-Optimal Code Motion. 1297-1322","address":"https://doi.org/10.1145/295656.295664","index":547},"https://doi.org/10.1145/239912.239913":{"title":"Susan Horwitz: Precise Flow-Insensitive May-Alias Analysis is NP-Hard. 1-6","address":"https://doi.org/10.1145/239912.239913","index":548},"https://doi.org/10.1145/239912.239914":{"title":"Agostino Cortesi, Gilberto Filé, Roberto Giacobazzi, Catuscia Palamidessi, Francesco Ranzato: Complementation in Abstract Interpretation. 7-47","address":"https://doi.org/10.1145/239912.239914","index":549},"https://doi.org/10.1145/239912.239915":{"title":"Paul Steckler, Mitchell Wand: Lightweight Closure Conversion. 48-86","address":"https://doi.org/10.1145/239912.239915","index":550},"https://doi.org/10.1145/239912.239917":{"title":"Andrew K. Wright, Robert Cartwright: A Practical Soft Type System for Scheme. 87-152","address":"https://doi.org/10.1145/239912.239917","index":551},"https://doi.org/10.1145/239912.239922":{"title":"Gerald Baumgartner, Vincent F. Russo: Implementing Signatures for C++. 153-187","address":"https://doi.org/10.1145/239912.239922","index":552},"https://doi.org/10.1145/239912.239923":{"title":"Brad Calder, Dirk Grunwald, Michael P. Jones, Donald C. Lindsay, James H. Martin, Michael Mozer, Benjamin G. Zorn: Evidence-Based Static Branch Prediction Using Machine Learning. 188-222","address":"https://doi.org/10.1145/239912.239923","index":553},"https://doi.org/10.1145/244795.244798":{"title":"Nicholas Pippenger: Pure Versus Impure Lisp. 223-238","address":"https://doi.org/10.1145/244795.244798","index":554},"https://doi.org/10.1145/244795.244799":{"title":"Vugranam C. Sreedhar, Guang R. Gao, Yong-Fong Lee: Incremental Computation of Dominator Trees. 239-252","address":"https://doi.org/10.1145/244795.244799","index":555},"https://doi.org/10.1145/244795.244800":{"title":"Dennis Dams, Rob Gerth, Orna Grumberg: Abstract Interpretation of Reactive Systems. 253-291","address":"https://doi.org/10.1145/244795.244800","index":556},"https://doi.org/10.1145/244795.244801":{"title":"Daniel M. Yellin, Robert E. Strom: Protocol Specifications and Component Adaptors. 292-333","address":"https://doi.org/10.1145/244795.244801","index":557},"https://doi.org/10.1145/244795.244802":{"title":"Patrick M. Sansom, Simon L. Peyton Jones: Formally Based Profiling for Higher-Order Functional Languages. 334-385","address":"https://doi.org/10.1145/244795.244802","index":558},"https://doi.org/10.1145/244795.244803":{"title":"Jin Yang, Aloysius K. Mok, Farn Wang: Symboloc Model Checking for Event-Driven Real-Time Systems. 386-412","address":"https://doi.org/10.1145/244795.244803","index":559},"https://doi.org/10.1145/256167.256174":{"title":"Charles L. A. Clarke, Gordon V. Cormack: On the Use of Regular Expressions for Searching Text. 413-426","address":"https://doi.org/10.1145/256167.256174","index":560},"https://doi.org/10.1145/256167.256195":{"title":"Dexter Kozen: Kleene Algebra with Tests. 427-443","address":"https://doi.org/10.1145/256167.256195","index":561},"https://doi.org/10.1145/256167.256201":{"title":"Zhenjiang Hu, Hideya Iwasaki, Masato Takeichi: Formal Derivation of Efficient Parallel Programs by Construction of List Homomorphisms. 444-461","address":"https://doi.org/10.1145/256167.256201","index":562},"https://doi.org/10.1145/256167.256217":{"title":"Keshav Pingali, Gianfranco Bilardi: Optimal Control Dependence Computation and the Roman Chariots Problem. 462-491","address":"https://doi.org/10.1145/256167.256217","index":563},"https://doi.org/10.1145/256167.256225":{"title":"Norman Ramsey, Mary F. Fernandez: Specifying Representations of Machine Instructions. 492-524","address":"https://doi.org/10.1145/256167.256225","index":564},"https://doi.org/10.1145/256167.256394":{"title":"Richard Gerber, Seongsoo Hong: Slicing Real-Time Programs for Enhanced Schedulability. 525-555","address":"https://doi.org/10.1145/256167.256394","index":565},"https://doi.org/10.1145/262004.262005":{"title":"Paul Havlak: Nesting of Reducible and Irreducible Loops. 557-567","address":"https://doi.org/10.1145/262004.262005","index":566},"https://doi.org/10.1145/262004.262006":{"title":"Saumya K. Debray, Todd A. Proebsting: Interprocedural Control Flow Analysis of First-Order Programs with Tail-Call Optimization. 568-585","address":"https://doi.org/10.1145/262004.262006","index":567},"https://doi.org/10.1145/262004.262007":{"title":"Peter T. Breuer, Carlos Delgado Kloos, Andrés Marín López, Natividad Martínez Madrid, Luis Sánchez Fernández: A Refinement Calculus for the Synthesis of Verified Hardware Descriptions in VHDL. 585-616","address":"https://doi.org/10.1145/262004.262007","index":568},"https://doi.org/10.1145/262004.262008":{"title":"E. Allen Emerson, A. Prasad Sistla: Utilizing Symmetry when Model-Checking under Fairness Assumptions: An Automata-Theoretic Approach. 617-638","address":"https://doi.org/10.1145/262004.262008","index":569},"https://doi.org/10.1145/265943.265944":{"title":"Jan A. Bergstra, T. B. Dinesh, John Field, Jan Heering: Toward a Complete Transformational Toolkit for Compilers. 639-684","address":"https://doi.org/10.1145/265943.265944","index":570},"https://doi.org/10.1145/265943.265954":{"title":"Frank S. de Boer, Maurizio Gabbrielli, Elena Marchiori, Catuscia Palamidessi: Proving Concurrent Constraint Programs Correct. 685-725","address":"https://doi.org/10.1145/265943.265954","index":571},"https://doi.org/10.1145/265943.265960":{"title":"Edmund M. Clarke, Orna Grumberg, Somesh Jha: Verifying Parameterized Networks. 726-750","address":"https://doi.org/10.1145/265943.265960","index":572},"https://doi.org/10.1145/265943.265966":{"title":"Thomas P. Jensen: Disjunctive Program Analysis for Algebraic Data Types. 751-803","address":"https://doi.org/10.1145/265943.265966","index":573},"https://doi.org/10.1145/265943.265972":{"title":"Peter Van Roy, Seif Haridi, Per Brand, Gert Smolka, Michael Mehl, Ralf Scheidhauer: Mobile Objects in Distributed Oz. 804-851","address":"https://doi.org/10.1145/265943.265972","index":574},"https://doi.org/10.1145/267959.269966":{"title":"Soo-Mook Moon, Kemal Ebcioglu: Parallelizing Nonnumerical Code with Selective Scheduling and Software Pipelining. 853-898","address":"https://doi.org/10.1145/267959.269966","index":575},"https://doi.org/10.1145/267959.269967":{"title":"N. Raja, R. K. Shyamasundar: Combinatory Formaulations of Concurrent Languages. 899-915","address":"https://doi.org/10.1145/267959.269967","index":576},"https://doi.org/10.1145/267959.269968":{"title":"Amr Sabry, Philip Wadler: A Reflection on Call-by-Value. 916-941","address":"https://doi.org/10.1145/267959.269968","index":577},"https://doi.org/10.1145/267959.269969":{"title":"Martin C. Rinard, Pedro C. Diniz: Commutativity Analysis: A New Analysis Technique for Parallelizing Compilers. 942-991","address":"https://doi.org/10.1145/267959.269969","index":578},"https://doi.org/10.1145/267959.269970":{"title":"Evelyn Duesterwald, Rajiv Gupta, Mary Lou Soffa: A Practical Framework for Demand-Driven Interprocedural Data Flow Analysis. 992-1030","address":"https://doi.org/10.1145/267959.269970","index":579},"https://doi.org/10.1145/267959.269971":{"title":"Johan Janssen, Henk Corporaal: Making Graphs Reducible with Controlled Node Splitting. 1031-1052","address":"https://doi.org/10.1145/267959.269971","index":580},"https://doi.org/10.1145/267959.267960":{"title":"Deborah Whitfield, Mary Lou Soffa: An Approach for Exploring Code-Improving Transformations. 1053-1084","address":"https://doi.org/10.1145/267959.267960","index":581},"https://doi.org/10.1145/267959.269973":{"title":"Ting Yu, Owen Kaser: A Note on \"On the Conversion of Indirect to Direct Recursion\". 1085-1087","address":"https://doi.org/10.1145/267959.269973","index":582},"https://doi.org/10.1145/225540.225541":{"title":"Stephan Murer, Stephen M. Omohundro, David Stoutamire, Clemens A. Szyperski: Iteration Abstraction in Sather. 1-15","address":"https://doi.org/10.1145/225540.225541","index":583},"https://doi.org/10.1145/225540.225542":{"title":"Alan Carle, Lori L. Pollock: On the Optimality of Change Propagation for Incremental Evaluation of Hierarchical Attribute Grammars. 16-29","address":"https://doi.org/10.1145/225540.225542","index":584},"https://doi.org/10.1145/225540.225543":{"title":"Brad T. Vander Zanden: An Incremental Algorithm for Satisfying Hierarchies of Multiway Dataflow Constraints. 30-72","address":"https://doi.org/10.1145/225540.225543","index":585},"https://doi.org/10.1145/225540.225544":{"title":"John Boyland: Conditional Attribute Grammars. 73-108","address":"https://doi.org/10.1145/225540.225544","index":586},"https://doi.org/10.1145/227699.227700":{"title":"Cordelia V. Hall, Kevin Hammond, Simon L. Peyton Jones, Philip Wadler: Type Classes in Haskell. 109-138","address":"https://doi.org/10.1145/227699.227700","index":587},"https://doi.org/10.1145/227699.227701":{"title":"John R. Hauser: Handling Floating-Point Exceptions in Numeric Programs. 139-174","address":"https://doi.org/10.1145/227699.227701","index":588},"https://doi.org/10.1145/227699.227716":{"title":"David Sands: Total Correctness by Local Improvement in the Transformation of Functional Programs. 175-234","address":"https://doi.org/10.1145/227699.227716","index":589},"https://doi.org/10.1145/229542.229543":{"title":"Stan Y. Liao, Srinivas Devadas, Kurt Keutzer, Steven W. K. Tjiang, Albert R. Wang: Storage Assignment to Decrease Code Size. 235-253","address":"https://doi.org/10.1145/229542.229543","index":590},"https://doi.org/10.1145/229542.229544":{"title":"Geoffrey Smith, Dennis M. Volpano: Polymorphic typing of Variables and References. 254-267","address":"https://doi.org/10.1145/229542.229544","index":591},"https://doi.org/10.1145/229542.229545":{"title":"Jens Knoop, Bernhard Steffen, Jürgen Vollmer: Parallelism for Free: Efficient and Optimal Bitvector Analyses for Parallel Programs. 268-299","address":"https://doi.org/10.1145/229542.229545","index":592},"https://doi.org/10.1145/229542.229546":{"title":"Lal George, Andrew W. Appel: Iterated Register Coalescing. 300-324","address":"https://doi.org/10.1145/229542.229546","index":593},"https://doi.org/10.1145/229542.229547":{"title":"Carroll Morgan, Annabelle McIver, Karen Seidel: Probabilistic Predicate Transformers. 325-353","address":"https://doi.org/10.1145/229542.229547","index":594},"https://doi.org/10.1145/233561.233562":{"title":"Urs Hölzle, David M. Ungar: Reconciling Responsiveness with Performance in Pure Object-Orieted Languages. 355-400","address":"https://doi.org/10.1145/233561.233562","index":595},"https://doi.org/10.1145/233561.233563":{"title":"Martín Abadi, Luca Cardelli: On Subtyping and Matching. 401-423","address":"https://doi.org/10.1145/233561.233563","index":596},"https://doi.org/10.1145/233561.233564":{"title":"Kathryn S. McKinley, Steve Carr, Chau-Wen Tseng: Improving Data Locality with Loop Transformations. 424-453","address":"https://doi.org/10.1145/233561.233564","index":597},"https://doi.org/10.1145/233561.233565":{"title":"Ian T. Foster: Compositional Parallel Programming Languages. 454-476","address":"https://doi.org/10.1145/233561.233565","index":598},"https://doi.org/10.1145/233561.233568":{"title":"Mohammad R. Haghighat, Constantine D. Polychronopoulos: Symbolic Analysis for Parallelizing Compilers. 477-518","address":"https://doi.org/10.1145/233561.233568","index":599},"https://doi.org/10.1145/232706.232715":{"title":"Jens Palsberg, Scott F. Smith: Constrained Types and Their Expressiveness. 519-527","address":"https://doi.org/10.1145/232706.232715","index":600},"https://doi.org/10.1145/232706.232722":{"title":"Steven Dawson, C. R. Ramakrishnan, Steven Skiena, Terrance Swift: Principles and Practice of Unification Factoring. 528-563","address":"https://doi.org/10.1145/232706.232722","index":601},"https://doi.org/10.1145/232706.232734":{"title":"Maria J. García de la Banda, Manuel V. Hermenegildo, Maurice Bruynooghe, Veroniek Dumortier, Gerda Janssens, Wim Simoens: Global Analysis of Constraint Logic Programs. 564-614","address":"https://doi.org/10.1145/232706.232734","index":602},"https://doi.org/10.1145/232706.232711":{"title":"José M. Piquer: Indirect Distributed Garbage Collection: Handling Object Migration. 615-647","address":"https://doi.org/10.1145/232706.232711","index":603},"https://doi.org/10.1145/236114.236115":{"title":"Vugranam C. Sreedhar, Guang R. Gao, Yong-Fong Lee: Identifying Loops Using DJ Graphs. 649-658","address":"https://doi.org/10.1145/236114.236115","index":604},"https://doi.org/10.1145/236114.236116":{"title":"Jonas Skeppstedt, Per Stenström: Using Dataflow Analysis Techniques to Reduce Ownership Overhead in Cache Coherence Protocols. 659-682","address":"https://doi.org/10.1145/236114.236116","index":605},"https://doi.org/10.1145/236114.236117":{"title":"Todd A. Proebsting, Charles N. Fischer: Demand-Driven Register Allocation. 683-710","address":"https://doi.org/10.1145/236114.236117","index":606},"https://doi.org/10.1145/236114.236118":{"title":"Isabelle Attali, Denis Caromel, Sidi O. Ehmety: A Natural Semantics for Eiffel Dynamic Binding. 711-729","address":"https://doi.org/10.1145/236114.236118","index":607},"https://doi.org/10.1145/236114.236119":{"title":"Olivier Danvy, Karoline Malmkjær, Jens Palsberg: Eta-Expansion Does The Trick. 730-751","address":"https://doi.org/10.1145/236114.236119","index":608},"https://doi.org/10.1145/236114.236120":{"title":"Neng-Fa Zhou: Parameter Passing and Control Stack Management in Prolog Implementation Revisited. 752-779","address":"https://doi.org/10.1145/236114.236120","index":609},"https://doi.org/10.1145/200994.200996":{"title":"Jean-Marie Larchevêque: Optimal Incremental Parsing. 1-15","address":"https://doi.org/10.1145/200994.200996","index":610},"https://doi.org/10.1145/200994.200997":{"title":"Yih-Kuen Tsay, Rajive L. Bagrodia: Deducing Fairness Properties in UNITY Logic - A New Completeness Result. 16-27","address":"https://doi.org/10.1145/200994.200997","index":611},"https://doi.org/10.1145/200994.200998":{"title":"Michael Codish, Anne Mulkers, Maurice Bruynooghe, Maria J. García de la Banda, Manuel V. Hermenegildo: Improving Abstract Interpretations by Combining Domains. 28-44","address":"https://doi.org/10.1145/200994.200998","index":612},"https://doi.org/10.1145/200994.200999":{"title":"Joseph P. Skudlarek: Notes on \"A Methodology for Implementing Highly Concurrent Data Objects\". 45-46","address":"https://doi.org/10.1145/200994.200999","index":613},"https://doi.org/10.1145/200994.201001":{"title":"Jens Palsberg: Closure Analysis in Constraint Form. 47-62","address":"https://doi.org/10.1145/200994.201001","index":614},"https://doi.org/10.1145/200994.201002":{"title":"Alexander Aiken, John H. Williams, Edward L. Wimmers: Safe: A Semantic Technique for Transforming Programs in the Presence of Errors. 63-84","address":"https://doi.org/10.1145/200994.201002","index":615},"https://doi.org/10.1145/200994.201003":{"title":"Michael P. Gerlek, Eric Stoltz, Michael Wolfe: Beyond Induction Variables: Detecting and Classifying Sequences Using a Demand-Driven SSA. 85-122","address":"https://doi.org/10.1145/200994.201003","index":616},"https://doi.org/10.1145/200994.201004":{"title":"Siddhartha Chatterjee, John R. Gilbert, Robert Schreiber, Shang-Hua Teng: Optimal Evaluation of Array Expressions on Massively Parallel Machines. 123-156","address":"https://doi.org/10.1145/200994.201004","index":617},"https://doi.org/10.1145/200994.201005":{"title":"Bernadette Charron-Bost, Carole Delporte-Gallet, Hugues Fauconnier: Local and Temporal Predicates In Distributed Systems. 157-179","address":"https://doi.org/10.1145/200994.201005","index":618},"https://doi.org/10.1145/201059.201061":{"title":"Cliff Click, Keith D. Cooper: Combining Analyses, Combining Optimizations. 181-196","address":"https://doi.org/10.1145/201059.201061","index":619},"https://doi.org/10.1145/201059.201062":{"title":"G. A. Venkatesh: Experimental Results from Dynamic Slicing of C Program. 197-216","address":"https://doi.org/10.1145/201059.201062","index":620},"https://doi.org/10.1145/201059.201063":{"title":"Wie-Ngan Chin, Eak-Khoon Goh: A Reexamination of \"Optimization of Array Subscript Range Checks\". 217-227","address":"https://doi.org/10.1145/201059.201063","index":621},"https://doi.org/10.1145/201059.201064":{"title":"Pei-Chi Wu, Feng-Jian Wang: A Worst Case of Circularity Test Algorithms for Attribute Grammars. 228-232","address":"https://doi.org/10.1145/201059.201064","index":622},"https://doi.org/10.1145/201059.201065":{"title":"Anne Rogers, Martin C. Carlisle, John H. Reppy, Laurie J. Hendren: Supporting Dynamic Data Structures on Distributed-Memory Machines. 233-263","address":"https://doi.org/10.1145/201059.201065","index":623},"https://doi.org/10.1145/201059.201066":{"title":"Jens Palsberg, Cun Xiao, Karl J. Lieberherr: Efficient Implementation of Adaptive Software. 264-292","address":"https://doi.org/10.1145/201059.201066","index":624},"https://doi.org/10.1145/201059.201067":{"title":"Adam Brooks Webber: Optimization of Functional Programs by Grammar Thinning. 293-330","address":"https://doi.org/10.1145/201059.201067","index":625},"https://doi.org/10.1145/201059.201068":{"title":"Saumya K. Debray: On the Complexity of Dataflow Analysis of Logic Programs. 331-365","address":"https://doi.org/10.1145/201059.201068","index":626},"https://doi.org/10.1145/201059.201070":{"title":"Michal Walicki, Sigurd Meldal: A Complete Calculus for the Multialgebraic and Functional Semantics of Nondeterminism. 366-393","address":"https://doi.org/10.1145/201059.201070","index":627},"https://doi.org/10.1145/201059.201071":{"title":"Alan Carle, Lori L. Pollock: Matching-Based Incremental Evaluators for Hierarchical Attribute Grammar Dialects. 394-429","address":"https://doi.org/10.1145/201059.201071","index":628},"https://doi.org/10.1145/203095.203096":{"title":"Giuseppe Castagna: Covariance and Contravariance: Conflict without a Cause. 431-447","address":"https://doi.org/10.1145/203095.203096","index":629},"https://doi.org/10.1145/203095.203097":{"title":"W. Homer Carlisle: Type Checking Concurrent I/O. 448-460","address":"https://doi.org/10.1145/203095.203097","index":630},"https://doi.org/10.1145/203095.203098":{"title":"Todd A. Proebsting: BURS Automata Generation. 461-486","address":"https://doi.org/10.1145/203095.203098","index":631},"https://doi.org/10.1145/203095.203099":{"title":"Ron Cytron, Jeanne Ferrante: Efficientlty Computing Phi-Nodes On-The-Fly. 487-506","address":"https://doi.org/10.1145/203095.203099","index":632},"https://doi.org/10.1145/203095.201069":{"title":"Martín Abadi, Leslie Lamport: Conjoining Specifications. 507-534","address":"https://doi.org/10.1145/203095.201069","index":633},"https://doi.org/10.1145/203095.203101":{"title":"Manhoi Choy, Ambuj K. Singh: Efficient Fault-Tolerant Algorithms for Distributed Resource Allocation. 535-559","address":"https://doi.org/10.1145/203095.203101","index":634},"https://doi.org/10.1145/210184.210185":{"title":"Christine Fricker, Olivier Temam, William Jalby: Influence of Cross-Interferences on Blocked Loops: A Case Study with Matric-Vector Multiply. 561-575","address":"https://doi.org/10.1145/210184.210185","index":635},"https://doi.org/10.1145/210184.210187":{"title":"Jens Palsberg, Patrick O'Keefe: A Type System Equivalent to Flow Analysis. 576-599","address":"https://doi.org/10.1145/210184.210187","index":636},"https://doi.org/10.1145/210184.210189":{"title":"Milind Girkar, Constantine D. Polychronopoulos: Extracting Task-Level Parallelism. 600-634","address":"https://doi.org/10.1145/210184.210189","index":637},"https://doi.org/10.1145/210184.210193":{"title":"Bruce J. McKenzie, Corey Yeatman, Lorraine De Vere: Error Repair in Shift-Reduce Parsers. 672-689","address":"https://doi.org/10.1145/210184.210193","index":638},"https://doi.org/10.1145/213978.213980":{"title":"Anthony M. Sloane: An Evaluation of an Automatically Generated Compiler. 691-703","address":"https://doi.org/10.1145/213978.213980","index":639},"https://doi.org/10.1145/213978.213986":{"title":"Henry Cejtin, Suresh Jagannathan, Richard Kelsey: Higher-Order Distributed Objects. 704-739","address":"https://doi.org/10.1145/213978.213986","index":640},"https://doi.org/10.1145/213978.213987":{"title":"Steven M. Kurlander, Todd A. Proebsting, Charles N. Fischer: Efficient Instruction Scheduling for Delayed-Load Architectures. 740-776","address":"https://doi.org/10.1145/213978.213987","index":641},"https://doi.org/10.1145/213978.213989":{"title":"Stephen P. Masticola, Thomas J. Marlowe, Barbara G. Ryder: Lattice Frameworks for Multiscore and Bidirectional Data Flow Problems. 777-803","address":"https://doi.org/10.1145/213978.213989","index":642},"https://doi.org/10.1145/218570.218571":{"title":"Craig Chambers, Gary T. Leavens: Typechecking and Modules for Multimethods. 805-843","address":"https://doi.org/10.1145/218570.218571","index":643},"https://doi.org/10.1145/218570.218572":{"title":"Atsushi Ohori: A Polymorphic Record Calculus and Its Compilation. 844-895","address":"https://doi.org/10.1145/218570.218572","index":644},"https://doi.org/10.1145/218570.218573":{"title":"R. C. Sekar, I. V. Ramakrishnan: Fast Strictness Analysis Based on Demand Propagation. 896-937","address":"https://doi.org/10.1145/218570.218573","index":645},"https://doi.org/10.1145/174625.174626":{"title":"Evan Tick, Mark Korsloot: Determinacy Testing for Nondeterminate Logic Programming Languages. 3-34","address":"https://doi.org/10.1145/174625.174626","index":646},"https://doi.org/10.1145/174625.174627":{"title":"Baudouin Le Charlier, Pascal Van Hentenryck: Experimental Evaluation of a Generic Abstract Interpretation Algorithm for PROLOG. 35-101","address":"https://doi.org/10.1145/174625.174627","index":647},"https://doi.org/10.1145/174625.174628":{"title":"Richard C. Waters: Cliché-Based Program Editors. 102-150","address":"https://doi.org/10.1145/174625.174628","index":648},"https://doi.org/10.1145/174625.174629":{"title":"James M. Purtilo: The POLYLITH Software Bus. 151-174","address":"https://doi.org/10.1145/174625.174629","index":649},"https://doi.org/10.1145/174662.174663":{"title":"Mary Jean Harrold, Mary Lou Soffa: Efficient Computation of Interprocedural Definition-Use Chains. 175-204","address":"https://doi.org/10.1145/174662.174663","index":650},"https://doi.org/10.1145/174662.174664":{"title":"Anne Mulkers, William H. Winsborough, Maurice Bruynooghe: Live-Structure Dataflow Analysis for Prolog. 205-258","address":"https://doi.org/10.1145/174662.174664","index":651},"https://doi.org/10.1145/174662.174665":{"title":"Bengt Jonsson: Compositional Specification and Verification of Distributed Systems. 259-303","address":"https://doi.org/10.1145/174662.174665","index":652},"https://doi.org/10.1145/177492.177494":{"title":"Shlomit S. Pinter, Ron Y. Pinter: Program Optimization and Parallelization Using Idioms. 305-327","address":"https://doi.org/10.1145/177492.177494","index":653},"https://doi.org/10.1145/177492.177497":{"title":"Adrienne G. Bloss: Path Analysis and the Optimization of Nonstrict Functional Programs. 328-369","address":"https://doi.org/10.1145/177492.177497","index":654},"https://doi.org/10.1145/177492.177499":{"title":"Rajiv Gupta, Mary Lou Soffa, Denise Ombres: Efficient Register Allocation via Coloring Using Clique Separators. 370-386","address":"https://doi.org/10.1145/177492.177499","index":655},"https://doi.org/10.1145/177492.177517":{"title":"Max Copperman: Debugging Optimized Code Without Being Misled. 387-427","address":"https://doi.org/10.1145/177492.177517","index":656},"https://doi.org/10.1145/177492.177575":{"title":"Preston Briggs, Keith D. Cooper, Linda Torczon: Improvements to Graph Coloring Register Allocation. 428-455","address":"https://doi.org/10.1145/177492.177575","index":657},"https://doi.org/10.1145/177492.177578":{"title":"Suresh Jagannathan: Metalevel Building Blocks for Modular Systems. 456-492","address":"https://doi.org/10.1145/177492.177578","index":658},"https://doi.org/10.1145/177492.177577":{"title":"Richard Kennaway, Jan Willem Klop, M. Ronan Sleep, Fer-Jan de Vries: On the Adequacy of Graph Rewriting for Simulating Term Rewriting. 493-523","address":"https://doi.org/10.1145/177492.177577","index":659},"https://doi.org/10.1145/177492.177584":{"title":"Lawrence A. Crowl, Thomas J. LeBlanc: Parallel Programming with Control Abstraction. 524-576","address":"https://doi.org/10.1145/177492.177584","index":660},"https://doi.org/10.1145/177492.177612":{"title":"Ian T. Foster, Stephen Taylor: A Compiler Approach to Scalable Concurrent-Program Design. 577-604","address":"https://doi.org/10.1145/177492.177612","index":661},"https://doi.org/10.1145/177492.177605":{"title":"Bijan Arbab, Daniel M. Berry: Some Comments on \"A Denotational Semantics for Prolog\". 605-606","address":"https://doi.org/10.1145/177492.177605","index":662},"https://doi.org/10.1145/177492.177650":{"title":"Kim Marriott, Harald Søndergaard, Neil D. Jones: Denotational Abstract Interpretation of Logic Programs. 607-648","address":"https://doi.org/10.1145/177492.177650","index":663},"https://doi.org/10.1145/177492.177656":{"title":"Michael Codish, Moreno Falaschi, Kim Marriott: Suspension Analyses for Concurrent Logic Programs. 649-686","address":"https://doi.org/10.1145/177492.177656","index":664},"https://doi.org/10.1145/177492.177673":{"title":"Krzysztof R. Apt, Alessandro Pellegrini: On the Occur-Check-Free Prolog Programs. 687-726","address":"https://doi.org/10.1145/177492.177673","index":665},"https://doi.org/10.1145/177492.177697":{"title":"David Garlan, Charles W. Krueger, Barbara Staudt Lerner: TransformGen: Automating the Maintenance of Structure-Oriented Environments. 727-774","address":"https://doi.org/10.1145/177492.177697","index":666},"https://doi.org/10.1145/177492.177705":{"title":"Lin Yu, Daniel J. Rosenkrantz: A Linear-Time Scheme for Version Reconstruction. 775-797","address":"https://doi.org/10.1145/177492.177705","index":667},"https://doi.org/10.1145/177492.177724":{"title":"Josyula R. Rao: Reasoning about Probabilistic Parallel Programs. 798-842","address":"https://doi.org/10.1145/177492.177724","index":668},"https://doi.org/10.1145/177492.177725":{"title":"Orna Grumberg, David E. Long: Model Checking and Modular Verification. 843-871","address":"https://doi.org/10.1145/177492.177725","index":669},"https://doi.org/10.1145/177492.177726":{"title":"Leslie Lamport: The Temporal Logic of Actions. 872-923","address":"https://doi.org/10.1145/177492.177726","index":670},"https://doi.org/10.1145/177492.177727":{"title":"Manfred Broy, Greg Nelson: Adding Fair Choice to Dijkstra's Calculus. 924-938","address":"https://doi.org/10.1145/177492.177727","index":671},"https://doi.org/10.1145/177492.177731":{"title":"Yehuda Afek, Danny Dolev, Eli Gafni, Michael Merritt, Nir Shavit: A Bounded First-In, First-Enabled Solution to the l-Exclusion Problem. 939-953","address":"https://doi.org/10.1145/177492.177731","index":672},"https://doi.org/10.1145/177492.177739":{"title":"Yuh-Jzer Joung, Scott A. Smolka: Coordinating First-Order Multiparty Interactions. 954-985","address":"https://doi.org/10.1145/177492.177739","index":673},"https://doi.org/10.1145/177492.177745":{"title":"Michael K. Reiter, Kenneth P. Birman: How to Securely Replicate Services. 986-1009","address":"https://doi.org/10.1145/177492.177745","index":674},"https://doi.org/10.1145/177492.177750":{"title":"Jan Heering, Paul Klint, J. Rekers: Lazy and Incremental Program Generation. 1010-1023","address":"https://doi.org/10.1145/177492.177750","index":675},"https://doi.org/10.1145/177492.177759":{"title":"Mikkel Thorup: Controlled Grammatic Ambiguity. 1024-1050","address":"https://doi.org/10.1145/177492.177759","index":676},"https://doi.org/10.1145/177492.177768":{"title":"Joseph Bates, Alon Lavie: Recognizing Substrings of LR(k) Languages in Linear Time. 1051-1077","address":"https://doi.org/10.1145/177492.177768","index":677},"https://doi.org/10.1145/183432.183434":{"title":"Annalisa Bossi, Sandro Etalle: Transforming Acyclic Programs. 1081-1096","address":"https://doi.org/10.1145/183432.183434","index":678},"https://doi.org/10.1145/183432.183438":{"title":"Jong-Deok Choi, Jeanne Ferrante: Static Slicing in the Presence of Goto Statements. 1096-1113","address":"https://doi.org/10.1145/183432.183438","index":679},"https://doi.org/10.1145/183432.183440":{"title":"Michael Wolfe: The Definition of Dependence Distance. 1114-1116","address":"https://doi.org/10.1145/183432.183440","index":680},"https://doi.org/10.1145/183432.183443":{"title":"Jens Knoop, Oliver Rüthing, Bernhard Steffen: Optimal Code Motion: Theory and Practice. 1117-1155","address":"https://doi.org/10.1145/183432.183443","index":681},"https://doi.org/10.1145/183432.183446":{"title":"Stefan M. Freudenberger, Thomas R. Gross, P. Geoffrey Lowney: Avoidance and Suppression of Compensation Code in a Trace Scheduling Compiler. 1156-1214","address":"https://doi.org/10.1145/183432.183446","index":682},"https://doi.org/10.1145/183432.183458":{"title":"John Hannan: Operational Semantics-Directed Compilers and Machine Architectures. 1215-1247","address":"https://doi.org/10.1145/183432.183458","index":683},"https://doi.org/10.1145/183432.183525":{"title":"William Pugh, David Wonnacott: Static Analysis of Upper and Lower Bounds on Dependences and Parallelism. 1248-1278","address":"https://doi.org/10.1145/183432.183525","index":684},"https://doi.org/10.1145/183432.183526":{"title":"Hassan Aït-Kaci, Andreas Podelski: Functions as Passive Constraints in LIFE. 1279-1318","address":"https://doi.org/10.1145/183432.183526","index":685},"https://doi.org/10.1145/183432.183527":{"title":"Thomas Ball, James R. Larus: Optimally Profiling and Tracing Programs. 1319-1360","address":"https://doi.org/10.1145/183432.183527","index":686},"https://doi.org/10.1145/183432.183528":{"title":"Antonio Brogi, Paolo Mancarella, Dino Pedreschi, Franco Turini: Modular Logic Programming. 1361-1398","address":"https://doi.org/10.1145/183432.183528","index":687},"https://doi.org/10.1145/186025.186027":{"title":"Thomas Ball: Efficient Counting Program Events with Support for On-Line Queries. 1399-1410","address":"https://doi.org/10.1145/186025.186027","index":688},"https://doi.org/10.1145/186025.186031":{"title":"Konstantin Läufer, Martin Odersky: Polymorphic Type Inference and Abstract Data Types. 1411-1430","address":"https://doi.org/10.1145/186025.186031","index":689},"https://doi.org/10.1145/186025.186037":{"title":"J. Michael Ashley, Charles Consel: Fixpoint Computation for Polyvariant Static Analyses of Higher-Order Applicative Programs. 1431-1448","address":"https://doi.org/10.1145/186025.186037","index":690},"https://doi.org/10.1145/186025.186040":{"title":"Marcel Beemster: Strictness Optimization for Graph Reduction Machines (Why id Might Not Be Strict). 1449-1466","address":"https://doi.org/10.1145/186025.186040","index":691},"https://doi.org/10.1145/186025.186041":{"title":"G. Ramalingam: The Undecidability of Aliasing. 1467-1471","address":"https://doi.org/10.1145/186025.186041","index":692},"https://doi.org/10.1145/186025.186043":{"title":"Uday P. Khedker, Dhananjay M. Dhamdhere: A Generalized Theory of Bit Vector Data Flow Analysis. 1472-1511","address":"https://doi.org/10.1145/186025.186043","index":693},"https://doi.org/10.1145/186025.186051":{"title":"Edmund M. Clarke, Orna Grumberg, David E. Long: Model Checking and Abstraction. 1512-1542","address":"https://doi.org/10.1145/186025.186051","index":694},"https://doi.org/10.1145/186025.186058":{"title":"Martín Abadi, Leslie Lamport: An Old-Fashined Recipe for Real-Time. 1543-1571","address":"https://doi.org/10.1145/186025.186058","index":695},"https://doi.org/10.1145/186025.186091":{"title":"Josephine Micallef, Gail E. Kaiser: Extending Attribute Grammars to Support Programming-in-the-Large. 1572-1612","address":"https://doi.org/10.1145/186025.186091","index":696},"https://doi.org/10.1145/186025.186093":{"title":"Peter T. Breuer, Jonathan P. Bowen: Decompilation: The Enumeration of Types and Grammars. 1613-1647","address":"https://doi.org/10.1145/186025.186093","index":697},"https://doi.org/10.1145/186025.186103":{"title":"David B. Whalley: Automatic Isolation of Compiler Errors. 1648-1659","address":"https://doi.org/10.1145/186025.186103","index":698},"https://doi.org/10.1145/197320.197322":{"title":"John J. Zic: Time-Constrained Buffer Specifications in CSP+T and Timed CSP. 1661-1674","address":"https://doi.org/10.1145/197320.197322","index":699},"https://doi.org/10.1145/197320.197325":{"title":"A. P. Wim Böhm, R. R. Oldehoeft: Two Issues in Parallel Language Design. 1675-1683","address":"https://doi.org/10.1145/197320.197325","index":700},"https://doi.org/10.1145/197320.197331":{"title":"Marc M. Brandis, Hanspeter Mössenböck: Single-Pass Generation of Static Single-Assignment Form for Structured Languages. 1684-1698","address":"https://doi.org/10.1145/197320.197331","index":701},"https://doi.org/10.1145/197320.197336":{"title":"Andrew W. Appel: Axiomatic Bootstrapping: A Guide for Compiler Hackers. 1699-1718","address":"https://doi.org/10.1145/197320.197336","index":702},"https://doi.org/10.1145/197320.197346":{"title":"Nicholas Haines, Darrell Kindred, J. Gregory Morrisett, Scott Nettles, Jeannette M. Wing: Composing First-Class Transactions. 1719-1736","address":"https://doi.org/10.1145/197320.197346","index":703},"https://doi.org/10.1145/197320.197356":{"title":"Jayadev Misra: Powerlist: A Structure for Parallel Recursion. 1737-1767","address":"https://doi.org/10.1145/197320.197356","index":704},"https://doi.org/10.1145/197320.197366":{"title":"Steve Carr, Ken Kennedy: Improving the Ratio of Memory Operations to Floating-Point Operations in Loops. 1768-1810","address":"https://doi.org/10.1145/197320.197366","index":705},"https://doi.org/10.1145/197320.197383":{"title":"Barbara Liskov, Jeannette M. Wing: A Behavioral Notion of Subtyping. 1811-1841","address":"https://doi.org/10.1145/197320.197383","index":706},"https://doi.org/10.1145/197320.197402":{"title":"David G. Von Bank, Charles M. Shub, Robert W. Sebesta: A Unified Model of Pointwise Equivalence of Procedural Computations. 1842-1874","address":"https://doi.org/10.1145/197320.197402","index":707},"https://doi.org/10.1145/197320.197403":{"title":"Valdis Berzins: Software Merge: Semantics of Combining Changes to Programs. 1875-1903","address":"https://doi.org/10.1145/197320.197403","index":708},"https://doi.org/10.1145/151646.151647":{"title":"Gerard Tel, Friedemann Mattern: The Derivation of Distributed Termination Detection Algorithms from Garbage Collection Schemes. 1-35","address":"https://doi.org/10.1145/151646.151647","index":709},"https://doi.org/10.1145/151646.151648":{"title":"Rance Cleaveland, Joachim Parrow, Bernhard Steffen: The Concurrency Workbench: A Semantics-Based Tool for the Verification of Concurrent Systems. 36-72","address":"https://doi.org/10.1145/151646.151648","index":710},"https://doi.org/10.1145/151646.151649":{"title":"Martín Abadi, Leslie Lamport: Composing Specifications. 73-132","address":"https://doi.org/10.1145/151646.151649","index":711},"https://doi.org/10.1145/151646.151650":{"title":"Roberto Barbuti, Roberto Giacobazzi, Giorgio Levi: A General Framework for Semantics-Based Bottom-Up Abstract Interpretation of Logic Programs. 133-181","address":"https://doi.org/10.1145/151646.151650","index":712},"https://doi.org/10.1145/151646.151651":{"title":"Yehuda Afek, Geoffrey M. Brown, Michael Merritt: Lazy Caching. 182-205","address":"https://doi.org/10.1145/151646.151651","index":713},"https://doi.org/10.1145/151646.151652":{"title":"Alan Finlay, Lloyd Allison: A Correction to the Denotational Semantics for the Prolog of Nicholson and Foo. 206-208","address":"https://doi.org/10.1145/151646.151652","index":714},"https://doi.org/10.1145/169701.169696":{"title":"Robert Harper, John C. Mitchell: On the Type Structure of Standard ML. 211-252","address":"https://doi.org/10.1145/169701.169696","index":715},"https://doi.org/10.1145/169701.169692":{"title":"Fritz Henglein: Type Inference with Polymorphic Recursion. 253-289","address":"https://doi.org/10.1145/169701.169692","index":716},"https://doi.org/10.1145/169701.169687":{"title":"A. J. Kfoury, Jerzy Tiuryn, Pawel Urzyczyn: Type Reconstruction in the Presence of Polymorphic Recursion. 290-311","address":"https://doi.org/10.1145/169701.169687","index":717},"https://doi.org/10.1145/169701.169684":{"title":"Dhananjay M. Dhamdhere, Harish Patil: An Elimination Algorithm for Bidirectional Data Flow Problems Using Edge Placement. 312-336","address":"https://doi.org/10.1145/169701.169684","index":718},"https://doi.org/10.1145/169701.169682":{"title":"Shmuel Katz: A Superimposition Control Construct for Distributed Systems. 337-356","address":"https://doi.org/10.1145/169701.169682","index":719},"https://doi.org/10.1145/169701.214526":{"title":"Max Copperman, Charles E. McDowell: A Further Note on Hennessy's \"Symbolic Debugging of Optimized Code\". 357-365","address":"https://doi.org/10.1145/169701.214526","index":720},"https://doi.org/10.1145/169683.169678":{"title":"Michael G. Burke, Linda Torczon: Interprocedural Optimization: Eliminating Unnecessary Recompilation. 367-399","address":"https://doi.org/10.1145/169683.169678","index":721},"https://doi.org/10.1145/169683.174152":{"title":"Siddhartha Chatterjee: Compiling Nested Data-Parallel Programs for Shared-Memory Multiprocessors. 400-462","address":"https://doi.org/10.1145/169683.174152","index":722},"https://doi.org/10.1145/169683.174155":{"title":"Charles Consel, Siau-Cheng Khoo: Parameterized Partial Evaluation. 463-493","address":"https://doi.org/10.1145/169683.174155","index":723},"https://doi.org/10.1145/169683.174157":{"title":"Joel E. Richardson, Michael J. Carey, Daniel T. Schuh: The Design of the E Programming Language. 494-534","address":"https://doi.org/10.1145/169683.174157","index":724},"https://doi.org/10.1145/169683.174159":{"title":"Martin Odersky: Defining Context-Dependent Syntax Without Using Contexts. 535-562","address":"https://doi.org/10.1145/169683.174159","index":725},"https://doi.org/10.1145/169683.174161":{"title":"Shing-Tsaan Huang: Leader Election in Uniform Rings. 563-573","address":"https://doi.org/10.1145/169683.174161","index":726},"https://doi.org/10.1145/155183.155231":{"title":"Roberto M. Amadio, Luca Cardelli: Subtyping Recursive Types. 575-631","address":"https://doi.org/10.1145/155183.155231","index":727},"https://doi.org/10.1145/155183.155190":{"title":"Krishna V. Palem, Barbara B. Simons: Scheduling Time-Critical Instructions on RISC Machines. 632-658","address":"https://doi.org/10.1145/155183.155190","index":728},"https://doi.org/10.1145/155183.155220":{"title":"Gopal Gupta, Bharat Jayaraman: Analysis of Or-Parallel Execution Models. 659-680","address":"https://doi.org/10.1145/155183.155220","index":729},"https://doi.org/10.1145/155183.155221":{"title":"Colin J. Fidge: A Formal Definition of Priority in CSP. 681-705","address":"https://doi.org/10.1145/155183.155221","index":730},"https://doi.org/10.1145/155183.155225":{"title":"Martín Abadi, Michael Burrows, Butler W. Lampson, Gordon D. Plotkin: A Calculus for Access Control in Distributed Systems. 706-734","address":"https://doi.org/10.1145/155183.155225","index":731},"https://doi.org/10.1145/155183.155228":{"title":"Sukumar Ghosh: An Alternative Solution to a Problem on Self-Stabilization. 735-742","address":"https://doi.org/10.1145/155183.155228","index":732},"https://doi.org/10.1145/161468.161469":{"title":"Maurice Herlihy: A Methodology for Implementing Highly Concurrent Objects. 745-770","address":"https://doi.org/10.1145/161468.161469","index":733},"https://doi.org/10.1145/161468.161470":{"title":"Jonathan I. Leivent, Ronald J. Watro: Mathematical Foundations of Time Warp Systems. 771-794","address":"https://doi.org/10.1145/161468.161470","index":734},"https://doi.org/10.1145/161468.161471":{"title":"Mic Bowman, Saumya K. Debray, Larry L. Peterson: Reasoning About Naming Systems. 795-825","address":"https://doi.org/10.1145/161468.161471","index":735},"https://doi.org/10.1145/161468.161472":{"title":"Saumya K. Debray, Nai-Wei Lin: Cost Analysis of Logic Programs. 826-875","address":"https://doi.org/10.1145/161468.161472","index":736},"https://doi.org/10.1145/161468.161473":{"title":"Huimin Lin: Procedural Implementation of Algebraic Specification. 876-895","address":"https://doi.org/10.1145/161468.161473","index":737},"https://doi.org/10.1145/111186.116734":{"title":"David M. Ungar, Frank Jackson: An Adaptive Tenuring Policy for Generation Scavengers. 1-27","address":"https://doi.org/10.1145/111186.116734","index":738},"https://doi.org/10.1145/111186.116785":{"title":"Jon A. Solworth: Epochs. 28-53","address":"https://doi.org/10.1145/111186.116785","index":739},"https://doi.org/10.1145/111186.126699":{"title":"Timothy J. Hickey, Jacques Cohen, Hitofumi Hotta, Thierry PetitJean: Computer-Assisted Microanalysis of Parallel Programs. 54-106","address":"https://doi.org/10.1145/111186.126699","index":740},"https://doi.org/10.1145/111186.104659":{"title":"David A. Gudeman: Denotational Semantics of a Goal-Directed Language. 107-125","address":"https://doi.org/10.1145/111186.104659","index":741},"https://doi.org/10.1145/128861.128862":{"title":"Raymond T. Boute: The Euclidian Definition of the Functions div and mod. 127-144","address":"https://doi.org/10.1145/128861.128862","index":742},"https://doi.org/10.1145/128861.128864":{"title":"Carsten K. Gomard: A Self-Applicable Partial Evaluator for the Lambda Calculus: Correctness and Pragmatics. 147-172","address":"https://doi.org/10.1145/128861.128864","index":743},"https://doi.org/10.1145/128861.128865":{"title":"Lori L. Pollock, Mary Lou Soffa: Incremental Global Reoptimization of Programs. 173-200","address":"https://doi.org/10.1145/128861.128865","index":744},"https://doi.org/10.1145/128861.128866":{"title":"Gail E. Kaiser, Brent Hailpern: An Object-Based Programming Model for Shared Data. 201-264","address":"https://doi.org/10.1145/128861.128866","index":745},"https://doi.org/10.1145/128861.128867":{"title":"Philip J. Koopman Jr., Peter Lee, Daniel P. Siewiorek: Cache Behavior of Combinator Graph Reduction. 265-297","address":"https://doi.org/10.1145/128861.128867","index":746},"https://doi.org/10.1145/129393.129395":{"title":"David W. Wall: Experience with a Software-Defined Machine Architecture. 299-338","address":"https://doi.org/10.1145/129393.129395","index":747},"https://doi.org/10.1145/129393.129396":{"title":"Jennifer Widom, David Gries, Fred B. Schneider: Trace-Based Network Proof Systems: Expressiveness and Completeness. 396-416","address":"https://doi.org/10.1145/129393.129396","index":748},"https://doi.org/10.1145/129393.129394":{"title":"A. Udaya Shankar, Simon S. Lam: A Stepwise Refinement Heuristic for Protocol Construction. 417-461","address":"https://doi.org/10.1145/129393.129394","index":749},"https://doi.org/10.1145/133233.133234":{"title":"Wilfred J. Hansen: Subsequence References: First-Class Values for Substrings. 471-489","address":"https://doi.org/10.1145/133233.133234","index":750},"https://doi.org/10.1145/133233.133240":{"title":"Jan Heering, Paul Klint, J. Rekers: Incremental Generation of Lexical Scanners. 490-520","address":"https://doi.org/10.1145/133233.133240","index":751},"https://doi.org/10.1145/133233.129397":{"title":"Angelo Morzenti, Dino Mandrioli, Carlo Ghezzi: A Model Parametric Real-Time Logic. 521-573","address":"https://doi.org/10.1145/133233.129397","index":752},"https://doi.org/10.1145/133233.133247":{"title":"Jacob Katzenelson, Shlomit S. Pinter, Eugen Schenfeld: Type Matching, Type-Graphs, and the Schanuel Conjecture. 574-588","address":"https://doi.org/10.1145/133233.133247","index":753},"https://doi.org/10.1145/133233.133254":{"title":"Robert Muller: M-Lisp: A Representation-Independent Dialect of Lisp with Reduction Semantics. 589-615","address":"https://doi.org/10.1145/133233.133254","index":754},"https://doi.org/10.1145/114005.102804":{"title":"Russell W. Quong, Mark A. Linton: Linking Programs Incrementally. 1-20","address":"https://doi.org/10.1145/114005.102804","index":755},"https://doi.org/10.1145/114005.102805":{"title":"Pascal Fradet, Daniel Le Métayer: Compilation of Functional Languages by Program Transformation. 21-51","address":"https://doi.org/10.1145/114005.102805","index":756},"https://doi.org/10.1145/114005.102806":{"title":"Richard C. Waters: Automatic Transformation of Series Expressions into Loops. 52-98","address":"https://doi.org/10.1145/114005.102806","index":757},"https://doi.org/10.1145/114005.102807":{"title":"Antonio Brogi, Paolo Ciancarini: The Concurrent Language, Shared Prolog. 99-123","address":"https://doi.org/10.1145/114005.102807","index":758},"https://doi.org/10.1145/114005.102808":{"title":"Maurice Herlihy: Wait-Free Synchronization. 124-149","address":"https://doi.org/10.1145/114005.102808","index":759},"https://doi.org/10.1145/103135.103136":{"title":"Mark N. Wegman, F. Kenneth Zadeck: Constant Propagation with Conditional Branches. 181-210","address":"https://doi.org/10.1145/103135.103136","index":760},"https://doi.org/10.1145/103135.103137":{"title":"Daniel M. Yellin, Robert E. Strom: INC: A Language for Incremental Computations. 211-236","address":"https://doi.org/10.1145/103135.103137","index":761},"https://doi.org/10.1145/103135.103138":{"title":"Martín Abadi, Luca Cardelli, Benjamin C. Pierce, Gordon D. Plotkin: Dynamic Typing in a Statically Typed Language. 237-268","address":"https://doi.org/10.1145/103135.103138","index":762},"https://doi.org/10.1145/103135.103139":{"title":"Paul Hudak, Jonathan Young: Collecting Interpretations of Expressions. 269-290","address":"https://doi.org/10.1145/103135.103139","index":763},"https://doi.org/10.1145/103135.214520":{"title":"Dhananjay M. Dhamdhere: Practical Adaptation of the Global Optimization Algorithm of Morel and Renvoise. 291-294","address":"https://doi.org/10.1145/103135.214520","index":764},"https://doi.org/10.1145/117009.117013":{"title":"Jürgen Börstler, Ulrich Möncke, Reinhard Wilhelm: Table Compression for Tree Automata. 295-314","address":"https://doi.org/10.1145/117009.117013","index":765},"https://doi.org/10.1145/117009.117012":{"title":"Scott E. Hudson: Incremental Attribute Evaluation: A Flexible Algorithm for Lazy Update. 315-341","address":"https://doi.org/10.1145/117009.117012","index":766},"https://doi.org/10.1145/117009.117017":{"title":"Ronald Morrison, Alan Dearle, Richard C. H. Connor, Alfred L. Brown: An Ad Hoc Approach to the Implementation of Polymorphism. 342-371","address":"https://doi.org/10.1145/117009.117017","index":767},"https://doi.org/10.1145/117009.117016":{"title":"Thomas P. Murtagh: An Improved Storage Management Scheme for Block Structured Languages. 372-398","address":"https://doi.org/10.1145/117009.117016","index":768},"https://doi.org/10.1145/117009.117015":{"title":"Wuxu Peng, S. Purushothaman: Data Flow Analysis of Communicating Finite State Machines. 399-442","address":"https://doi.org/10.1145/117009.117015","index":769},"https://doi.org/10.1145/115372.115320":{"title":"Ron Cytron, Jeanne Ferrante, Barry K. Rosen, Mark N. Wegman, F. Kenneth Zadeck: Efficiently Computing Static Single Assignment Form and the Control Dependence Graph. 451-490","address":"https://doi.org/10.1145/115372.115320","index":770},"https://doi.org/10.1145/115372.115324":{"title":"Jong-Deok Choi, Barton P. Miller, Robert H. B. Netzer: Techniques for Debugging Parallel Programs with Flowback Analysis. 491-530","address":"https://doi.org/10.1145/115372.115324","index":771},"https://doi.org/10.1145/115372.115369":{"title":"Tim Sheard: Automatic Generation and Use of Abstract Structure Operators. 531-557","address":"https://doi.org/10.1145/115372.115369","index":772},"https://doi.org/10.1145/115372.115370":{"title":"Edward A. Lycklama, Vassos Hadzilacos: A First-Come-First-Served Mutual-Exclusion Algorithm with Small Communication Variables. 558-576","address":"https://doi.org/10.1145/115372.115370","index":773},"https://doi.org/10.1145/115372.115371":{"title":"Radha Jagadeesan, Keshav Pingali, Prakash Panangaden: A Fully Abstract Semantics for a First-Order Functional Language with Logic Variables. 577-625","address":"https://doi.org/10.1145/115372.115371","index":774},"https://doi.org/10.1145/115372.115297":{"title":"Norman H. Cohen: Type-Extension Type Tests Can Be Performed In Constant Time. 626-629","address":"https://doi.org/10.1145/115372.115297","index":775},"https://doi.org/10.1145/115372.214521":{"title":"Niklaus Wirth: Reply to \"Type-Extension Tests Can Be Performed In Constant Time\". 630","address":"https://doi.org/10.1145/115372.214521","index":776},"https://doi.org/10.1145/115372.214523":{"title":"Dennis M. Volpano: Subtypes and Quantification. 631-632","address":"https://doi.org/10.1145/115372.214523","index":777},"https://doi.org/10.1145/77606.77607":{"title":"Geoffrey Clemm, Leon J. Osterweil: A Mechanism for Environment Integration. 1-25","address":"https://doi.org/10.1145/77606.77607","index":778},"https://doi.org/10.1145/77606.77608":{"title":"Susan Horwitz, Thomas W. Reps, David W. Binkley: Interprocedural Slicing Using Dependence Graphs. 26-60","address":"https://doi.org/10.1145/77606.77608","index":779},"https://doi.org/10.1145/77606.77609":{"title":"Vance E. Waddle: Production Trees: A Compact Representation of Parsed Programs. 61-83","address":"https://doi.org/10.1145/77606.77609","index":780},"https://doi.org/10.1145/77606.77610":{"title":"Ephraim Korach, Shay Kutten, Shlomo Moran: A Modular Technique for the Design of Efficient Distributed Leader Finding Algorithms. 84-101","address":"https://doi.org/10.1145/77606.77610","index":781},"https://doi.org/10.1145/77606.77611":{"title":"Shing-Tsaan Huang: A Distributed Deadlock Detection Algorithm for CSP-Like Communication. 102-122","address":"https://doi.org/10.1145/77606.77611","index":782},"https://doi.org/10.1145/77606.77612":{"title":"William M. Farmer, John D. Ramsdell, Ronald J. Watro: A Correctness Proof for Combinator Reduction with Cycles. 123-134","address":"https://doi.org/10.1145/77606.77612","index":783},"https://doi.org/10.1145/77606.214515":{"title":"F. Warren Burton: Type Extension Through Polymorphism. 135-138","address":"https://doi.org/10.1145/77606.214515","index":784},"https://doi.org/10.1145/77606.214517":{"title":"David Lorge Parnas: On Iterative Constructs. 139-141","address":"https://doi.org/10.1145/77606.214517","index":785},"https://doi.org/10.1145/78942.78943":{"title":"Brad A. Myers: Creating User Interfaces Using Programming by Example, Visual Programming, and Constraints. 143-177","address":"https://doi.org/10.1145/78942.78943","index":786},"https://doi.org/10.1145/78942.78944":{"title":"William E. Weihl: Linguistic Support for Atomic Data Types. 178-202","address":"https://doi.org/10.1145/78942.78944","index":787},"https://doi.org/10.1145/78942.78945":{"title":"Edgar Knapp: An Exercise in the Formal Derivation of Parallel Programs: Maximum Flows in Graphs. 203-223","address":"https://doi.org/10.1145/78942.78945","index":788},"https://doi.org/10.1145/78942.78946":{"title":"Jared L. Darlington: Search Direction by Goal Failure in Goal-Directed Programming. 224-252","address":"https://doi.org/10.1145/78942.78946","index":789},"https://doi.org/10.1145/78942.78947":{"title":"Annalisa Bossi, Nicoletta Cocco, Susi Dulli: A Method for Specializing Logic Programs. 253-302","address":"https://doi.org/10.1145/78942.78947","index":790},"https://doi.org/10.1145/78942.78948":{"title":"Sudhir Aggarwal, Costas Courcoubetis, Pierre Wolper: Adding Liveness Properties to Coupled Finite-State Machines. 303-339","address":"https://doi.org/10.1145/78942.78948","index":791},"https://doi.org/10.1145/78969.78963":{"title":"Michael G. Burke: An Interval-Based Approach to Exhaustive and Incremental Interprocedural Data-Flow Analysis. 341-395","address":"https://doi.org/10.1145/78969.78963","index":792},"https://doi.org/10.1145/78969.78971":{"title":"Larry G. Jones: Efficient Evaluation of Circular Attribute Grammars. 429-462","address":"https://doi.org/10.1145/78969.78971","index":793},"https://doi.org/10.1145/78969.78972":{"title":"Maurice Herlihy, Jeannette M. Wing: Linearizability: A Correctness Condition for Concurrent Objects. 463-492","address":"https://doi.org/10.1145/78969.78972","index":794},"https://doi.org/10.1145/88616.88621":{"title":"Fred C. Chow, John L. Hennessy: The Priority-Based Coloring Approach to Register Allocation. 501-536","address":"https://doi.org/10.1145/88616.88621","index":795},"https://doi.org/10.1145/88616.88631":{"title":"James W. Stamos, David K. Gifford: Remote Evaluation. 537-565","address":"https://doi.org/10.1145/88616.88631","index":796},"https://doi.org/10.1145/88616.214518":{"title":"Prasun Dewan, Marvin H. Solomon: An Approach to Support Automatic Generation of User Interfaces. 566-609","address":"https://doi.org/10.1145/88616.214518","index":797},"https://doi.org/10.1145/88616.88637":{"title":"Hans Leiß: On Kilbury's Modification of Earley's Algorithm. 610-640","address":"https://doi.org/10.1145/88616.88637","index":798},"https://doi.org/10.1145/88616.96551":{"title":"Laura K. Dillon: Using Symbolic Execution for Verification of Ada Tasking Programs. 643-669","address":"https://doi.org/10.1145/88616.96551","index":799},"https://doi.org/10.1145/88616.88639":{"title":"Jack C. Wileden, Lori A. Clarke, Alexander L. Wolf: A Comparative Evaluation of Object Definition Techniques. 670-699","address":"https://doi.org/10.1145/88616.88639","index":800},"https://doi.org/10.1145/59287.59289":{"title":"Peter Steenkiste, John L. Hennessy: A Simple Interprocedural Register Allocation Algorithm and Its Effectiveness for Lisp. 1-32","address":"https://doi.org/10.1145/59287.59289","index":801},"https://doi.org/10.1145/59287.59290":{"title":"Eugene W. Myers, Webb Miller: Row Replacement Algorithms for Screen Editors. 33-56","address":"https://doi.org/10.1145/59287.59290","index":802},"https://doi.org/10.1145/59287.59291":{"title":"David Bernstein, Izidor Gertner: Scheduling Expressions on a Pipelined Processor with a Maximal Delay of One Cycle. 57-66","address":"https://doi.org/10.1145/59287.59291","index":803},"https://doi.org/10.1145/59287.77345":{"title":"Jørgen Steensgaard-Madsen: Type Representation of Objects by Functions. 67-89","address":"https://doi.org/10.1145/59287.77345","index":804},"https://doi.org/10.1145/59287.59292":{"title":"Michael J. Fischer, Nancy A. Lynch, James E. Burns, Allan Borodin: Distributed FIFO Allocation of Identical Resources Using Small Shared Space. 90-114","address":"https://doi.org/10.1145/59287.59292","index":805},"https://doi.org/10.1145/59287.59293":{"title":"Hassan Aït-Kaci, Robert S. Boyer, Patrick Lincoln, Roger Nasr: Efficient Implementation of Lattice Operations. 115-146","address":"https://doi.org/10.1145/59287.59293","index":806},"https://doi.org/10.1145/59287.62028":{"title":"Bowen Alpern, Fred B. Schneider: Verifying Temporal Properties without Temporal Logic. 147-167","address":"https://doi.org/10.1145/59287.62028","index":807},"https://doi.org/10.1145/63264.63400":{"title":"Gail E. Kaiser: Incremental Dynamic Semantics for Language-Based Programming Environments. 169-193","address":"https://doi.org/10.1145/63264.63400","index":808},"https://doi.org/10.1145/63264.63401":{"title":"Robert D. Cameron: Efficient High-Level Iteration with Accumulators. 194-211","address":"https://doi.org/10.1145/63264.63401","index":809},"https://doi.org/10.1145/63264.63265":{"title":"Wilf R. LaLonde: Designing Families of Data Types Using Exemplars. 212-248","address":"https://doi.org/10.1145/63264.63265","index":810},"https://doi.org/10.1145/63264.63518":{"title":"William E. Weihl: Local Atomicity Properties: Modular Concurrency Control for Abstract Data Types. 249-283","address":"https://doi.org/10.1145/63264.63518","index":811},"https://doi.org/10.1145/63264.63402":{"title":"Vincenza Carchiolo, Antonella Di Stefano, Alberto Faro, Giuseppe Pappalardo: ECCS and LIPS: Two Languages for OSI Systems Specification and Verification. 284-329","address":"https://doi.org/10.1145/63264.63402","index":812},"https://doi.org/10.1145/63264.63403":{"title":"James E. Burns, Jan K. Pachl: Uniform Self-Stabilizing Rings. 330-344","address":"https://doi.org/10.1145/63264.63403","index":813},"https://doi.org/10.1145/65979.65980":{"title":"Susan Horwitz, Jan F. Prins, Thomas W. Reps: Integrating Noninterfering Versions of Programs. 345-387","address":"https://doi.org/10.1145/65979.65980","index":814},"https://doi.org/10.1145/65979.65981":{"title":"Richard P. Brent: Efficient Implementation of the First-Fit Strategy for Dynamic Storage Allocation. 388-403","address":"https://doi.org/10.1145/65979.65981","index":815},"https://doi.org/10.1145/65979.65982":{"title":"Frank D. Anger: On Lamport's Interprocessor Communication Model. 404-417","address":"https://doi.org/10.1145/65979.65982","index":816},"https://doi.org/10.1145/65979.65983":{"title":"Saumya K. Debray: Static Inference of Modes and Data Dependencies in Logic Programs. 418-450","address":"https://doi.org/10.1145/65979.65983","index":817},"https://doi.org/10.1145/65979.65984":{"title":"Saumya K. Debray, David Scott Warren: Functional Computations in Logic Programs. 451-481","address":"https://doi.org/10.1145/65979.65984","index":818},"https://doi.org/10.1145/69558.75700":{"title":"Alfred V. Aho, Mahadevan Ganapathi, Steven W. K. Tjiang: Code Generation Using Tree Matching and Dynamic Programming. 491-516","address":"https://doi.org/10.1145/69558.75700","index":819},"https://doi.org/10.1145/69558.69559":{"title":"Greg Nelson: A Generalization of Dijkstra's Calculus. 517-561","address":"https://doi.org/10.1145/69558.69559","index":820},"https://doi.org/10.1145/69558.69560":{"title":"Valmir Carneiro Barbosa, Eli Gafni: Concurrency in Heavily Loaded Neighborhood-Constrained Systems. 562-584","address":"https://doi.org/10.1145/69558.69560","index":821},"https://doi.org/10.1145/69558.69561":{"title":"Rajive L. Bagrodia: Synchronization of Asynchronous Processes in CSP. 585-597","address":"https://doi.org/10.1145/69558.69561","index":822},"https://doi.org/10.1145/69558.69562":{"title":"Arvind, Rishiyur S. Nikhil, Keshav Pingali: I-Structures: Data Structures for Parallel Computing. 598-632","address":"https://doi.org/10.1145/69558.69562","index":823},"https://doi.org/10.1145/69558.69563":{"title":"Ben A. Sijtsma: On the Productivity of Recursive List Definitions. 633-649","address":"https://doi.org/10.1145/69558.69563","index":824},"https://doi.org/10.1145/69558.69564":{"title":"Tim Nicholson, Norman Y. Foo: A Denotational Semantics for Prolog. 650-665","address":"https://doi.org/10.1145/69558.69564","index":825},"https://doi.org/10.1145/69558.214513":{"title":"Arthur Sorkin: Some Comments on ''A Solution to a Problem with Morel and Renvoise's 'Global Optimization by Suppression of Partial Redundancies'. 666-668","address":"https://doi.org/10.1145/69558.214513","index":826},"https://doi.org/10.1145/42192.42193":{"title":"Barbara G. Ryder, Marvin C. Paull: Incremental Data-Flow Analysis. 1-50","address":"https://doi.org/10.1145/42192.42193","index":827},"https://doi.org/10.1145/42192.42324":{"title":"Gregory R. Andrews, Ronald A. Olsson, Michael H. Coffin, Irving Elshoff, Kelvin D. Nilsen, Titus D. M. Purdin, Gregg M. Townsend: An Overview of the SR Language and Implementation. 51-86","address":"https://doi.org/10.1145/42192.42324","index":828},"https://doi.org/10.1145/42192.42194":{"title":"Wim H. Hesselink: A Mathematical Approach to Nondeterminism in Data Types. 87-117","address":"https://doi.org/10.1145/42192.42194","index":829},"https://doi.org/10.1145/42192.45067":{"title":"Raymond T. Boute: System Semantics: Principles, Applications, and Implementation. 118-155","address":"https://doi.org/10.1145/42192.45067","index":830},"https://doi.org/10.1145/42192.42195":{"title":"Joylyn Reed, Raymond T. Yeh: Specification and Verification of Liveness Properties of Cyclic, Concurrent Processes. 156-177","address":"https://doi.org/10.1145/42192.42195","index":831},"https://doi.org/10.1145/42190.42346":{"title":"Paul N. Hilfinger: An Ada Package for Dimensional Analysis. 189-203","address":"https://doi.org/10.1145/42190.42346","index":832},"https://doi.org/10.1145/42190.46167":{"title":"Niklaus Wirth: Type Extensions. 204-214","address":"https://doi.org/10.1145/42190.46167","index":833},"https://doi.org/10.1145/42190.42191":{"title":"Jan van den Bos: Abstract Interaction Tools: A Language for User Interface Management Systems. 215-247","address":"https://doi.org/10.1145/42190.42191","index":834},"https://doi.org/10.1145/42190.42347":{"title":"Daniel Le Métayer: ACE: An Automatic Complexity Evaluator. 248-266","address":"https://doi.org/10.1145/42190.42347","index":835},"https://doi.org/10.1145/42190.42348":{"title":"Leslie Lamport: Control Predicates are Better than Dummy Variables for Reasoning about Program Control. 267-281","address":"https://doi.org/10.1145/42190.42348","index":836},"https://doi.org/10.1145/42190.42277":{"title":"Dennis E. Shasha, Marc Snir: Efficient and Correct Execution of Parallel Programs that Share Memory. 282-312","address":"https://doi.org/10.1145/42190.42277","index":837},"https://doi.org/10.1145/42190.42278":{"title":"Albert G. Greenberg, Boris D. Lubachevsky, Andrew M. Odlyzko: Simple, Efficient Asynchronous Parallel Algorithms for Maximization. 313-337","address":"https://doi.org/10.1145/42190.42278","index":838},"https://doi.org/10.1145/42190.42276":{"title":"Manuel E. Bermudez, Karl M. Schimpf: On the (non-) Relationship between SLR(1) and NQLALR(1) Grammars. 338-342","address":"https://doi.org/10.1145/42190.42276","index":839},"https://doi.org/10.1145/44501.214503":{"title":"Pierpaolo Degano, Stefano Mannucci, Bruno Mojana: Efficient Incremental LR Parsing for Syntax-Directed Editors. 345-373","address":"https://doi.org/10.1145/44501.214503","index":840},"https://doi.org/10.1145/44501.44502":{"title":"Laura K. Dillon, George S. Avrunin, Jack C. Wileden: Constrained Expressions: Toward Broad Applicability of Analysis Methods for Distributed Software Systems. 374-402","address":"https://doi.org/10.1145/44501.44502","index":841},"https://doi.org/10.1145/44501.44503":{"title":"Carroll Morgan: The Specification Statement. 403-419","address":"https://doi.org/10.1145/44501.44503","index":842},"https://doi.org/10.1145/44501.44504":{"title":"Ernst-Rüdiger Olderog, Krzysztof R. Apt: Fairness in Parallel Programs: The Transformational Approach. 420-455","address":"https://doi.org/10.1145/44501.44504","index":843},"https://doi.org/10.1145/44501.44505":{"title":"Jon Mauney, Charles N. Fischer: Determining the Extent of Lookahead in Syntactic Error Repair. 456-469","address":"https://doi.org/10.1145/44501.44505","index":844},"https://doi.org/10.1145/44501.45065":{"title":"John C. Mitchell, Gordon D. Plotkin: Abstract Types Have Existential Type. 470-502","address":"https://doi.org/10.1145/44501.45065","index":845},"https://doi.org/10.1145/48022.48023":{"title":"Ralph-Johan Back, Reino Kurki-Suonio: Distributed Cooperation with Action Systems. 513-554","address":"https://doi.org/10.1145/48022.48023","index":846},"https://doi.org/10.1145/48022.48025":{"title":"Katsuro Inoue, Hiroyuki Seki, Hikaru Yagi: Analysis of Functional Programs to Detect Run-Time Garbage Cells. 555-578","address":"https://doi.org/10.1145/48022.48025","index":847},"https://doi.org/10.1145/48022.48024":{"title":"Clyde P. Kruskal, Larry Rudolph, Marc Snir: Efficient Synchronization on Multiprocessors with Shared Memory. 579-601","address":"https://doi.org/10.1145/48022.48024","index":848},"https://doi.org/10.1145/48022.48026":{"title":"Richard Kennaway, M. Ronan Sleep: Director Strings as Combinators. 602-626","address":"https://doi.org/10.1145/48022.48026","index":849},"https://doi.org/10.1145/48022.214505":{"title":"Robert W. Schwanke, Gail E. Kaiser: Smarter Recompilation. 627-632","address":"https://doi.org/10.1145/48022.214505","index":850},"https://doi.org/10.1145/48022.214507":{"title":"Walter F. Tichy: Tichy's Response to R. W. Schwanke and G. E. Kaiser's \"Smarter Recompilation\". 633-634","address":"https://doi.org/10.1145/48022.214507","index":851},"https://doi.org/10.1145/48022.214509":{"title":"Karl-Heinz Drechsler, Manfred P. Stadel: A Solution to a Problem with Morel and Renvoise's \"Global Optimization by Suppression of Partial Redundancies\". 635-640","address":"https://doi.org/10.1145/48022.214509","index":852},"https://doi.org/10.1145/9758.10500":{"title":"Jeannette M. Wing: Writing Larch Interface Language Specifications. 1-24","address":"https://doi.org/10.1145/9758.10500","index":853},"https://doi.org/10.1145/9758.9759":{"title":"Scott D. Carson, Paul F. Reynolds Jr.: The Geometry of Semaphore Programs. 25-53","address":"https://doi.org/10.1145/9758.9759","index":854},"https://doi.org/10.1145/9758.10501":{"title":"Manfred Broy, Martin Wirsing, Peter Pepper: On the Algebraic Definition of Programming Languages. 54-99","address":"https://doi.org/10.1145/9758.10501","index":855},"https://doi.org/10.1145/9758.11326":{"title":"Stefan Sokolowski: Soundness of Hoare's Logic: An Automated Proof Using LCF. 100-120","address":"https://doi.org/10.1145/9758.11326","index":856},"https://doi.org/10.1145/22719.22946":{"title":"Jacques Cohen, Timothy J. Hickey: Parsing and Compiling Using Prolog. 125-163","address":"https://doi.org/10.1145/22719.22946","index":857},"https://doi.org/10.1145/22719.22720":{"title":"Michael G. Burke, Gerald A. Fisher: A Practical Method for LR and LL Syntactic Error Diagnosis. 164-197","address":"https://doi.org/10.1145/22719.22720","index":858},"https://doi.org/10.1145/22719.22947":{"title":"Martin S. Feather: Language Support for the Specification and Development of Composite Systems. 198-234","address":"https://doi.org/10.1145/22719.22947","index":859},"https://doi.org/10.1145/22719.24067":{"title":"Raphael A. Finkel, Udi Manber: DIB - A Distributed Implementation of Backtracking. 235-256","address":"https://doi.org/10.1145/22719.24067","index":860},"https://doi.org/10.1145/22719.23717":{"title":"Robert A. Mueller, Joseph Varghese: Retargetable Microcode Synthesis. 257-276","address":"https://doi.org/10.1145/22719.23717","index":861},"https://doi.org/10.1145/22719.22948":{"title":"Christopher W. Fraser, Eugene W. Myers: An Editor for Revision Control. 277-295","address":"https://doi.org/10.1145/22719.22948","index":862},"https://doi.org/10.1145/24039.24040":{"title":"David Alex Lamb: IDL: Sharing Intermediate Representations. 297-318","address":"https://doi.org/10.1145/24039.24040","index":863},"https://doi.org/10.1145/24039.24041":{"title":"Jeanne Ferrante, Karl J. Ottenstein, Joe D. Warren: The Program Dependence Graph and Its Use in Optimization. 319-349","address":"https://doi.org/10.1145/24039.24041","index":864},"https://doi.org/10.1145/24039.24050":{"title":"Arthur Charlesworth: The Multiway Rendezvous. 350-366","address":"https://doi.org/10.1145/24039.24050","index":865},"https://doi.org/10.1145/24039.24051":{"title":"Richard C. Holt: Data Descriptors: A Compile-Time Model of Data and Addressing. 367-389","address":"https://doi.org/10.1145/24039.24051","index":866},"https://doi.org/10.1145/24039.24052":{"title":"Shaula Yemini, Daniel M. Berry: An Axiomatic Treatment of Exception Handling in an Expression-Oriented Language. 390-407","address":"https://doi.org/10.1145/24039.24052","index":867},"https://doi.org/10.1145/24039.214529":{"title":"Thomas W. Reps, Alan J. Demers: Sublinear-Space Evaluation Algorithms for Attribute Grammars. 408-440","address":"https://doi.org/10.1145/24039.214529","index":868},"https://doi.org/10.1145/24039.24071":{"title":"Debasish Banerjee: A Methodology for Synthesis of Recursive Functional Programs. 441-462","address":"https://doi.org/10.1145/24039.24071","index":869},"https://doi.org/10.1145/29873.29874":{"title":"Michael Sonnenschein: Graph Translation Schemes to Generate Compiler Parts. 473-490","address":"https://doi.org/10.1145/29873.29874","index":870},"https://doi.org/10.1145/29873.29875":{"title":"Randy Allen, Ken Kennedy: Automatic Translation of Fortran Programs to Vector Form. 491-542","address":"https://doi.org/10.1145/29873.29875","index":871},"https://doi.org/10.1145/29873.29876":{"title":"Daniel J. Rosenkrantz, Harry B. Hunt III: Efficient Algorithms for Automatic Construction and Compactification of Parsing Grammars. 543-566","address":"https://doi.org/10.1145/29873.29876","index":872},"https://doi.org/10.1145/29873.30391":{"title":"Ed Anson: A Generalized Iterative Construct and Its Semantics. 567-581","address":"https://doi.org/10.1145/29873.30391","index":873},"https://doi.org/10.1145/29873.30392":{"title":"Christopher T. Haynes, Daniel P. Friedman: Embedding Continuations in Procedural Objects. 582-598","address":"https://doi.org/10.1145/29873.30392","index":874},"https://doi.org/10.1145/29873.31334":{"title":"Janice E. Cuny, Lawrence Snyder: Conversion from Data-Driven to Synchronous Execution in Loop Programs. 599-617","address":"https://doi.org/10.1145/29873.31334","index":875},"https://doi.org/10.1145/29873.31333":{"title":"Lubomir Bic, Craig Lee: A Data-Driven Model for a Subset of Logic Programming. 618-645","address":"https://doi.org/10.1145/29873.31333","index":876},"https://doi.org/10.1145/29873.30399":{"title":"Jacques Loeckx: Algorithmic Specifications: A Constructive Specification Method for Abstract Data Types. 646-685","address":"https://doi.org/10.1145/29873.30399","index":877},"https://doi.org/10.1145/5001.5390":{"title":"Keith L. Clark, Steve Gregory: Parlog: Parallel Programming in Logic. 1-49","address":"https://doi.org/10.1145/5001.5390","index":878},"https://doi.org/10.1145/5001.5005":{"title":"George B. Leeman Jr.: A Formal Approach to Undo Operations in Programming Languages. 50-87","address":"https://doi.org/10.1145/5001.5005","index":879},"https://doi.org/10.1145/5001.5004":{"title":"Robert M. Keller, M. Ronan Sleep: Applicative Caching. 88-108","address":"https://doi.org/10.1145/5001.5004","index":880},"https://doi.org/10.1145/5001.5003":{"title":"Keshav Pingali, Arvind: Efficient Demand-Driven Evaluation - Part 2. 109-139","address":"https://doi.org/10.1145/5001.5003","index":881},"https://doi.org/10.1145/5001.5007":{"title":"Jayadev Misra: Axioms for Memory Access in Asynchronous Hardware Systems. 142-153","address":"https://doi.org/10.1145/5001.5007","index":882},"https://doi.org/10.1145/5001.5002":{"title":"Mohamed G. Gouda, Chung-Kuo Chang: Proving Liveness for Networks of Communicating Finite State Machines. 154-182","address":"https://doi.org/10.1145/5001.5002","index":883},"https://doi.org/10.1145/5397.30847":{"title":"Laurian M. Chirica, David F. Martin: Toward Compiler Implementation Correctness Proofs. 185-214","address":"https://doi.org/10.1145/5397.30847","index":884},"https://doi.org/10.1145/5397.5918":{"title":"Christopher R. Spooner: The ML Approach to the Readable All-Purpose Language. 215-243","address":"https://doi.org/10.1145/5397.5918","index":885},"https://doi.org/10.1145/5397.5399":{"title":"Edmund M. Clarke, E. Allen Emerson, A. Prasad Sistla: Automatic Verification of Finite-State Concurrent Systems Using Temporal Logic Specifications. 244-263","address":"https://doi.org/10.1145/5397.5399","index":886},"https://doi.org/10.1145/5397.30850":{"title":"Thomas J. Sager: A Short Proof of a Conjecture of DeRemer and Pennello. 264-271","address":"https://doi.org/10.1145/5397.30850","index":887},"https://doi.org/10.1145/5956.5959":{"title":"Walter F. Tichy: Smart Recompilation. 273-291","address":"https://doi.org/10.1145/5956.5959","index":888},"https://doi.org/10.1145/5956.5957":{"title":"Valentin F. Turchin: The Concept of a Supercompiler. 292-325","address":"https://doi.org/10.1145/5956.5957","index":889},"https://doi.org/10.1145/5956.5958":{"title":"K. Mani Chandy, Jayadev Misra: An Example of Stepwise Refinement of Distributed Programs: Quiescence Detection. 326-343","address":"https://doi.org/10.1145/5956.5958","index":890},"https://doi.org/10.1145/5956.5999":{"title":"Matthew Hennessy: Proving Systolic Systems Correct. 344-387","address":"https://doi.org/10.1145/5956.5999","index":891},"https://doi.org/10.1145/5956.6000":{"title":"Krzysztof R. Apt: Correctness Proofs of Distributed Termination Algorithms. 388-405","address":"https://doi.org/10.1145/5956.6000","index":892},"https://doi.org/10.1145/6465.6466":{"title":"Daniel C. Swinehart, Polle T. Zellweger, Richard J. Beach, Robert Hagemann: A Structural View of the Cedar Programming Environment. 419-490","address":"https://doi.org/10.1145/6465.6466","index":893},"https://doi.org/10.1145/6465.6489":{"title":"Keith D. Cooper, Ken Kennedy, Linda Torczon: The Impact of Interprocedural Analysis and Optimization in the Rn Programming Environment. 491-523","address":"https://doi.org/10.1145/6465.6489","index":894},"https://doi.org/10.1145/6465.6478":{"title":"Mark Moriconi, Dwight F. Hare: The PegaSys System: Pictures as Formal Documentation of Large Programs. 524-546","address":"https://doi.org/10.1145/6465.6478","index":895},"https://doi.org/10.1145/6465.20890":{"title":"Rolf Bahlke, Gregor Snelting: The PSG System: From Formal Language Definitions to Interactive Programming Environments. 547-576","address":"https://doi.org/10.1145/6465.20890","index":896},"https://doi.org/10.1145/6465.6512":{"title":"Susan Horwitz, Tim Teitelbaum: Generating Editing Environments Based on Relations and Attributes. 577-608","address":"https://doi.org/10.1145/6465.6512","index":897},"https://doi.org/10.1145/2363.2364":{"title":"David R. Barstow: On Convergence Toward a Database of Program Transformations. 1-9","address":"https://doi.org/10.1145/2363.2364","index":898},"https://doi.org/10.1145/2363.2365":{"title":"Pamela Zave: A Distributed Alternative to Finite-State-Machine Specifications. 10-36","address":"https://doi.org/10.1145/2363.2365","index":899},"https://doi.org/10.1145/2363.2366":{"title":"Jean-Francois Bergeretti, Bernard Carré: Information-Flow and Data-Flow Analysis of while-Programs. 37-61","address":"https://doi.org/10.1145/2363.2366","index":900},"https://doi.org/10.1145/2363.2367":{"title":"David R. Fuchs, Donald E. Knuth: Optimal Prepaging and Font Caching. 62-79","address":"https://doi.org/10.1145/2363.2367","index":901},"https://doi.org/10.1145/2363.2433":{"title":"David Gelernter: Generative Communication in Linda. 80-112","address":"https://doi.org/10.1145/2363.2433","index":902},"https://doi.org/10.1145/2363.2528":{"title":"Joseph L. Bates, Robert L. Constable: Proofs as Programs. 113-136","address":"https://doi.org/10.1145/2363.2528","index":903},"https://doi.org/10.1145/2363.2708":{"title":"Douglas D. Dunlop, Victor R. Basili: Generalizing Specifications for Uniformly Implemented Loops. 137-158","address":"https://doi.org/10.1145/2363.2708","index":904},"https://doi.org/10.1145/2363.2527":{"title":"Joseph C. H. Park, Kwang-Moo Choe, C. H. Chang: A New Analysis of LALR Formalisms. 159-175","address":"https://doi.org/10.1145/2363.2527","index":905},"https://doi.org/10.1145/2363.215005":{"title":"David W. Wall, Amitabh Srivastava, Fred Templin: A Note on Hennessy's \"Symbolic Debugging of Optimized Code\". 176-181","address":"https://doi.org/10.1145/2363.215005","index":906},"https://doi.org/10.1145/3318.3321":{"title":"Jan Heering, Paul Klint: Towards Monolingual Programming Environments. 183-213","address":"https://doi.org/10.1145/3318.3321","index":907},"https://doi.org/10.1145/3318.3320":{"title":"Shaula Yemini, Daniel M. Berry: A Modular Verifiable Exception-Handling Mechanism. 214-243","address":"https://doi.org/10.1145/3318.3320","index":908},"https://doi.org/10.1145/3318.3319":{"title":"William E. Weihl, Barbara Liskov: Implementation of Resilient, Atomic Data Types. 244-269","address":"https://doi.org/10.1145/3318.3319","index":909},"https://doi.org/10.1145/3318.3322":{"title":"George J. Milne: Circal and the Representation of Communication, Concurrency, and Time. 270-298","address":"https://doi.org/10.1145/3318.3322","index":910},"https://doi.org/10.1145/3318.3323":{"title":"David A. Schmidt: Detecting Global Variables in Denotational Specifications. 299-310","address":"https://doi.org/10.1145/3318.3323","index":911},"https://doi.org/10.1145/3318.3480":{"title":"Keshav Pingali, Arvind: Efficient Demand-Driven Evaluation - Part 1. 311-333","address":"https://doi.org/10.1145/3318.3480","index":912},"https://doi.org/10.1145/3318.3479":{"title":"Giuseppina C. Gini, Maria L. Gini: Dealing with World-Model-Based Programs. 334-347","address":"https://doi.org/10.1145/3318.3479","index":913},"https://doi.org/10.1145/3318.3478":{"title":"Ilan Bar-On, Uzi Vishkin: Optimal Parallel Generation of a Computation Tree Form. 348-357","address":"https://doi.org/10.1145/3318.3478","index":914},"https://doi.org/10.1145/3916.3917":{"title":"Flemming Nielson: Program Transformations in a Denotational Setting. 359-379","address":"https://doi.org/10.1145/3916.3917","index":915},"https://doi.org/10.1145/3916.3989":{"title":"George S. Avrunin, Jack C. Wileden: Describing and Analyzing Distributed Software System Designs. 380-403","address":"https://doi.org/10.1145/3916.3989","index":916},"https://doi.org/10.1145/3916.3988":{"title":"David R. Jefferson: Virtual Time. 404-425","address":"https://doi.org/10.1145/3916.3988","index":917},"https://doi.org/10.1145/3916.3987":{"title":"James E. Donahue, Alan J. Demers: Data Types Are Values. 426-445","address":"https://doi.org/10.1145/3916.3987","index":918},"https://doi.org/10.1145/3916.3986":{"title":"Nachum Dershowitz: Program Abstraction and Instantiation. 446-477","address":"https://doi.org/10.1145/3916.3986","index":919},"https://doi.org/10.1145/3916.4019":{"title":"Helmut Richter: Noncorrecting Syntax Error Recovery. 478-489","address":"https://doi.org/10.1145/3916.4019","index":920},"https://doi.org/10.1145/4472.4478":{"title":"Robert H. Halstead Jr.: Multilisp: A Language for Concurrent Symbolic Computation. 501-538","address":"https://doi.org/10.1145/4472.4478","index":921},"https://doi.org/10.1145/4472.4477":{"title":"Malcolm P. Atkinson, Ronald Morrison: Procedures as Persistent Data Objects. 539-559","address":"https://doi.org/10.1145/4472.4477","index":922},"https://doi.org/10.1145/4472.4486":{"title":"Mahadevan Ganapathi, Charles N. Fischer: Affix Grammar Driven Code Generation. 560-599","address":"https://doi.org/10.1145/4472.4486","index":923},"https://doi.org/10.1145/4472.4476":{"title":"Robert P. Nix: Editing by Example. 600-621","address":"https://doi.org/10.1145/4472.4476","index":924},"https://doi.org/10.1145/4472.4475":{"title":"Nissim Francez, Shaula Yemini: Symmetric Intertask Communication. 622-636","address":"https://doi.org/10.1145/4472.4475","index":925},"https://doi.org/10.1145/4472.4474":{"title":"Hans-Juergen Boehm: Side Effects and Aliasing Can Have Simple Axiomatic Descriptions. 637-655","address":"https://doi.org/10.1145/4472.4474","index":926},"https://doi.org/10.1145/4472.4473":{"title":"Arie de Bruin, A. P. Wim Böhm: The Denotational Semantics of Dynamic Networks of Processes. 656-679","address":"https://doi.org/10.1145/4472.4473","index":927},"https://doi.org/10.1145/4472.215006":{"title":"Alberto Pettorossi: A Note on Cohen's \"Eliminating Redundant Recursive Calls\". 680-685","address":"https://doi.org/10.1145/4472.215006","index":928},"https://doi.org/10.1145/357233.357234":{"title":"James E. Archer Jr., Richard Conway, Fred B. Schneider: User Recovery and Reversal in Interactive Systems. 1-19","address":"https://doi.org/10.1145/357233.357234","index":929},"https://doi.org/10.1145/357233.357235":{"title":"Robert D. Cameron, Mabo Robert Ito: Grammar-Based Definition of Metaprogramming Systems. 20-54","address":"https://doi.org/10.1145/357233.357235","index":930},"https://doi.org/10.1145/357233.357236":{"title":"L. Colussi: Recursion As an Effective Step in Program Development. 55-67","address":"https://doi.org/10.1145/357233.357236","index":931},"https://doi.org/10.1145/357233.357237":{"title":"Zohar Manna, Pierre Wolper: Synthesis of Communicating Processes from Temporal Logic Specifications. 68-93","address":"https://doi.org/10.1145/357233.357237","index":932},"https://doi.org/10.1145/357233.357238":{"title":"Robert L. Constable, Daniel R. Zlatin: The Type Theory of PL/CV3. 94-117","address":"https://doi.org/10.1145/357233.357238","index":933},"https://doi.org/10.1145/357233.357239":{"title":"Arie E. Kaufman: Tailored-List and Recombination-Delaying Buddy Systems. 118-125","address":"https://doi.org/10.1145/357233.357239","index":934},"https://doi.org/10.1145/2993.69615":{"title":"William F. Appelbe, Anders P. Ravn: Encapsulation Constructs in Systems Programming Languages. 129-158","address":"https://doi.org/10.1145/2993.69615","index":935},"https://doi.org/10.1145/2993.357241":{"title":"F. Warren Burton: Annotations to Control Parallelism, Reduction Order in the Distributed Evaluation of Functional Programs. 159-174","address":"https://doi.org/10.1145/2993.357241","index":936},"https://doi.org/10.1145/2993.2381":{"title":"M. Elizabeth C. Hull, R. M. McKeag: Communicating Sequential Processes for Centralized and Distributed Operating System Design. 175-191","address":"https://doi.org/10.1145/2993.2381","index":937},"https://doi.org/10.1145/2993.357243":{"title":"Roland Carl Backhouse: Global Data Flow Analysis Problems Arising in Locally Least-Cost Error Recovery. 192-214","address":"https://doi.org/10.1145/2993.357243","index":938},"https://doi.org/10.1145/2993.357244":{"title":"John H. Reif, Paul G. Spirakis: Real-Time Synchronization of Interprocess Communications. 215-238","address":"https://doi.org/10.1145/2993.357244","index":939},"https://doi.org/10.1145/2993.357245":{"title":"Richard Alan Karp: Proving Failure-Free Properties of Concurrent Systems Using Temporal Logic. 239-253","address":"https://doi.org/10.1145/2993.357245","index":940},"https://doi.org/10.1145/2993.2994":{"title":"Leslie Lamport: Using Time Instead of Timeout for Fault-Tolerant Distributed Systems. 254-280","address":"https://doi.org/10.1145/2993.2994","index":941},"https://doi.org/10.1145/2993.357247":{"title":"Leslie Lamport, Fred B. Schneider: The \"Hoare Logic\" of CSP, and All That. 281-296","address":"https://doi.org/10.1145/2993.357247","index":942},"https://doi.org/10.1145/579.357248":{"title":"Timothy A. Budd: An APL Compiler for a Vector Processor. 297-313","address":"https://doi.org/10.1145/579.357248","index":943},"https://doi.org/10.1145/579.580":{"title":"Richard F. Hobson: A Directly Executable Encoding for APL. 314-332","address":"https://doi.org/10.1145/579.580","index":944},"https://doi.org/10.1145/579.587":{"title":"Mordechai Ben-Ari: Algorithms for On-the-fly Garbage Collection. 333-344","address":"https://doi.org/10.1145/579.587","index":945},"https://doi.org/10.1145/579.586":{"title":"Takuya Katayama: Translation of Attribute Grammars into Procedures. 345-369","address":"https://doi.org/10.1145/579.586","index":946},"https://doi.org/10.1145/579.584":{"title":"Krzysztof R. Apt, Nissim Francez: Modeling the Distributed Termination Convention of CSP. 370-379","address":"https://doi.org/10.1145/579.584","index":947},"https://doi.org/10.1145/579.585":{"title":"Ephraim Korach, Doron Rotem, Nicola Santoro: Distributed Algorithms for Finding Centers and Medians in Networks. 380-401","address":"https://doi.org/10.1145/579.585","index":948},"https://doi.org/10.1145/579.583":{"title":"Richard D. Schlichting, Fred B. Schneider: Using Message Passing for Distributed Programming: Proof Rules, Disciplines. 402-431","address":"https://doi.org/10.1145/579.583","index":949},"https://doi.org/10.1145/579.357255":{"title":"Wilf R. LaLonde: Comments on Soisalon-Soininen's \"Inessential Error Entries\". 432-439","address":"https://doi.org/10.1145/579.357255","index":950},"https://doi.org/10.1145/1780.1785":{"title":"Robert I. Winner: Unassigned Objects. 449-467","address":"https://doi.org/10.1145/1780.1785","index":951},"https://doi.org/10.1145/1780.1784":{"title":"Franco Turini: Magma2: A Language Oriented toward Experiments in Control. 468-486","address":"https://doi.org/10.1145/1780.1784","index":952},"https://doi.org/10.1145/1780.1781":{"title":"Richard S. Bird: The Promotion and Accumulation Strategies in Transformational Programming. 487-504","address":"https://doi.org/10.1145/1780.1781","index":953},"https://doi.org/10.1145/1780.1783":{"title":"Jack W. Davidson, Christopher W. Fraser: Code Selection through Object Code Optimization. 505-526","address":"https://doi.org/10.1145/1780.1783","index":954},"https://doi.org/10.1145/1780.357262":{"title":"M. V. S. Ramanath, Marvin H. Solomon: Jump Minimization in Linear Time. 527-545","address":"https://doi.org/10.1145/1780.357262","index":955},"https://doi.org/10.1145/1780.1802":{"title":"Peter Dencker, Karl Dürre, Johannes Heuft: Optimization of Parser Tables for Portable Compilers. 546-572","address":"https://doi.org/10.1145/1780.1802","index":956},"https://doi.org/10.1145/1780.1786":{"title":"Naftaly H. Minsky: Selective and Locally Controlled Transport of Privileges. 573-602","address":"https://doi.org/10.1145/1780.1786","index":957},"https://doi.org/10.1145/1780.1803":{"title":"Michael P. Georgeff: Transformations and Reduction Strategies for Typed Lambda Expressions. 603-631","address":"https://doi.org/10.1145/1780.1803","index":958},"https://doi.org/10.1145/1780.1804":{"title":"K. Mani Chandy, Jayadev Misra: The Drinking Philosopher's Problem. 632-646","address":"https://doi.org/10.1145/1780.1804","index":959},"https://doi.org/10.1145/1780.1805":{"title":"Neelam Soundararajan: Axiomatic Semantics of Communicating Sequential Processes. 647-662","address":"https://doi.org/10.1145/1780.1805","index":960},"https://doi.org/10.1145/357195.357196":{"title":"Philip M. Merlin, Gregor von Bochmann: On the Construction of Submodule Specifications and Communication Protocols. 1-25","address":"https://doi.org/10.1145/357195.357196","index":961},"https://doi.org/10.1145/357195.357197":{"title":"Stefan M. Freudenberger, Jacob T. Schwartz, Micha Sharir: Experience with the SETL Optimizer. 26-45","address":"https://doi.org/10.1145/357195.357197","index":962},"https://doi.org/10.1145/357195.357198":{"title":"Gary L. Peterson: Concurrent Reading While Writing. 46-55","address":"https://doi.org/10.1145/357195.357198","index":963},"https://doi.org/10.1145/357195.357199":{"title":"Gary L. Peterson: A New Solution to Lamport's Concurrent Programming Problem Using Small Shared Variables. 56-65","address":"https://doi.org/10.1145/357195.357199","index":964},"https://doi.org/10.1145/357195.357200":{"title":"Robert G. Gallager, Pierre A. Humblet, Philip M. Spira: A Distributed Algorithm for Minimum-Weight Spanning Trees. 66-77","address":"https://doi.org/10.1145/357195.357200","index":965},"https://doi.org/10.1145/357195.357201":{"title":"Richard B. Kieburtz, Abraham Silberschatz: Access-Right Expressions. 78-96","address":"https://doi.org/10.1145/357195.357201","index":966},"https://doi.org/10.1145/357195.357202":{"title":"Samuel N. Kamin: Final Data Types and Their Specification. 97-123","address":"https://doi.org/10.1145/357195.357202","index":967},"https://doi.org/10.1145/69624.69625":{"title":"Steven P. Reiss: Generation of Compiler Symbol Processing Mechanisms. 127-163","address":"https://doi.org/10.1145/69624.69625","index":968},"https://doi.org/10.1145/69624.357206":{"title":"Allan Gottlieb, Boris D. Lubachevsky, Larry Rudolph: Basic Techniques for the Efficient Coordination of Very Large Numbers of Cooperating Sequential Processors. 164-189","address":"https://doi.org/10.1145/69624.357206","index":969},"https://doi.org/10.1145/69624.357207":{"title":"Leslie Lamport: Specifying Concurrent Program Modules. 190-222","address":"https://doi.org/10.1145/69624.357207","index":970},"https://doi.org/10.1145/69624.357208":{"title":"Gael N. Buckley, Abraham Silberschatz: An Effective Implementation for the Generalized Input-Output Construct of CSP. 223-235","address":"https://doi.org/10.1145/69624.357208","index":971},"https://doi.org/10.1145/69624.357209":{"title":"B. Maher, Derek H. Sleeman: Automatic Program Improvement: Variable Usage Transformations. 236-264","address":"https://doi.org/10.1145/69624.357209","index":972},"https://doi.org/10.1145/2166.2167":{"title":"Norman H. Cohen: Eliminating Redundant Recursive Calls. 265-299","address":"https://doi.org/10.1145/2166.2167","index":973},"https://doi.org/10.1145/2166.357211":{"title":"Eliezer Dekel, Sartaj Sahni: Parallel Generation of Postfix and Tree Forms. 300-317","address":"https://doi.org/10.1145/2166.357211","index":974},"https://doi.org/10.1145/2166.357212":{"title":"Harald Ganzinger: Parameterized Specifications: Parameter Passing and Implementation with Respect to Observability. 318-354","address":"https://doi.org/10.1145/2166.357212","index":975},"https://doi.org/10.1145/2166.357214":{"title":"Sergiu Hart, Micha Sharir, Amir Pnueli: Termination of Probabilistic Concurrent Program. 356-380","address":"https://doi.org/10.1145/2166.357214","index":976},"https://doi.org/10.1145/2166.357215":{"title":"Barbara Liskov, Robert Scheifler: Guardians and Actions: Linguistic Support for Robust, Distributed Programs. 381-404","address":"https://doi.org/10.1145/2166.357215","index":977},"https://doi.org/10.1145/2166.357216":{"title":"Richard J. Lipton, Jacobo Valdes, Gopalakrishnan Vijayan, Stephen C. North, Robert Sedgewick: VLSI Layout as Programming. 405-421","address":"https://doi.org/10.1145/2166.357216","index":978},"https://doi.org/10.1145/2166.357217":{"title":"John L. Hennessy, Thomas R. Gross: Postpass Code Optimization of Pipeline Constraints. 422-448","address":"https://doi.org/10.1145/2166.357217","index":979},"https://doi.org/10.1145/2166.357218":{"title":"Thomas W. Reps, Tim Teitelbaum, Alan J. Demers: Incremental Context-Dependent Analysis for Language-Based Editors. 449-477","address":"https://doi.org/10.1145/2166.357218","index":980},"https://doi.org/10.1145/2166.357219":{"title":"Robert Giegerich: A Formal Framework for the Derivation of Machine-Specific Optimizers. 478-498","address":"https://doi.org/10.1145/2166.357219","index":981},"https://doi.org/10.1145/69575.357225":{"title":"Richard C. Waters: User Format Control in a Lisp Prettyprinter. 513-531","address":"https://doi.org/10.1145/69575.357225","index":982},"https://doi.org/10.1145/69575.357226":{"title":"Jacques Cohen, Alexandru Nicolau: Comparison of Compacting Algorithms for Garbage Collection. 532-553","address":"https://doi.org/10.1145/69575.357226","index":983},"https://doi.org/10.1145/69575.357227":{"title":"Ravi Sethi: Control Flow Aspects of Semantics-Directed Compiling. 554-595","address":"https://doi.org/10.1145/69575.357227","index":984},"https://doi.org/10.1145/69575.69577":{"title":"Cliff B. Jones: Tentative Steps Toward a Development Method for Interfering Programs. 596-619","address":"https://doi.org/10.1145/69575.69577","index":985},"https://doi.org/10.1145/69575.2083":{"title":"Marty Ossefort: Correctness Proofs of Communicating Processes: Three Illustrative Examples from the Literature. 620-640","address":"https://doi.org/10.1145/69575.2083","index":986},"https://doi.org/10.1145/69575.357231":{"title":"Elaine J. Weyuker: Assessing Test Data Adequacy through Program Inference. 641-655","address":"https://doi.org/10.1145/69575.357231","index":987},"https://doi.org/10.1145/69575.357232":{"title":"Seppo Sippu, Eljas Soisalon-Soininen: A Syntax-Error-Handling Technique and Its Experimental Analysis. 656-679","address":"https://doi.org/10.1145/69575.357232","index":988},"https://doi.org/10.1145/357153.357154":{"title":"Martin S. Feather: A System for Assisting Program Transformation. 1-20","address":"https://doi.org/10.1145/357153.357154","index":989},"https://doi.org/10.1145/357153.357155":{"title":"Andrew S. Tanenbaum, Hans van Staveren, Johan W. Stevenson: Using Peephole Optimization on Intermediate Code. 21-36","address":"https://doi.org/10.1145/357153.357155","index":990},"https://doi.org/10.1145/357153.357156":{"title":"Jayadev Misra, K. Mani Chandy: Termination Detection of Diffusing Computations in Communicating Sequential Processes. 37-43","address":"https://doi.org/10.1145/357153.357156","index":991},"https://doi.org/10.1145/357153.357157":{"title":"James R. McGraw: The VAL Language: Description and Analysis. 44-82","address":"https://doi.org/10.1145/357153.357157","index":992},"https://doi.org/10.1145/357153.357158":{"title":"Christoph M. Hoffmann, Michael J. O'Donnell: Programming with Equations. 83-112","address":"https://doi.org/10.1145/357153.357158","index":993},"https://doi.org/10.1145/357153.357159":{"title":"M. Howard Williams: A Flexible Notation for Syntactic Definitions. 113-119","address":"https://doi.org/10.1145/357153.357159","index":994},"https://doi.org/10.1145/357162.357163":{"title":"Fred B. Schneider: Synchronization in Distributed Programs. 125-148","address":"https://doi.org/10.1145/357162.357163","index":995},"https://doi.org/10.1145/357162.357164":{"title":"Richard C. Holt, James R. Cordy, David B. Wortman: An Introduction to S/SL: Syntax/Semantic Language. 149-178","address":"https://doi.org/10.1145/357162.357164","index":996},"https://doi.org/10.1145/357162.357165":{"title":"Eljas Soisalon-Soininen: Inessential Error Entries and Their Use in LR Parser Optimization. 179-195","address":"https://doi.org/10.1145/357162.357165","index":997},"https://doi.org/10.1145/357162.357166":{"title":"Micha Sharir: Some Observations Concerning Formal Differentiation of Set Theoretic Expressions. 196-225","address":"https://doi.org/10.1145/357162.357166","index":998},"https://doi.org/10.1145/357162.357167":{"title":"Charles S. Wetherell: Error Data Values in the Data-Flow Language VAL. 226-238","address":"https://doi.org/10.1145/357162.357167","index":999},"https://doi.org/10.1145/357162.357168":{"title":"Richard J. Fateman: High-Level Language Implications of the Proposed IEEE Floating-Point Standard. 239-257","address":"https://doi.org/10.1145/357162.357168","index":1000},"https://doi.org/10.1145/357162.357169":{"title":"Alberto Martelli, Ugo Montanari: An Efficient Unification Algorithm. 258-282","address":"https://doi.org/10.1145/357162.357169","index":1001},"https://doi.org/10.1145/357162.357170":{"title":"Edward A. Ashcroft, William W. Wadge: R/ for Semantics. 283-294","address":"https://doi.org/10.1145/357162.357170","index":1002},"https://doi.org/10.1145/357162.357171":{"title":"Jacques J. Arsac, Yves Kodratoff: Some Techniques for Recursion Removal from Recursive Programs. 295-322","address":"https://doi.org/10.1145/357162.357171","index":1003},"https://doi.org/10.1145/357172.357173":{"title":"John L. Hennessy: Symbolic Debugging of Optimized Code. 323-344","address":"https://doi.org/10.1145/357172.357173","index":1004},"https://doi.org/10.1145/357172.357174":{"title":"Paolo Sipala: Compact Storage of Binary Trees. 345-361","address":"https://doi.org/10.1145/357172.357174","index":1005},"https://doi.org/10.1145/357172.357175":{"title":"Manfred Broy, Peter Pepper: Combining Algebraic and Algorithmic Reasoning: An Approach to the Schorr-Waite Algorithm. 362-381","address":"https://doi.org/10.1145/357172.357175","index":1006},"http://doi.acm.org/10.1145/357172.357176":{"title":"Leslie Lamport, Robert E. Shostak, Marshall C. Pease: The Byzantine Generals Problem. 382-401","address":"http://doi.acm.org/10.1145/357172.357176","index":1007},"https://doi.org/10.1145/357172.357177":{"title":"Robert Paige, Shaye Koenig: Finite Differencing of Computable Expressions. 402-454","address":"https://doi.org/10.1145/357172.357177","index":1008},"https://doi.org/10.1145/357172.357178":{"title":"Susan S. Owicki, Leslie Lamport: Proving Liveness Properties of Concurrent Programs. 455-495","address":"https://doi.org/10.1145/357172.357178","index":1009},"https://doi.org/10.1145/357172.357179":{"title":"Mitchell Wand: Deriving Target Code as a Representation of Continuation Semantics. 496-517","address":"https://doi.org/10.1145/357172.357179","index":1010},"https://doi.org/10.1145/69622.357182":{"title":"Maurice Herlihy, Barbara Liskov: A Value Transmission Method for Abstract Data Types. 527-551","address":"https://doi.org/10.1145/69622.357182","index":1011},"https://doi.org/10.1145/69622.357183":{"title":"Richard C. Holt, David B. Wortman: A Model for Implementing Euclid Modules and Prototypes. 552-562","address":"https://doi.org/10.1145/69622.357183","index":1012},"https://doi.org/10.1145/69622.357184":{"title":"Ralph E. Griswold: The Evaluation of Expressions in Icon. 563-584","address":"https://doi.org/10.1145/69622.357184","index":1013},"https://doi.org/10.1145/69622.357185":{"title":"J. Bergeron, A. Dubuque: A Structured APL System. 585-600","address":"https://doi.org/10.1145/69622.357185","index":1014},"https://doi.org/10.1145/69622.69623":{"title":"Theodore P. Baker: A One-Pass Algorithm for Overload Resolution in Ada. 601-614","address":"https://doi.org/10.1145/69622.69623","index":1015},"https://doi.org/10.1145/69622.357187":{"title":"Frank DeRemer, Thomas J. Pennello: Efficient Computation of LALR(1) Look-Ahead Sets. 615-649","address":"https://doi.org/10.1145/69622.357187","index":1016},"https://doi.org/10.1145/69622.357188":{"title":"Robert B. K. Dewar, Micha Sharir, Elia Weixelbaum: Transformational Derivation of a Garbage Collection Algorithm. 650-667","address":"https://doi.org/10.1145/69622.357188","index":1017},"https://doi.org/10.1145/69622.357189":{"title":"H. J. Boom: A Weaker Precondition for Loops. 668-677","address":"https://doi.org/10.1145/69622.357189","index":1018},"https://doi.org/10.1145/69622.357190":{"title":"Jayadev Misra, K. Mani Chandy: A Distributed Graph Algorithm: Knot Detection. 678-686","address":"https://doi.org/10.1145/69622.357190","index":1019},"https://doi.org/10.1145/69622.357191":{"title":"William R. Mallgren: Formal Specification of Graphic Data Types. 687-710","address":"https://doi.org/10.1145/69622.357191","index":1020},"https://doi.org/10.1145/69622.357192":{"title":"James W. Thatcher, Eric G. Wagner, Jesse B. Wright: Data Type Specification: Parameterization and the Power of Specification Techniques. 711-732","address":"https://doi.org/10.1145/69622.357192","index":1021},"https://doi.org/10.1145/69622.357193":{"title":"John H. Williams: On the Development of the Algebra of Functional Programs. 733-757","address":"https://doi.org/10.1145/69622.357193","index":1022},"https://doi.org/10.1145/357121.357122":{"title":"Jørgen Steensgaard-Madsen: A Statement-Oriented Approach to Data Abstraction. 1-10","address":"https://doi.org/10.1145/357121.357122","index":1023},"https://doi.org/10.1145/357121.357123":{"title":"F. André, Jean-Pierre Banâtre, Jean-Paul Routeau: A Multiprocessing Approach to Compile-Time Symbol Resolution. 11-23","address":"https://doi.org/10.1145/357121.357123","index":1024},"https://doi.org/10.1145/357121.357124":{"title":"Otto C. Juelich, Clinton R. Foulk: Compilation of Acyclic Smooth Programs for Parallel Execution. 24-48","address":"https://doi.org/10.1145/357121.357124","index":1025},"https://doi.org/10.1145/357121.357125":{"title":"Dale H. Grit, Rex L. Page: Deleting Irrelevant Tasks in an Expression-Oriented Multiprocessor System. 49-59","address":"https://doi.org/10.1145/357121.357125","index":1026},"https://doi.org/10.1145/357121.357127":{"title":"Wilf R. LaLonde, Jim des Rivières: Handling Operator Precedence in Arithmetic Expressions with Tree Transformations. 83-103","address":"https://doi.org/10.1145/357121.357127","index":1027},"https://doi.org/10.1145/357121.357128":{"title":"Jayadev Misra: An Exercise in Program Explanation. 104-109","address":"https://doi.org/10.1145/357121.357128","index":1028},"https://doi.org/10.1145/357133.357134":{"title":"Christopher W. Fraser, A. A. Lopez: Editing Data Structures. 115-125","address":"https://doi.org/10.1145/357133.357134","index":1029},"https://doi.org/10.1145/357133.357135":{"title":"Edmond Schonberg, Jacob T. Schwartz, Micha Sharir: An Automatic Technique for Selection of Data Structures in SETL Programs. 126-143","address":"https://doi.org/10.1145/357133.357135","index":1030},"https://doi.org/10.1145/357133.357136":{"title":"Ralph E. Griswold, David R. Hanson, John T. Korb: Generators in Icon. 144-161","address":"https://doi.org/10.1145/357133.357136","index":1031},"https://doi.org/10.1145/357133.357137":{"title":"David R. Hanson: Algorithm 568: PDS - A Portable Directory System. 162-167","address":"https://doi.org/10.1145/357133.357137","index":1032},"https://doi.org/10.1145/357133.357138":{"title":"Wilf R. LaLonde: The Construction of Stack-Controlling LR Parsers for Regular Right Part Grammars. 168-206","address":"https://doi.org/10.1145/357133.357138","index":1033},"https://doi.org/10.1145/357139.357140":{"title":"John D. Gannon, Paul R. McMullin, Richard G. Hamlet: Data-Abstraction Implementation, Specification, and Testing. 211-223","address":"https://doi.org/10.1145/357139.357140","index":1034},"https://doi.org/10.1145/357139.357141":{"title":"Jan van den Bos, Marinus J. Plasmeijer, Jan Stroet: Process Communication Based on Input Specifications. 224-250","address":"https://doi.org/10.1145/357139.357141","index":1035},"https://doi.org/10.1145/357139.357142":{"title":"Martin Rem: Associons: A Program Notation with Tuples Instead of Variables. 251-262","address":"https://doi.org/10.1145/357139.357142","index":1036},"https://doi.org/10.1145/357139.357143":{"title":"Gary Lindstrom, Mary Lou Soffa: Referencing and Retention in Block-Structured Coroutines. 263-292","address":"https://doi.org/10.1145/357139.357143","index":1037},"https://doi.org/10.1145/357139.357144":{"title":"John A. Barnden: Nonsequentiality and Concrete Activity Phases in Discrete-Event Simulation Languages. 293-317","address":"https://doi.org/10.1145/357139.357144","index":1038},"https://doi.org/10.1145/357139.357145":{"title":"Stuart Oliver Anderson, Roland Carl Backhouse: Locally Least-Cost Error Recovery in Early's Algorithm. 318-347","address":"https://doi.org/10.1145/357139.357145","index":1039},"https://doi.org/10.1145/357146.357147":{"title":"Alan Borning: The Programming Language Aspects of ThingLab, a Constraint-Oriented Simulation Laboratory. 353-387","address":"https://doi.org/10.1145/357146.357147","index":1040},"https://doi.org/10.1145/357146.357148":{"title":"Mehdi Jazayeri, Diane Pozefsky: Space-Efficient Storage Management in an Attribute Grammar Evaluator. 388-404","address":"https://doi.org/10.1145/357146.357148","index":1041},"https://doi.org/10.1145/357146.357149":{"title":"Gregory R. Andrews: Synchronizing Resources. 405-430","address":"https://doi.org/10.1145/357146.357149","index":1042},"https://doi.org/10.1145/357146.357150":{"title":"Krzysztof R. Apt: Ten Years of Hoare's Logic: A Survey - Part 1. 431-483","address":"https://doi.org/10.1145/357146.357150","index":1043},"https://doi.org/10.1145/357146.357151":{"title":"Irene Greif, Albert R. Meyer: Specifying the Semantics of while Programs: A Tutorial and Critique of a Paper by Hoare and Lauer. 484-507","address":"https://doi.org/10.1145/357146.357151","index":1044},"https://doi.org/10.1145/357084.357085":{"title":"David Harel: And/Or Programs: A New Approach to Structured Programming. 1-17","address":"https://doi.org/10.1145/357084.357085","index":1045},"https://doi.org/10.1145/357084.357086":{"title":"Ajit B. Pai, Richard B. Kieburtz: Global Context Recovery: A New Strategy for Syntactic Error Recovery by Table-Drive Parsers. 18-41","address":"https://doi.org/10.1145/357084.357086","index":1046},"https://doi.org/10.1145/357084.357087":{"title":"Nissim Francez: Distributed Termination. 42-55","address":"https://doi.org/10.1145/357084.357087","index":1047},"https://doi.org/10.1145/357084.357088":{"title":"Gregory R. Andrews, Richard P. Reitman: An Axiomatic Approach to Information Flow in Programs. 56-76","address":"https://doi.org/10.1145/357084.357088","index":1048},"https://doi.org/10.1145/357084.357089":{"title":"Christos H. Papadimitriou, Philip A. Bernstein: On the Performance of Balanced Hashing Functions When the Keys Are Not Equiprobable. 77-89","address":"https://doi.org/10.1145/357084.357089","index":1049},"https://doi.org/10.1145/357084.357090":{"title":"Zohar Manna, Richard J. Waldinger: A Deductive Approach to Program Synthesis. 90-121","address":"https://doi.org/10.1145/357084.357090","index":1050},"https://doi.org/10.1145/357084.357091":{"title":"D. B. Arnold, M. Ronan Sleep: Uniform Random Generation of Balanced Parenthesis Strings. 122-128","address":"https://doi.org/10.1145/357084.357091","index":1051},"https://doi.org/10.1145/357084.357092":{"title":"Douglas Comer: A Note on Median Split Trees. 129-133","address":"https://doi.org/10.1145/357084.357092","index":1052},"https://doi.org/10.1145/357094.357095":{"title":"Peter J. L. Wallis: External Representations of Objects of User-Defined Type. 137-152","address":"https://doi.org/10.1145/357094.357095","index":1053},"https://doi.org/10.1145/357094.357096":{"title":"Ralph E. Griswold, David R. Hanson: An Alternative to the Use of Patterns in String Processing. 153-172","address":"https://doi.org/10.1145/357094.357096","index":1054},"https://doi.org/10.1145/357094.357097":{"title":"R. G. G. Cattell: Automatic Derivation of Code Generators from Machine Descriptions. 173-190","address":"https://doi.org/10.1145/357094.357097","index":1055},"https://doi.org/10.1145/357094.357098":{"title":"Jack W. Davidson, Christopher W. Fraser: The Design and Application of a Retargetable Peephole Optimizer. 191-202","address":"https://doi.org/10.1145/357094.357098","index":1056},"https://doi.org/10.1145/357094.357099":{"title":"Charles N. Fischer: On Parsing and Compiling Arithmetic Expressions on Vector Computers. 203-224","address":"https://doi.org/10.1145/357094.357099","index":1057},"https://doi.org/10.1145/357094.357100":{"title":"David C. Luckham, Wolfgang Polak: Ada Exception Handling: An Axiomatic Approach. 225-233","address":"https://doi.org/10.1145/357094.357100","index":1058},"https://doi.org/10.1145/357094.357101":{"title":"Arthur J. Bernstein: Output Guards and Nondeterminism in \"Communicating Sequential Processes\". 234-238","address":"https://doi.org/10.1145/357094.357101","index":1059},"https://doi.org/10.1145/357094.357102":{"title":"Perng-Yi Richard Ma, Ted G. Lewis: Design of a Machine-Independent Optimizing System for Emulator Development. 239-262","address":"https://doi.org/10.1145/357094.357102","index":1060},"https://doi.org/10.1145/357103.357104":{"title":"Daniel G. Bobrow: Managing Reentrant Structures Using Reference Counts. 269-273","address":"https://doi.org/10.1145/357103.357104","index":1061},"https://doi.org/10.1145/357103.357105":{"title":"Bruce W. Leverett, Thomas G. Szymanski: Chaining Span-Dependent Jump Instructions. 274-289","address":"https://doi.org/10.1145/357103.357105","index":1062},"https://doi.org/10.1145/357103.357106":{"title":"Hanan Samet: A Coroutine Approach to Parsing. 290-306","address":"https://doi.org/10.1145/357103.357106","index":1063},"https://doi.org/10.1145/357103.357107":{"title":"William E. Howden: Applicability of Software Validation Techniques to Scientific Programs. 307-320","address":"https://doi.org/10.1145/357103.357107","index":1064},"https://doi.org/10.1145/357103.357108":{"title":"Manfred Broy, Bernd Krieg-Brückner: Derivation of Invariant Assertions During Program Development by Transformation. 321-337","address":"https://doi.org/10.1145/357103.357108","index":1065},"https://doi.org/10.1145/357103.357109":{"title":"Edmund M. Clarke: Synthesis of Resource Invariants for Concurrent Programs. 338-358","address":"https://doi.org/10.1145/357103.357109","index":1066},"https://doi.org/10.1145/357103.357110":{"title":"Krzysztof R. Apt, Nissim Francez, Willem P. de Roever: A Proof System for Communicating Sequential Processes. 359-385","address":"https://doi.org/10.1145/357103.357110","index":1067},"https://doi.org/10.1145/357103.357111":{"title":"Marco A. Casanova, Philip A. Bernstein: A Formal System for Reasoning about Programs Accessing a Relational Database. 386-414","address":"https://doi.org/10.1145/357103.357111","index":1068},"https://doi.org/10.1145/357103.357112":{"title":"Susan L. Graham, Michael A. Harrison, Walter L. Ruzzo: An Improved Context-Free Recognizer. 415-462","address":"https://doi.org/10.1145/357103.357112","index":1069},"https://doi.org/10.1145/357114.357115":{"title":"Derek C. Oppen: Prettyprinting. 465-483","address":"https://doi.org/10.1145/357114.357115","index":1070},"https://doi.org/10.1145/357114.357116":{"title":"Jacob T. Schwartz: Ultracomputers. 484-521","address":"https://doi.org/10.1145/357114.357116","index":1071},"https://doi.org/10.1145/357114.357117":{"title":"George W. Ernst, William F. Ogden: Specification of Abstract Data Types in Modula. 522-543","address":"https://doi.org/10.1145/357114.357117","index":1072},"https://doi.org/10.1145/357114.357118":{"title":"Carl E. Landwehr: An Abstract Type for Statistics Collection in Simula. 544-563","address":"https://doi.org/10.1145/357114.357118","index":1073},"https://doi.org/10.1145/357114.357119":{"title":"David Gries, Gary Levin: Assignment and Procedure Call Proof Rules. 564-579","address":"https://doi.org/10.1145/357114.357119","index":1074},"https://doi.org/10.1145/357114.357120":{"title":"Bernard M. E. Moret, Michael G. Thomason, Rafael C. González: The Activity of a Variable and Its Relation to Decision Trees. 580-595","address":"https://doi.org/10.1145/357114.357120","index":1075},"https://doi.org/10.1145/357062.357063":{"title":"Gary Lindstrom: Backtracking in a Generalized Control Setting. 8-26","address":"https://doi.org/10.1145/357062.357063","index":1076},"https://doi.org/10.1145/357062.357064":{"title":"Robert B. K. Dewar, Arthur Grand, Ssu-Cheng Liu, Jacob T. Schwartz, Edmond Schonberg: Programming by Refinement, as Exemplified by the SETL Representation Sublanguage. 27-49","address":"https://doi.org/10.1145/357062.357064","index":1077},"https://doi.org/10.1145/357062.357065":{"title":"Richard L. Sites: The Compilation of Loop Induction Expressions. 50-57","address":"https://doi.org/10.1145/357062.357065","index":1078},"https://doi.org/10.1145/357062.357066":{"title":"Carlo Ghezzi, Dino Mandrioli: Incremental Parsing. 58-70","address":"https://doi.org/10.1145/357062.357066","index":1079},"https://doi.org/10.1145/357062.357067":{"title":"Edward L. Robertson: Code Generation and Storage Allocation for Machines with Span-Dependent Instructions. 71-83","address":"https://doi.org/10.1145/357062.357067","index":1080},"https://doi.org/10.1145/357062.357068":{"title":"Leslie Lamport: A New Approach to Proving the Correctness of Multiprocess Programs. 84-97","address":"https://doi.org/10.1145/357062.357068","index":1081},"https://doi.org/10.1145/357062.357069":{"title":"Robert L. Constable, James E. Donahue: A Hierarchial Approach to Formal Semantics With Application to the Definition of PL/CS. 98-114","address":"https://doi.org/10.1145/357062.357069","index":1082},"https://doi.org/10.1145/357062.357070":{"title":"David S. Wise: Morris's Garbage Compaction Algorithm Restores Reference Counts. 115-120","address":"https://doi.org/10.1145/357062.357070","index":1083},"https://doi.org/10.1145/357062.357071":{"title":"Thomas Lengauer, Robert Endre Tarjan: A Fast Algorithm for Finding Dominators in a Flowgraph. 121-141","address":"https://doi.org/10.1145/357062.357071","index":1084},"https://doi.org/10.1145/357062.357072":{"title":"Ken Kennedy, Jayashree Ramanathan: A Deterministic Attribute Grammar Evaluator Based on Dynamic Scheduling. 142-160","address":"https://doi.org/10.1145/357062.357072","index":1085},"https://doi.org/10.1145/357073.357074":{"title":"Kenneth E. Iverson: Operators. 161-176","address":"https://doi.org/10.1145/357073.357074","index":1086},"https://doi.org/10.1145/357073.357075":{"title":"Ronald H. Perrott: A Language for Array and Vector Processors. 177-195","address":"https://doi.org/10.1145/357073.357075","index":1087},"https://doi.org/10.1145/357073.357076":{"title":"Noah S. Prywes, Amir Pnueli, S. Shastry: Use of a Nonprocedural Specification Language and Associated Program Generator in Software Development. 196-217","address":"https://doi.org/10.1145/357073.357076","index":1088},"https://doi.org/10.1145/357073.357077":{"title":"Richard B. Kieburtz, Abraham Silberschatz: Comments on \"Communicating Sequential Processes\". 218-225","address":"https://doi.org/10.1145/357073.357077","index":1089},"https://doi.org/10.1145/357073.357078":{"title":"David C. Luckham, Norihisa Suzuki: Verification of Array, Record, and Pointer Operations in Pascal. 226-244","address":"https://doi.org/10.1145/357073.357078","index":1090},"https://doi.org/10.1145/357073.357079":{"title":"Greg Nelson, Derek C. Oppen: Simplification by Cooperating Decision Procedures. 245-257","address":"https://doi.org/10.1145/357073.357079","index":1091},"https://doi.org/10.1145/357073.357080":{"title":"David Gries: Is Sometimes Ever Better Than Alway? 258-265","address":"https://doi.org/10.1145/357073.357080","index":1092},"https://doi.org/10.1145/357073.357081":{"title":"Daniel G. Bobrow, Douglas W. Clark: Compact Encodings of List Structure. 266-286","address":"https://doi.org/10.1145/357073.357081","index":1093},"https://doi.org/10.1145/357073.357082":{"title":"Eric Beyer, Peter Buneman: A Space Efficient Dynamic Allocation Algorithm for Queuing Messages. 287-294","address":"https://doi.org/10.1145/357073.357082","index":1094},"https://doi.org/10.1145/357073.357083":{"title":"Kuo-Chung Tai: Noncanonical SLR(1) Grammars. 295-320","address":"https://doi.org/10.1145/357073.357083","index":1095},"index":0}